{
  "phrases": [
  {
    "es": "¿Qué hiciste el fin de semana pasado?",
    "en": "What did you do last weekend?"
  },
  {
    "es": "Fui al cine con mis amigos.",
    "en": "I went to the cinema with my friends."
  },
  {
    "es": "Nunca he estado en Japón.",
    "en": "I have never been to Japan."
  },
  {
    "es": "Si llueve mañana, me quedaré en casa.",
    "en": "If it rains tomorrow, I will stay at home."
  },
  {
    "es": "Ella ha vivido aquí durante cinco años.",
    "en": "She has lived here for five years."
  },
  {
    "es": "Deberías beber más agua todos los días.",
    "en": "You should drink more water every day."
  },
  {
    "es": "Voy a visitar a mis abuelos el próximo mes.",
    "en": "I'm going to visit my grandparents next month."
  },
  {
    "es": "Si tuviera más tiempo, aprendería a tocar la guitarra.",
    "en": "If I had more time, I would learn to play the guitar."
  },
  {
    "es": "Mientras caminaba a casa, empezó a llover.",
    "en": "While I was walking home, it started to rain."
  },
  {
    "es": "No he visto esa película todavía.",
    "en": "I haven't seen that movie yet."
  },
  {
    "es": "Él trabaja como ingeniero en una gran empresa.",
    "en": "He works as an engineer in a big company."
  },
  {
    "es": "¿Puedes ayudarme con esta caja, por favor?",
    "en": "Can you help me with this box, please?"
  },
  {
    "es": "Disfruto escuchando música en mi tiempo libre.",
    "en": "I enjoy listening to music in my free time."
  },
  {
    "es": "El tren llega a las 10:30 AM.",
    "en": "The train arrives at 10:30 AM."
  },
  {
    "es": "Anoche estudié para mi examen hasta medianoche.",
    "en": "Last night I studied for my exam until midnight."
  },
  {
    "es": "Hemos pedido pizza para la cena.",
    "en": "We have ordered pizza for dinner."
  },
  {
    "es": "Si yo fuera tú, aceptaría el trabajo.",
    "en": "If I were you, I would take the job."
  },
  {
    "es": "No pude ir a la fiesta porque estaba enfermo.",
    "en": "I couldn't go to the party because I was sick."
  },
  {
    "es": "¿A qué hora te levantaste esta mañana?",
    "en": "What time did you get up this morning?"
  },
  {
    "es": "Ella solía jugar al tenis cuando era niña.",
    "en": "She used to play tennis when she was a child."
  },
  {
    "es": "Este libro fue escrito por un autor famoso.",
    "en": "This book was written by a famous author."
  },
  {
    "es": "Estoy buscando mis llaves. ¿Las has visto?",
    "en": "I'm looking for my keys. Have you seen them?"
  },
  {
    "es": "Prometo que te llamaré más tarde.",
    "en": "I promise I will call you later."
  },
  {
    "es": "Aunque estaba cansado, terminé mi tarea.",
    "en": "Although I was tired, I finished my homework."
  },
  {
    "es": "¿Te gustaría ir a dar un paseo?",
    "en": "Would you like to go for a walk?"
  },
  {
    "es": "Mi hermano es más alto que yo.",
    "en": "My brother is taller than me."
  },
  {
    "es": "Este es el restaurante más caro de la ciudad.",
    "en": "This is the most expensive restaurant in the city."
  },
  {
    "es": "No he decidido qué hacer este verano.",
    "en": "I haven't decided what to do this summer."
  },
  {
    "es": "Él me dijo que estaba ocupado.",
    "en": "He told me that he was busy."
  },
  {
    "es": "Necesito comprar un poco de leche en la tienda.",
    "en": "I need to buy some milk from the store."
  },
  {
    "es": "Estaba viendo la tele cuando llamaste.",
    "en": "I was watching TV when you called."
  },
  {
    "es": "Si no te apuras, perderás el autobús.",
    "en": "If you don't hurry, you will miss the bus."
  },
  {
    "es": "¿Has terminado ya tus deberes?",
    "en": "Have you finished your homework yet?"
  },
  {
    "es": "Prefiero el té al café.",
    "en": "I prefer tea to coffee."
  },
  {
    "es": "Tenemos que estar en el aeropuerto a las 6 PM.",
    "en": "We have to be at the airport by 6 PM."
  },
  {
    "es": "Él quiere ser médico cuando crezca.",
    "en": "He wants to be a doctor when he grows up."
  },
  {
    "es": "El año pasado viajamos a Italia de vacaciones.",
    "en": "Last year we traveled to Italy for our holiday."
  },
  {
    "es": "Si ganara la lotería, compraría una casa nueva.",
    "en": "If I won the lottery, I would buy a new house."
  },
  {
    "es": "¿Podrías hablar más despacio, por favor?",
    "en": "Could you speak more slowly, please?"
  },
  {
    "es": "Ella está aprendiendo a conducir.",
    "en": "She is learning to drive."
  },
  {
    "es": "Mi comida favorita es la pasta.",
    "en": "My favorite food is pasta."
  },
  {
    "es": "Ayer no fui a trabajar porque no me sentía bien.",
    "en": "I didn't go to work yesterday because I wasn't feeling well."
  },
  {
    "es": "¿Has oído las noticias?",
    "en": "Have you heard the news?"
  },
  {
    "es": "Si tengo tiempo, iré de compras más tarde.",
    "en": "If I have time, I will go shopping later."
  },
  {
    "es": "Él es bueno jugando al ajedrez.",
    "en": "He is good at playing chess."
  },
  {
    "es": "La tienda cierra a las 9 de la noche.",
    "en": "The shop closes at 9 PM."
  },
  {
    "es": "¿Cuántos idiomas hablas?",
    "en": "How many languages do you speak?"
  },
  {
    "es": "No me gusta levantarme temprano los fines de semana.",
    "en": "I don't like getting up early on weekends."
  },
  {
    "es": "El coche fue reparado por un mecánico.",
    "en": "The car was repaired by a mechanic."
  },
  {
    "es": "Vamos a tener una fiesta de cumpleaños para Sarah.",
    "en": "We are going to have a birthday party for Sarah."
  },
  {
    "es": "Si encontrara una cartera en la calle, la llevaría a la policía.",
    "en": "If I found a wallet in the street, I would take it to the police."
  },
  {
    "es": "Él ha estado trabajando en este proyecto durante dos semanas.",
    "en": "He has been working on this project for two weeks."
  },
  {
    "es": "Es importante comer alimentos saludables.",
    "en": "It's important to eat healthy food."
  },
  {
    "es": "Ella olvidó apagar las luces antes de salir.",
    "en": "She forgot to turn off the lights before she left."
  },
  {
    "es": "Ayer compré un par de zapatos nuevos.",
    "en": "I bought a new pair of shoes yesterday."
  },
  {
    "es": "¿Has estado alguna vez en un concierto?",
    "en": "Have you ever been to a concert?"
  },
  {
    "es": "Si estudias mucho, aprobarás el examen.",
    "en": "If you study hard, you will pass the exam."
  },
  {
    "es": "Él estaba cansado, así que se fue a la cama temprano.",
    "en": "He was tired, so he went to bed early."
  },
  {
    "es": "¿Te importa si abro la ventana?",
    "en": "Do you mind if I open the window?"
  },
  {
    "es": "No estoy de acuerdo contigo en ese punto.",
    "en": "I don't agree with you on that point."
  },
  {
    "es": "La película no fue tan buena como esperaba.",
    "en": "The movie wasn't as good as I expected."
  },
  {
    "es": "¿Qué tipo de música te gusta?",
    "en": "What kind of music do you like?"
  },
  {
    "es": "He perdido mi teléfono. No puedo encontrarlo en ninguna parte.",
    "en": "I've lost my phone. I can't find it anywhere."
  },
  {
    "es": "Si me sintiera mejor, saldría contigo.",
    "en": "If I felt better, I would go out with you."
  },
  {
    "es": "Ella tiene que llevar uniforme en su trabajo.",
    "en": "She has to wear a uniform at her job."
  },
  {
    "es": "¿Dónde naciste?",
    "en": "Where were you born?"
  },
  {
    "es": "He decidido empezar a hacer más ejercicio.",
    "en": "I have decided to start exercising more."
  },
  {
    "es": "No sabía que vendrías a la fiesta.",
    "en": "I didn't know you were coming to the party."
  },
  {
    "es": "Si nevara, podríamos construir un muñeco de nieve.",
    "en": "If it snowed, we could build a snowman."
  },
  {
    "es": "Me interesa la historia y el arte.",
    "en": "I'm interested in history and art."
  },
  {
    "es": "Cuando era más joven, no me gustaban las verduras.",
    "en": "When I was younger, I didn't use to like vegetables."
  },
  {
    "es": "Este ejercicio es más difícil que el anterior.",
    "en": "This exercise is more difficult than the last one."
  },
  {
    "es": "¿Podrías pasarme la sal, por favor?",
    "en": "Could you pass me the salt, please?"
  },
  {
    "es": "Están construyendo un nuevo centro comercial en el centro.",
    "en": "They are building a new shopping center downtown."
  },
  {
    "es": "No he hablado con él desde el lunes.",
    "en": "I haven't spoken to him since Monday."
  },
  {
    "es": "Si no lo sabes, deberías buscarlo en internet.",
    "en": "If you don't know, you should look it up online."
  },
  {
    "es": "Él se rompió la pierna mientras jugaba al fútbol.",
    "en": "He broke his leg while he was playing football."
  },
  {
    "es": "No hay suficiente comida para todos.",
    "en": "There isn't enough food for everyone."
  },
  {
    "es": "¿Vas a hacer algo especial este fin de semana?",
    "en": "Are you going to do anything special this weekend?"
  },
  {
    "es": "Si tuviera su número de teléfono, la llamaría.",
    "en": "If I had her phone number, I would call her."
  },
  {
    "es": "La ventana fue rota por los niños.",
    "en": "The window was broken by the children."
  },
  {
    "es": "Creo que deberías disculparte con ella.",
    "en": "I think you should apologize to her."
  },
  {
    "es": "Él acaba de volver de sus vacaciones.",
    "en": "He has just come back from his vacation."
  },
  {
    "es": "Necesito un descanso. He estado trabajando todo el día.",
    "en": "I need a break. I've been working all day."
  },
  {
    "es": "La ciudad es conocida por su hermosa arquitectura.",
    "en": "The city is known for its beautiful architecture."
  },
  {
    "es": "No comí nada en el desayuno esta mañana.",
    "en": "I didn't eat anything for breakfast this morning."
  },
  {
    "es": "Si el autobús no llega pronto, cogeremos un taxi.",
    "en": "If the bus doesn't arrive soon, we will take a taxi."
  },
  {
    "es": "Ella me preguntó si quería una taza de café.",
    "en": "She asked me if I wanted a cup of coffee."
  },
  {
    "es": "Me encantaría viajar por el mundo algún día.",
    "en": "I would love to travel the world one day."
  },
  {
    "es": "¿Has leído algún libro interesante últimamente?",
    "en": "Have you read any interesting books recently?"
  },
  {
    "es": "Si encuentras algún error, por favor, dímelo.",
    "en": "If you find any mistakes, please tell me."
  },
  {
    "es": "Cuando llegamos, la tienda ya estaba cerrada.",
    "en": "When we arrived, the shop was already closed."
  },
  {
    "es": "No debes fumar dentro del edificio.",
    "en": "You must not smoke inside the building."
  },
  {
    "es": "Él prometió ayudarme con la mudanza.",
    "en": "He promised to help me with the move."
  },
  {
    "es": "¿Con qué frecuencia vas al gimnasio?",
    "en": "How often do you go to the gym?"
  },
  {
    "es": "Me he olvidado completamente de su cumpleaños.",
    "en": "I have completely forgotten about his birthday."
  },
  {
    "es": "Si pudieras vivir en cualquier parte del mundo, ¿dónde vivirías?",
    "en": "If you could live anywhere in the world, where would you live?"
  },
  {
    "es": "Mi vuelo se retrasó por el mal tiempo.",
    "en": "My flight was delayed because of the bad weather."
  },
  {
    "es": "Ella es alérgica a los gatos.",
    "en": "She is allergic to cats."
  },
  {
    "es": "No he dormido bien últimamente.",
    "en": "I haven't been sleeping well lately."
  },
  {
    "es": "Si llueve, el partido será cancelado.",
    "en": "If it rains, the match will be cancelled."
  },
  {
    "es": "¿Podrías deletrear tu apellido para mí?",
    "en": "Could you spell your surname for me?"
  },
  {
    "es": "Me dijeron que esperara fuera.",
    "en": "I was told to wait outside."
  },
  {
    "es": "Él estaba decepcionado con los resultados.",
    "en": "He was disappointed with the results."
  },
  {
    "es": "Intenté llamarte, pero tu teléfono estaba apagado.",
    "en": "I tried to call you, but your phone was off."
  },
  {
    "es": "No es necesario que vengas si no quieres.",
    "en": "You don't have to come if you don't want to."
  },
  {
    "es": "¿Has probado alguna vez la comida tailandesa?",
    "en": "Have you ever tried Thai food?"
  },
  {
    "es": "Si hubiera sabido que estabas aquí, habría venido antes.",
    "en": "If I had known you were here, I would have come sooner."
  },
  {
    "es": "La habitación no se ha limpiado hoy.",
    "en": "The room hasn't been cleaned today."
  },
  {
    "es": "Me duele la cabeza. Creo que necesito una aspirina.",
    "en": "I have a headache. I think I need an aspirin."
  },
  {
    "es": "Él ha estado estudiando inglés desde que era un niño.",
    "en": "He has been studying English since he was a child."
  },
  {
    "es": "Si ganas la competición, ¿qué harás?",
    "en": "If you win the competition, what will you do?"
  },
  {
    "es": "No estoy seguro, pero creo que él es de Canadá.",
    "en": "I'm not sure, but I think he is from Canada."
  },
  {
    "es": "Evita comer demasiada comida basura.",
    "en": "You should avoid eating too much junk food."
  },
  {
    "es": "La última vez que lo vi, parecía feliz.",
    "en": "The last time I saw him, he seemed happy."
  },
  {
    "es": "Ella va a empezar un nuevo trabajo la semana que viene.",
    "en": "She is going to start a new job next week."
  },
  {
    "es": "Si no hiciera tanto frío, podríamos ir a nadar.",
    "en": "If it wasn't so cold, we could go swimming."
  },
  {
    "es": "Este problema es demasiado difícil para mí.",
    "en": "This problem is too difficult for me."
  },
  {
    "es": "¿Alguien ha encontrado mi paraguas?",
    "en": "Has anyone found my umbrella?"
  },
  {
    "es": "No me permitieron entrar sin una entrada.",
    "en": "I wasn't allowed to enter without a ticket."
  },
  {
    "es": "No te preocupes, me ocuparé de ello.",
    "en": "Don't worry, I will take care of it."
  },
  {
    "es": "¿A quién pertenece este abrigo?",
    "en": "Whose coat is this?"
  },
  {
    "es": "He estado en París dos veces.",
    "en": "I have been to Paris twice."
  },
  {
    "es": "Si vienes a la fiesta, por favor trae algo de beber.",
    "en": "If you come to the party, please bring something to drink."
  },
  {
    "es": "Él estaba tan absorto en su libro que no me oyó.",
    "en": "He was so absorbed in his book that he didn't hear me."
  },
  {
    "es": "Hay muy poca leche en la nevera.",
    "en": "There is very little milk in the fridge."
  },
  {
    "es": "Deberías ir al médico si te sientes enfermo.",
    "en": "You should go to the doctor if you feel sick."
  },
  {
    "es": "Terminemos este trabajo y luego podemos tomar un descanso.",
    "en": "Let's finish this work, and then we can take a break."
  },
  {
    "es": "El informe debe ser entregado mañana por la mañana.",
    "en": "The report must be handed in by tomorrow morning."
  },
  {
    "es": "Si hablara mejor inglés, solicitaría ese trabajo.",
    "en": "If I spoke better English, I would apply for that job."
  },
  {
    "es": "Él se negó a decirme lo que había pasado.",
    "en": "He refused to tell me what had happened."
  },
  {
    "es": "Hemos vivido en la misma casa durante casi diez años.",
    "en": "We have lived in the same house for almost ten years."
  },
  {
    "es": "Si el tiempo es bueno, jugaremos al tenis.",
    "en": "If the weather is good, we will play tennis."
  },
  {
    "es": "Estoy deseando que lleguen mis vacaciones.",
    "en": "I'm looking forward to my vacation."
  },
  {
    "es": "¿Podrías darme un consejo?",
    "en": "Could you give me some advice?"
  },
  {
    "es": "Ella sugirió ir a la playa.",
    "en": "She suggested going to the beach."
  },
  {
    "es": "Si yo fuera más alto, podría jugar al baloncesto.",
    "en": "If I were taller, I could play basketball."
  },
  {
    "es": "La música estaba demasiado alta, así que le pedí que la bajara.",
    "en": "The music was too loud, so I asked him to turn it down."
  },
  {
    "es": "Él no ha respondido a mi correo electrónico todavía.",
    "en": "He hasn't replied to my email yet."
  },
  {
    "es": "Me estaba preparando para salir cuando sonó el teléfono.",
    "en": "I was getting ready to go out when the phone rang."
  },
  {
    "es": "Si no sabes la palabra, búscala en el diccionario.",
    "en": "If you don't know the word, look it up in the dictionary."
  },
  {
    "es": "No te olvides de cerrar la puerta con llave cuando te vayas.",
    "en": "Don't forget to lock the door when you leave."
  },
  {
    "es": "¿Qué harás después de terminar la universidad?",
    "en": "What are you going to do after you finish university?"
  },
  {
    "es": "Él está acostumbrado a trabajar largas horas.",
    "en": "He is used to working long hours."
  },
  {
    "es": "Si perdiera mi trabajo, no sé qué haría.",
    "en": "If I lost my job, I don't know what I would do."
  },
  {
    "es": "Se cometieron muchos errores.",
    "en": "A lot of mistakes were made."
  },
  {
    "es": "Ella se disculpó por llegar tarde.",
    "en": "She apologized for being late."
  },
  {
    "es": "¿Has desayunado ya?",
    "en": "Have you had breakfast yet?"
  },
  {
    "es": "Si me das tu dirección, te enviaré una postal.",
    "en": "If you give me your address, I'll send you a postcard."
  },
  {
    "es": "La gente estaba esperando en fila para comprar entradas.",
    "en": "People were waiting in line to buy tickets."
  },
  {
    "es": "No he ido al cine en mucho tiempo.",
    "en": "I haven't been to the cinema for a long time."
  },
  {
    "es": "Él recomendó este restaurante.",
    "en": "He recommended this restaurant."
  },
  {
    "es": "¿Crees que deberíamos invitarlo?",
    "en": "Do you think we should invite him?"
  },
  {
    "es": "La reunión fue cancelada.",
    "en": "The meeting was cancelled."
  },
  {
    "es": "Si tuviera que elegir, preferiría el azul.",
    "en": "If I had to choose, I would prefer the blue one."
  },
  {
    "es": "No estaba prestando atención a lo que decía.",
    "en": "I wasn't paying attention to what he was saying."
  },
  {
    "es": "El clima ha sido muy extraño últimamente.",
    "en": "The weather has been very strange recently."
  },
  {
    "es": "Si viera un accidente, llamaría a una ambulancia.",
    "en": "If I saw an accident, I would call an ambulance."
  },
  {
    "es": "No puedo permitirme comprar un coche nuevo.",
    "en": "I can't afford to buy a new car."
  },
  {
    "es": "Ella decidió no aceptar el trabajo.",
    "en": "She decided not to accept the job."
  },
  {
    "es": "He estado esperando el autobús durante 20 minutos.",
    "en": "I have been waiting for the bus for 20 minutes."
  },
  {
    "es": "Si no nos vamos ahora, llegaremos tarde.",
    "en": "If we don't leave now, we will be late."
  },
  {
    "es": "Él estaba enfadado porque había perdido sus llaves.",
    "en": "He was angry because he had lost his keys."
  },
  {
    "es": "¿Cuánto tiempo llevas aprendiendo español?",
    "en": "How long have you been learning Spanish?"
  },
  {
    "es": "A pesar de que el examen fue difícil, creo que lo hice bien.",
    "en": "Although the exam was difficult, I think I did well."
  },
  {
    "es": "Si lo rompes, tendrás que comprar uno nuevo.",
    "en": "If you break it, you will have to buy a new one."
  },
  {
    "es": "¿Podrías hacerme un favor?",
    "en": "Could you do me a favor?"
  },
  {
    "es": "Nunca he volado en helicóptero.",
    "en": "I have never flown in a helicopter."
  },
  {
    "es": "Si me lo hubieras pedido, te habría ayudado.",
    "en": "If you had asked me, I would have helped you."
  },
  {
    "es": "Esta sopa sabe deliciosa.",
    "en": "This soup tastes delicious."
  },
  {
    "es": "La información me fue dada por el recepcionista.",
    "en": "The information was given to me by the receptionist."
  },
  {
    "es": "Él ha estado buscando trabajo desde que se graduó.",
    "en": "He has been looking for a job since he graduated."
  },
  {
    "es": "Si te apetece, podemos ver una película esta noche.",
    "en": "If you feel like it, we can watch a movie tonight."
  },
  {
    "es": "Me temo que he cometido un error.",
    "en": "I'm afraid I've made a mistake."
  },
  {
    "es": "A ella no le gusta que le digan qué hacer.",
    "en": "She doesn't like being told what to do."
  },
  {
    "es": "Si te encuentras con Mark, dile que llamé.",
    "en": "If you see Mark, tell him I called."
  },
  {
    "es": "Anoche no dormí mucho.",
    "en": "I didn't get much sleep last night."
  },
  {
    "es": "¿Qué estabas haciendo a las 8 PM de ayer?",
    "en": "What were you doing at 8 PM yesterday?"
  },
  {
    "es": "Él está interesado en comprar un coche nuevo.",
    "en": "He's interested in buying a new car."
  },
  {
    "es": "Si yo fuera rico, donaría dinero a la caridad.",
    "en": "If I were rich, I would donate money to charity."
  },
  {
    "es": "Acuérdate de regar las plantas.",
    "en": "Remember to water the plants."
  },
  {
    "es": "Nunca había visto una puesta de sol tan hermosa.",
    "en": "I had never seen such a beautiful sunset."
  },
  {
    "es": "Si no dejas de hacer ruido, me enfadaré.",
    "en": "If you don't stop making that noise, I will get angry."
  },
  {
    "es": "¿Te gustaría algo de beber?",
    "en": "Would you like something to drink?"
  },
  {
    "es": "Todos los vuelos fueron cancelados debido a la niebla.",
    "en": "All flights were cancelled because of the fog."
  },
  {
    "es": "No he tenido tiempo de leer el periódico hoy.",
    "en": "I haven't had time to read the newspaper today."
  },
  {
    "es": "Él me aconsejó que no comprara ese coche.",
    "en": "He advised me not to buy that car."
  },
  {
    "es": "Si pasas por el supermercado, ¿puedes comprar pan?",
    "en": "If you pass the supermarket, can you get some bread?"
  },
  {
    "es": "Estaba tan cansado que me quedé dormido en el sofá.",
    "en": "I was so tired that I fell asleep on the sofa."
  },
  {
    "es": "Ella ha trabajado como enfermera durante más de 20 años.",
    "en": "She has worked as a nurse for over 20 years."
  },
  {
    "es": "Si él entrenara más, sería un mejor jugador.",
    "en": "If he trained more, he would be a better player."
  },
  {
    "es": "El paquete fue entregado esta mañana.",
    "en": "The package was delivered this morning."
  },
  {
    "es": "Deberíamos irnos pronto para evitar el tráfico.",
    "en": "We should leave early to avoid the traffic."
  },
  {
    "es": "¿Qué tipo de trabajo esperas encontrar?",
    "en": "What kind of job are you hoping to find?"
  },
  {
    "es": "Si no me lo recuerdas, lo olvidaré.",
    "en": "If you don't remind me, I will forget."
  },
  {
    "es": "No puedo encontrar mis gafas en ninguna parte.",
    "en": "I can't find my glasses anywhere."
  },
  {
    "es": "El me preguntó dónde vivía.",
    "en": "He asked me where I lived."
  },
  {
    "es": "Apenas habíamos empezado a comer cuando llegaron.",
    "en": "We had just started eating when they arrived."
  },
  {
    "es": "Si me invitan, iré a la boda.",
    "en": "If they invite me, I will go to the wedding."
  },
  {
    "es": "Me duele el estómago. Creo que comí demasiado.",
    "en": "My stomach hurts. I think I ate too much."
  },
  {
    "es": "Él estaba decepcionado por no haber conseguido el trabajo.",
    "en": "He was disappointed that he didn't get the job."
  },
  {
    "es": "Si pudieras tener un superpoder, ¿cuál sería?",
    "en": "If you could have a superpower, what would it be?"
  },
  {
    "es": "Ella ha decidido mudarse a otra ciudad.",
    "en": "She has decided to move to another city."
  },
  {
    "es": "Las llaves fueron dejadas sobre la mesa.",
    "en": "The keys were left on the table."
  },
  {
    "es": "Me he estado sintiendo un poco estresado últimamente.",
    "en": "I've been feeling a bit stressed recently."
  },
  {
    "es": "Si el teléfono suena, ¿puedes contestarlo?",
    "en": "If the phone rings, can you answer it?"
  },
  {
    "es": "No sabía la respuesta, así que adiviné.",
    "en": "I didn't know the answer, so I guessed."
  },
  {
    "es": "¿Te gustaría acompañarnos?",
    "en": "Would you care to join us?"
  },
  {
    "es": "¿Has visitado alguna vez la galería de arte?",
    "en": "Have you ever visited the art gallery?"
  },
  {
    "es": "Si tuviera un barco, navegaría alrededor del mundo.",
    "en": "If I owned a boat, I would sail around the world."
  },
  {
    "es": "Él me advirtió que no llegara tarde.",
    "en": "He warned me not to be late."
  },
  {
    "es": "El suelo estaba mojado porque acababa de llover.",
    "en": "The ground was wet because it had just rained."
  },
  {
    "es": "No se permite hacer fotos aquí.",
    "en": "Taking photos is not allowed here."
  },
  {
    "es": "Si no te gusta, no tienes que comerlo.",
    "en": "If you don't like it, you don't have to eat it."
  },
  {
    "es": "¿Qué harías si vieras a un famoso?",
    "en": "What would you do if you saw a famous person?"
  },
  {
    "es": "He estado intentando solucionar este problema toda la mañana.",
    "en": "I have been trying to solve this problem all morning."
  },
  {
    "es": "Ella estaba contenta con su regalo.",
    "en": "She was pleased with her present."
  },
  {
    "es": "Necesito concentrarme en mi trabajo ahora.",
    "en": "I need to concentrate on my work now."
  },
  {
    "es": "Si no está demasiado lejos, podemos ir andando.",
    "en": "If it's not too far, we can walk."
  },
  {
    "es": "La reunión se pospuso hasta la semana que viene.",
    "en": "The meeting was postponed until next week."
  },
  {
    "es": "Nunca he montado a caballo.",
    "en": "I have never ridden a horse."
  },
  {
    "es": "¿Cuál es la ciudad más grande que has visitado?",
    "en": "What's the biggest city you have visited?"
  },
  {
    "es": "Si él llamara, dile que no estoy en casa.",
    "en": "If he calls, tell him I'm not at home."
  },
  {
    "es": "A él no le gusta esperar.",
    "en": "He doesn't enjoy waiting."
  },
  {
    "es": "¿Cuándo empezaste a aprender a tocar el piano?",
    "en": "When did you start learning to play the piano?"
  },
  {
    "es": "Si tuviera más confianza, hablaría en público.",
    "en": "If I were more confident, I would speak in public."
  },
  {
    "es": "Me olvidé de traer mi paraguas, y ahora está lloviendo.",
    "en": "I forgot to bring my umbrella, and now it's raining."
  },
  {
    "es": "A ella se le ofreció un trabajo en Nueva York.",
    "en": "She was offered a job in New York."
  },
  {
    "es": "He estado leyendo este libro durante una semana.",
    "en": "I've been reading this book for a week."
  },
  {
    "es": "Si haces la cena, yo lavaré los platos.",
    "en": "If you make dinner, I will wash the dishes."
  },
  {
    "es": "Él estaba orgulloso de su hija por ganar la carrera.",
    "en": "He was proud of his daughter for winning the race."
  },
  {
    "es": "No tengo ni idea de cómo usar este software.",
    "en": "I have no idea how to use this software."
  },
  {
    "es": "¿Has estado esperando mucho tiempo?",
    "en": "Have you been waiting long?"
  },
  {
    "es": "Si necesitara ayuda, te lo pediría.",
    "en": "If I needed help, I would ask you."
  },
  {
    "es": "La bicicleta fue robada del garaje.",
    "en": "The bicycle was stolen from the garage."
  },
  {
    "es": "No esperaba verte aquí.",
    "en": "I didn't expect to see you here."
  },
  {
    "es": "Si él no viene pronto, nos iremos sin él.",
    "en": "If he doesn't come soon, we'll leave without him."
  },
  {
    "es": "Él está acostumbrado al clima frío.",
    "en": "He is used to the cold weather."
  },
  {
    "es": "Me gustaría hacer una reserva para dos personas.",
    "en": "I would like to make a reservation for two people."
  },
  {
    "es": "¿Ha llegado ya el correo?",
    "en": "Has the mail arrived yet?"
  },
  {
    "es": "Si viviera cerca del mar, iría a la playa todos los días.",
    "en": "If I lived near the sea, I would go to the beach every day."
  },
  {
    "es": "No puedes entrar a menos que tengas una invitación.",
    "en": "You can't come in unless you have an invitation."
  },
  {
    "es": "Mientras limpiaba la habitación, encontré mis pendientes perdidos.",
    "en": "While I was cleaning the room, I found my lost earrings."
  },
  {
    "es": "Este es el mejor café que he probado.",
    "en": "This is the best coffee I have ever tasted."
  },
  {
    "es": "Si te sientes cansado, deberías tomar una siesta.",
    "en": "If you feel tired, you should take a nap."
  },
  {
    "es": "Las instrucciones eran difíciles de entender.",
    "en": "The instructions were difficult to understand."
  },
  {
    "es": "Él ha estado pintando su casa toda la semana.",
    "en": "He has been painting his house all week."
  },
  {
    "es": "Si tengo algún problema, te llamaré.",
    "en": "If I have any problems, I will call you."
  },
  {
    "es": "Se dice que esta casa está encantada.",
    "en": "This house is said to be haunted."
  },
  {
    "es": "No me gusta que me mientan.",
    "en": "I don't like being lied to."
  },
  {
    "es": "Si no fuera tan caro, lo compraría.",
    "en": "If it wasn't so expensive, I would buy it."
  },
  {
    "es": "Él ha estado ahorrando dinero para comprar un coche.",
    "en": "He has been saving money to buy a car."
  },
  {
    "es": "Mi hermana es muy buena cocinando.",
    "en": "My sister is very good at cooking."
  },
  {
    "es": "¿Alguna vez has perdido tu pasaporte?",
    "en": "Have you ever lost your passport?"
  },
  {
    "es": "Si el examen es fácil, lo haré bien.",
    "en": "If the exam is easy, I will do well."
  },
  {
    "es": "Se me olvidó por completo nuestra cita.",
    "en": "I completely forgot about our appointment."
  },
  {
    "es": "Se debe seguir las reglas.",
    "en": "The rules must be followed."
  },
  {
    "es": "Si no estuviera trabajando ahora, estaría de vacaciones.",
    "en": "If I wasn't working now, I would be on holiday."
  },
  {
    "es": "Él ha estado jugando al fútbol desde que tenía cinco años.",
    "en": "He has been playing football since he was five."
  },
  {
    "es": "No he terminado de leer el libro que me prestaste.",
    "en": "I haven't finished reading the book you lent me."
  },
  {
    "es": "Si quieres tener éxito, tienes que trabajar duro.",
    "en": "If you want to succeed, you have to work hard."
  },
  {
    "es": "Él estaba muy emocionado por el viaje.",
    "en": "He was very excited about the trip."
  },
  {
    "es": "El puente fue dañado por la tormenta.",
    "en": "The bridge was damaged by the storm."
  },
  {
    "es": "Si no te importa, me gustaría irme ahora.",
    "en": "If you don't mind, I'd like to leave now."
  },
  {
    "es": "¿Has decidido ya dónde ir de vacaciones?",
    "en": "Have you decided where to go on vacation yet?"
  },
  {
    "es": "Él prometió que no lo volvería a hacer.",
    "en": "He promised that he wouldn't do it again."
  },
  {
    "es": "Cuando yo era niño, vivíamos en una casa pequeña.",
    "en": "When I was a child, we used to live in a small house."
  },
  {
    "es": "Si me encuentro con ella, le daré tu mensaje.",
    "en": "If I run into her, I will give her your message."
  },
  {
    "es": "La habitación estaba llena de gente.",
    "en": "The room was crowded with people."
  },
  {
    "es": "Todavía no he recibido una respuesta.",
    "en": "I haven't received a reply yet."
  },
  {
    "es": "Si él estudiara más, sus notas mejorarían.",
    "en": "If he studied more, his grades would improve."
  },
  {
    "es": "Ella se negó a responder mis preguntas.",
    "en": "She refused to answer my questions."
  },
  {
    "es": "Este problema necesita ser resuelto inmediatamente.",
    "en": "This problem needs to be solved immediately."
  },
  {
    "es": "¿Has pensado en cambiar de trabajo?",
    "en": "Have you thought about changing your job?"
  },
  {
    "es": "Si el museo está abierto, podemos entrar.",
    "en": "If the museum is open, we can go inside."
  },
  {
    "es": "Cuando llegué a la estación, el tren ya se había ido.",
    "en": "When I got to the station, the train had already left."
  },
  {
    "es": "A él le interesa la política.",
    "en": "He is interested in politics."
  },
  {
    "es": "Si fuera un animal, sería un pájaro.",
    "en": "If I were an animal, I would be a bird."
  },
  {
    "es": "No he estado en contacto con él durante años.",
    "en": "I haven't been in touch with him for years."
  },
  {
    "es": "La carta fue enviada la semana pasada.",
    "en": "The letter was sent last week."
  },
  {
    "es": "Ella estaba contenta de que la hubieran invitado.",
    "en": "She was happy to be invited."
  },
  {
    "es": "Si el tiempo no mejora, tendremos que cancelar el picnic.",
    "en": "If the weather doesn't improve, we will have to cancel the picnic."
  },
  {
    "es": "¿Te estás divirtiendo?",
    "en": "Are you having a good time?"
  },
  {
    "es": "Me temo que he olvidado tu nombre.",
    "en": "I'm afraid I've forgotten your name."
  },
  {
    "es": "Si ganara algo de dinero extra, lo ahorraría.",
    "en": "If I earned some extra money, I would save it."
  },
  {
    "es": "El ladrón fue arrestado por la policía.",
    "en": "The thief was arrested by the police."
  },
  {
    "es": "Él estaba acostumbrado a vivir solo.",
    "en": "He was used to living alone."
  },
  {
    "es": "¿Has empacado ya tu maleta?",
    "en": "Have you packed your suitcase yet?"
  },
  {
    "es": "Si me ayudas, terminaremos más rápido.",
    "en": "If you help me, we will finish faster."
  },
  {
    "es": "Él estaba sorprendido por lo que vio.",
    "en": "He was surprised by what he saw."
  },
  {
    "es": "No me gusta conducir con mucho tráfico.",
    "en": "I don't like driving in heavy traffic."
  },
  {
    "es": "¿Qué tipo de películas sueles ver?",
    "en": "What kind of movies do you usually watch?"
  },
  {
    "es": "Si tuviera unas vacaciones, iría a la playa.",
    "en": "If I had a holiday, I would go to the beach."
  },
  {
    "es": "Mi ordenador no funciona. Creo que está roto.",
    "en": "My computer isn't working. I think it's broken."
  },
  {
    "es": "La decisión será tomada mañana.",
    "en": "The decision will be made tomorrow."
  },
  {
    "es": "No he visto a María desde su fiesta de cumpleaños.",
    "en": "I haven't seen Maria since her birthday party."
  },
  {
    "es": "Si te apetece un café, hay una cafetería cerca.",
    "en": "If you feel like a coffee, there's a café nearby."
  },
  {
    "es": "¿Cómo te fue en el examen?",
    "en": "How did you do on the exam?"
  },
  {
    "es": "A él no le va bien en los exámenes.",
    "en": "He isn't good at taking exams."
  },
  {
    "es": "Si el hotel es bonito, nos quedaremos una noche más.",
    "en": "If the hotel is nice, we will stay for another night."
  },
  {
    "es": "Esta es la primera vez que viajo en avión.",
    "en": "This is the first time I have travelled by plane."
  },
  {
    "es": "La tarea debe completarse para el viernes.",
    "en": "The homework must be completed by Friday."
  },
  {
    "es": "Si tuviera un millón de dólares, dejaría mi trabajo.",
    "en": "If I had a million dollars, I would quit my job."
  },
  {
    "es": "Él ha estado viajando por Asia durante seis meses.",
    "en": "He has been travelling around Asia for six months."
  },
  {
    "es": "Deja de hacer tanto ruido. Estoy intentando trabajar.",
    "en": "Stop making so much noise. I'm trying to work."
  },
  {
    "es": "¿Te has acordado de comprar pan?",
    "en": "Did you remember to buy bread?"
  },
  {
    "es": "Si me siento mejor mañana, iré a trabajar.",
    "en": "If I feel better tomorrow, I will go to work."
  },
  {
    "es": "Él estaba muy cansado después del largo viaje.",
    "en": "He was very tired after the long journey."
  },
  {
    "es": "El coche está siendo lavado.",
    "en": "The car is being washed."
  },
  {
    "es": "Si no estuviera lloviendo, daríamos un paseo.",
    "en": "If it wasn't raining, we would go for a walk."
  },
  {
    "es": "He estado aprendiendo a programar.",
    "en": "I have been learning how to code."
  },
  {
    "es": "Ella quiere evitar hablar con él.",
    "en": "She wants to avoid talking to him."
  },
  {
    "es": "¿Cuántas veces has estado en Londres?",
    "en": "How many times have you been to London?"
  },
  {
    "es": "Si el tráfico no es malo, llegaremos en 20 minutos.",
    "en": "If the traffic isn't bad, we'll arrive in 20 minutes."
  },
  {
    "es": "El libro que estoy leyendo es muy interesante.",
    "en": "The book I'm reading is very interesting."
  },
  {
    "es": "Se te pedirá que muestres tu pasaporte.",
    "en": "You will be asked to show your passport."
  },
  {
    "es": "Si yo fuera tú, no me preocuparía por eso.",
    "en": "If I were you, I wouldn't worry about it."
  },
  {
    "es": "Él se ha estado quejando del dolor de espalda.",
    "en": "He has been complaining about his back pain."
  },
  {
    "es": "No he hecho planes para el fin de semana todavía.",
    "en": "I haven't made any plans for the weekend yet."
  },
  {
    "es": "Si te gusta la comida picante, deberías probar este plato.",
    "en": "If you like spicy food, you should try this dish."
  },
  {
    "es": "Él estaba hablando por teléfono cuando yo entré.",
    "en": "He was talking on the phone when I walked in."
  },
  {
    "es": "La puerta estaba cerrada, así que no pude entrar.",
    "en": "The door was locked, so I couldn't get in."
  },
  {
    "es": "Si tuviera que adivinar, diría que tiene unos 30 años.",
    "en": "If I had to guess, I'd say he's about 30."
  },
  {
    "es": "Se está planeando un nuevo festival de música para el verano.",
    "en": "A new music festival is being planned for the summer."
  },
  {
    "es": "Ella ha estado esperando una respuesta durante días.",
    "en": "She has been waiting for a reply for days."
  },
  {
    "es": "No he ido a nadar en años.",
    "en": "I haven't gone swimming in years."
  },
  {
    "es": "Si pierdo el último tren, tendré que coger un taxi.",
    "en": "If I miss the last train, I will have to take a taxi."
  },
  {
    "es": "Me recomendaron que probara la especialidad local.",
    "en": "I was recommended to try the local specialty."
  },
  {
    "es": "Si no estudiara tanto, no tendría tan buenas notas.",
    "en": "If I didn't study so hard, I wouldn't have such good grades."
  },
  {
    "es": "Él siempre se olvida de dónde pone las cosas.",
    "en": "He always forgets where he puts things."
  },
  {
    "es": "Se están ofreciendo descuentos a los estudiantes.",
    "en": "Discounts are being offered to students."
  },
  {
    "es": "¿Has oído hablar de ese nuevo restaurante?",
    "en": "Have you heard about that new restaurant?"
  },
  {
    "es": "Si pudiera cambiar algo de mi vida, sería mi trabajo.",
    "en": "If I could change one thing about my life, it would be my job."
  },
  {
    "es": "A él no se le da bien recordar nombres.",
    "en": "He isn't good at remembering names."
  },
  {
    "es": "Si vas a la tienda, ¿me puedes comprar leche?",
    "en": "If you are going to the store, can you get me some milk?"
  },
  {
    "es": "Se ha hecho mucho progreso.",
    "en": "A lot of progress has been made."
  },
  {
    "es": "Cuando llegué, ellos ya se habían ido.",
    "en": "By the time I arrived, they had already left."
  },
  {
    "es": "Si él se disculpara, yo lo perdonaría.",
    "en": "If he apologized, I would forgive him."
  },
  {
    "es": "Ella se está preparando para su entrevista de trabajo.",
    "en": "She is preparing for her job interview."
  },
  {
    "es": "Se espera que el tiempo mejore más tarde.",
    "en": "The weather is expected to improve later."
  },
  {
    "es": "¿Has terminado con ese libro ya?",
    "en": "Are you finished with that book yet?"
  },
  {
    "es": "Si no estuviera tan oscuro, podría ver mejor.",
    "en": "If it wasn't so dark, I could see better."
  },
  {
    "es": "Él decidió continuar sus estudios en el extranjero.",
    "en": "He decided to continue his studies abroad."
  },
  {
    "es": "Si la tienda está cerrada, iremos mañana.",
    "en": "If the store is closed, we will go tomorrow."
  },
  {
    "es": "Mi teléfono ha sido robado.",
    "en": "My phone has been stolen."
  },
  {
    "es": "Él estaba confundido por las direcciones.",
    "en": "He was confused by the directions."
  },
  {
    "es": "Si supiera la verdad, te la diría.",
    "en": "If I knew the truth, I would tell you."
  },
  {
    "es": "He estado pensando en lo que dijiste.",
    "en": "I've been thinking about what you said."
  },
  {
    "es": "No te preocupes, el problema será resuelto.",
    "en": "Don't worry, the problem will be solved."
  },
  {
    "es": "¿Desde cuándo conoces a John?",
    "en": "How long have you known John?"
  },
  {
    "es": "Si no tuviéramos que trabajar, podríamos viajar más.",
    "en": "If we didn't have to work, we could travel more."
  },
  {
    "es": "Él evitó mirarme.",
    "en": "He avoided looking at me."
  },
  {
    "es": "Si necesitas algo, solo pídelo.",
    "en": "If you need anything, just ask."
  },
  {
    "es": "La casa fue construida en 1980.",
    "en": "The house was built in 1980."
  },
  {
    "es": "Estoy intentando comer de forma más saludable estos días.",
    "en": "I'm trying to eat more healthily these days."
  },
  {
    "es": "Si fuera tú, no compraría ese coche.",
    "en": "If I were you, I wouldn't buy that car."
  },
  {
    "es": "Ella ha estado muy ocupada con su nuevo proyecto.",
    "en": "She has been very busy with her new project."
  },
  {
    "es": "Esta canción me fue presentada por un amigo.",
    "en": "I was introduced to this song by a friend."
  },
  {
    "es": "Si él no llama esta noche, lo llamaré mañana.",
    "en": "If he doesn't call tonight, I will call him tomorrow."
  },
  {
    "es": "¿Alguna vez te has perdido en una ciudad extranjera?",
    "en": "Have you ever gotten lost in a foreign city?"
  },
  {
    "es": "Él estaba decepcionado de que la fiesta fuera cancelada.",
    "en": "He was disappointed that the party was cancelled."
  },
  {
    "es": "Si pudiéramos permitirnoslo, compraríamos una casa más grande.",
    "en": "If we could afford it, we would buy a bigger house."
  },
  {
    "es": "El informe fue escrito por un equipo de expertos.",
    "en": "The report was written by a team of experts."
  },
  {
    "es": "He estado ahorrando para unas largas vacaciones.",
    "en": "I have been saving up for a long holiday."
  },
  {
    "es": "Ella se negó a participar en la competición.",
    "en": "She refused to take part in the competition."
  },
  {
    "es": "Si la reunión termina pronto, podemos ir a tomar algo.",
    "en": "If the meeting finishes early, we can go for a drink."
  },
  {
    "es": "Me preguntaba si podrías ayudarme.",
    "en": "I was wondering if you could help me."
  },
  {
    "es": "Si tuviera su correo electrónico, le escribiría.",
    "en": "If I had his email, I would write to him."
  },
  {
    "es": "Las reglas del juego me fueron explicadas.",
    "en": "The rules of the game were explained to me."
  },
  {
    "es": "No he decidido qué ponerme para la fiesta.",
    "en": "I haven't decided what to wear to the party."
  },
  {
    "es": "Él estaba viendo una película cuando se fue la luz.",
    "en": "He was watching a movie when the power went out."
  },
  {
    "es": "Si encuentro tus gafas, te lo haré saber.",
    "en": "If I find your glasses, I will let you know."
  },
  {
    "es": "El castillo es visitado por miles de turistas cada año.",
    "en": "The castle is visited by thousands of tourists every year."
  },
  {
    "es": "Si no estuviera tan lejos, iría más a menudo.",
    "en": "If it weren't so far away, I would go more often."
  },
  {
    "es": "He estado limpiando la casa toda la tarde.",
    "en": "I've been cleaning the house all afternoon."
  }
]
}  
