[
  {
    "es": "Si tuviera más dinero, viajaría por el mundo.",
    "en": "If I had more money, I would travel the world."
  },
  {
    "es": "Llevo esperando aquí más de una hora.",
    "en": "I've been waiting here for over an hour."
  },
  {
    "es": "No deberías haberle dicho nuestro secreto.",
    "en": "You shouldn't have told him our secret."
  },
  {
    "es": "A pesar del mal tiempo, decidimos salir.",
    "en": "Despite the bad weather, we decided to go out."
  },
  {
    "es": "Este informe debe ser terminado para el viernes.",
    "en": "This report must be finished by Friday."
  },
  {
    "es": "Cuando llegué, la película ya había empezado.",
    "en": "When I arrived, the movie had already started."
  },
  {
    "es": "Estoy deseando que lleguen las vacaciones.",
    "en": "I'm looking forward to the holidays."
  },
  {
    "es": "Le resultó difícil acostumbrarse al nuevo horario.",
    "en": "He found it difficult to get used to the new schedule."
  },
  {
    "es": "Si hubieras estudiado más, habrías aprobado.",
    "en": "If you had studied harder, you would have passed."
  },
  {
    "es": "Se cree que la nueva ley ayudará a la economía.",
    "en": "It is believed that the new law will help the economy."
  },
  {
    "es": "No soporto a la gente que habla en el cine.",
    "en": "I can't put up with people who talk in the cinema."
  },
  {
    "es": "¿Te importaría echarle un vistazo a mi ensayo?",
    "en": "Would you mind taking a look at my essay?"
  },
  {
    "es": "A menos que te des prisa, perderemos el tren.",
    "en": "Unless you hurry up, we will miss the train."
  },
  {
    "es": "Me he quedado sin leche, necesito comprar más.",
    "en": "I've run out of milk, I need to buy some more."
  },
  {
    "es": "Él solía jugar al fútbol cuando era más joven.",
    "en": "He used to play football when he was younger."
  },
  {
    "es": "Vale la pena visitar esa ciudad por su arquitectura.",
    "en": "That city is worth visiting for its architecture."
  },
  {
    "es": "Tardé un rato en darme cuenta de mi error.",
    "en": "It took me a while to realize my mistake."
  },
  {
    "es": "Deben de haber salido; no hay luces encendidas.",
    "en": "They must have gone out; there are no lights on."
  },
  {
    "es": "Cuanto más lo pienso, menos me gusta la idea.",
    "en": "The more I think about it, the less I like the idea."
  },
  {
    "es": "Se arrepiente de no haber aceptado esa oferta de trabajo.",
    "en": "He regrets not accepting that job offer."
  },
  {
    "es": "Por un lado me gusta, pero por otro, es demasiado caro.",
    "en": "On the one hand I like it, but on the other hand, it's too expensive."
  },
  {
    "es": "El evento fue cancelado debido a circunstancias imprevistas.",
    "en": "The event was called off due to unforeseen circumstances."
  },
  {
    "es": "Apenas había salido de casa cuando empezó a llover.",
    "en": "I had hardly left home when it started to rain."
  },
  {
    "es": "Ella es la persona cuyo hermano ganó la lotería.",
    "en": "She is the person whose brother won the lottery."
  },
  {
    "es": "Estoy harto de oír las mismas excusas una y otra vez.",
    "en": "I'm fed up with hearing the same excuses over and over again."
  },
  {
    "es": "Te sugiero que reserves los billetes con antelación.",
    "en": "I suggest that you book the tickets in advance."
  },
  {
    "es": "No tiene sentido discutir sobre algo tan trivial.",
    "en": "There's no point in arguing about something so trivial."
  },
  {
    "es": "Si yo fuera tú, me lo pensaría dos veces.",
    "en": "If I were you, I would think twice."
  },
  {
    "es": "El coche está siendo reparado en este momento.",
    "en": "The car is being repaired at the moment."
  },
  {
    "es": "Logró aprobar el examen a pesar de no estudiar mucho.",
    "en": "He managed to pass the exam despite not studying much."
  },
  {
    "es": "Ella me acusó de haber roto el jarrón.",
    "en": "She accused me of having broken the vase."
  },
  {
    "es": "Es probable que el paquete llegue mañana.",
    "en": "The package is likely to arrive tomorrow."
  },
  {
    "es": "Tuvieron que posponer la reunión hasta la semana que viene.",
    "en": "They had to postpone the meeting until next week."
  },
  {
    "es": "Nunca había visto una puesta de sol tan bonita.",
    "en": "I had never seen such a beautiful sunset."
  },
  {
    "es": "Él rechazó la oferta porque el sueldo era demasiado bajo.",
    "en": "He turned down the offer because the salary was too low."
  },
  {
    "es": "Para cuando termines, ya nos habremos ido.",
    "en": "By the time you finish, we will have already left."
  },
  {
    "es": "Me cuesta levantarme temprano en invierno.",
    "en": "I find it hard to get up early in the winter."
  },
  {
    "es": "Ella insistió en pagar la cuenta por todos.",
    "en": "She insisted on paying the bill for everyone."
  },
  {
    "es": "Se espera que el CEO anuncie su dimisión.",
    "en": "The CEO is expected to announce his resignation."
  },
  {
    "es": "No veo la hora de empezar mi nuevo trabajo.",
    "en": "I can't wait to start my new job."
  },
  {
    "es": "A menudo damos por sentada nuestra salud.",
    "en": "We often take our health for granted."
  },
  {
    "es": "No me extraña que estés cansado, has trabajado mucho.",
    "en": "No wonder you're tired, you've been working a lot."
  },
  {
    "es": "Podrías haberte hecho daño, ten más cuidado.",
    "en": "You could have hurt yourself, be more careful."
  },
  {
    "es": "Aunque es difícil, sigo intentándolo.",
    "en": "Although it's difficult, I keep on trying."
  },
  {
    "es": "Le aconsejé que no invirtiera todo su dinero.",
    "en": "I advised him not to invest all his money."
  },
  {
    "es": "La empresa se vio obligada a despedir a algunos empleados.",
    "en": "The company was forced to lay off some employees."
  },
  {
    "es": "¿Has considerado mudarte a otra ciudad?",
    "en": "Have you considered moving to another city?"
  },
  {
    "es": "Este problema es más complicado de lo que parece.",
    "en": "This problem is more complicated than it seems."
  },
  {
    "es": "No pudo venir a la fiesta por motivos personales.",
    "en": "He couldn't come to the party for personal reasons."
  },
  {
    "es": "Me enteré de la noticia por un amigo en común.",
    "en": "I found out about the news from a mutual friend."
  },
  {
    "es": "Las entradas se agotaron en cuestión de minutos.",
    "en": "The tickets sold out in a matter of minutes."
  },
  {
    "es": "Tengo la intención de aprender un nuevo idioma este año.",
    "en": "I intend to learn a new language this year."
  },
  {
    "es": "Si el tiempo lo permite, haremos una barbacoa.",
    "en": "If the weather permits, we'll have a barbecue."
  },
  {
    "es": "Prefiero el té al café por la mañana.",
    "en": "I prefer tea to coffee in the morning."
  },
  {
    "es": "No me apetece salir esta noche, estoy agotado.",
    "en": "I don't feel like going out tonight, I'm exhausted."
  },
  {
    "es": "Parece que va a llover, ¿no crees?",
    "en": "It looks like it's going to rain, don't you think?"
  },
  {
    "es": "Le llevó mucho tiempo recuperarse de la enfermedad.",
    "en": "It took him a long time to recover from the illness."
  },
  {
    "es": "A pesar de ser hermanos, son completamente diferentes.",
    "en": "In spite of being brothers, they are completely different."
  },
  {
    "es": "Me pregunto qué estará haciendo ahora mismo.",
    "en": "I wonder what he is doing right now."
  },
  {
    "es": "Las llaves no pueden haberse perdido solas.",
    "en": "The keys can't have gotten lost on their own."
  },
  {
    "es": "Necesito que me recojas en el aeropuerto.",
    "en": "I need you to pick me up at the airport."
  },
  {
    "es": "Siempre que voy a esa tienda, acabo comprando algo.",
    "en": "Whenever I go to that store, I end up buying something."
  },
  {
    "es": "Se rumorea que la compañía se va a fusionar con su rival.",
    "en": "The company is rumored to be merging with its rival."
  },
  {
    "es": "Me temo que no estoy de acuerdo con tu opinión.",
    "en": "I'm afraid I don't agree with your opinion."
  },
  {
    "es": "Él tiende a exagerar cuando cuenta historias.",
    "en": "He tends to exaggerate when he tells stories."
  },
  {
    "es": "Me aseguraré de que todo esté listo para tu llegada.",
    "en": "I'll make sure everything is ready for your arrival."
  },
  {
    "es": "Evita cometer los mismos errores que yo cometí.",
    "en": "Avoid making the same mistakes I made."
  },
  {
    "es": "Desde mi punto de vista, la decisión fue la correcta.",
    "en": "From my point of view, the decision was the right one."
  },
  {
    "es": "Deberíamos aprovechar esta oportunidad.",
    "en": "We should take advantage of this opportunity."
  },
  {
    "es": "Me decepcionó que no vinieras a mi cumpleaños.",
    "en": "I was disappointed that you didn't come to my birthday."
  },
  {
    "es": "Dudo que él pueda terminar el proyecto a tiempo.",
    "en": "I doubt that he can finish the project on time."
  },
  {
    "es": "Siempre puedes contar conmigo si necesitas ayuda.",
    "en": "You can always count on me if you need help."
  },
  {
    "es": "El edificio fue evacuado debido a una amenaza de bomba.",
    "en": "The building was evacuated due to a bomb threat."
  },
  {
    "es": "Apenas puedo oírte, ¿puedes hablar más alto?",
    "en": "I can barely hear you, could you speak up?"
  },
  {
    "es": "No he sabido nada de él desde que se mudó.",
    "en": "I haven't heard from him since he moved away."
  },
  {
    "es": "Es una pena que te tengas que ir tan pronto.",
    "en": "It's a shame that you have to leave so soon."
  },
  {
    "es": "El objetivo principal es aumentar las ventas un 20%.",
    "en": "The main goal is to increase sales by 20%."
  },
  {
    "es": "Supongo que tendremos que cancelar nuestros planes.",
    "en": "I suppose we'll have to cancel our plans."
  },
  {
    "es": "Al final, todo salió bien.",
    "en": "In the end, everything turned out fine."
  },
  {
    "es": "Ella es conocida por su generosidad y amabilidad.",
    "en": "She is known for her generosity and kindness."
  },
  {
    "es": "Por lo que sé, la tienda cierra a las ocho.",
    "en": "As far as I know, the store closes at eight."
  },
  {
    "es": "La reunión ha sido programada para el lunes por la mañana.",
    "en": "The meeting has been scheduled for Monday morning."
  },
  {
    "es": "Resultó que él ya conocía a mis padres.",
    "en": "It turned out that he already knew my parents."
  },
  {
    "es": "Tenía la intención de llamarte, pero se me olvidó.",
    "en": "I meant to call you, but it slipped my mind."
  },
  {
    "es": "No hay muchas posibilidades de que ganemos.",
    "en": "There's not much chance of us winning."
  },
  {
    "es": "La película no estuvo a la altura de mis expectativas.",
    "en": "The movie didn't live up to my expectations."
  },
  {
    "es": "Él consiguió el trabajo a pesar de su falta de experiencia.",
    "en": "He got the job in spite of his lack of experience."
  },
  {
    "es": "Me di cuenta de que había dejado mi cartera en casa.",
    "en": "I realized that I had left my wallet at home."
  },
  {
    "es": "Si sigues las instrucciones, no deberías tener problemas.",
    "en": "If you follow the instructions, you shouldn't have any problems."
  },
  {
    "es": "Estoy considerando seriamente cambiar de carrera.",
    "en": "I'm seriously considering a career change."
  },
  {
    "es": "Es poco probable que llueva este fin de semana.",
    "en": "It's unlikely to rain this weekend."
  },
  {
    "es": "¿Podrías hacerme un favor y vigilar mi equipaje?",
    "en": "Could you do me a favor and watch my luggage?"
  },
  {
    "es": "Hablando en general, el clima aquí es bastante agradable.",
    "en": "Generally speaking, the weather here is quite pleasant."
  },
  {
    "es": "Se me da bastante bien resolver este tipo de problemas.",
    "en": "I'm quite good at solving this kind of problem."
  },
  {
    "es": "No sirve de nada preocuparse por cosas que no puedes cambiar.",
    "en": "It's no use worrying about things you can't change."
  },
  {
    "es": "Hasta ahora, todo ha ido según lo planeado.",
    "en": "So far, everything has gone according to plan."
  },
  {
    "es": "Ella se negó a admitir que estaba equivocada.",
    "en": "She refused to admit that she was wrong."
  },
  {
    "es": "Me temo que tu propuesta no es factible.",
    "en": "I'm afraid your proposal is not feasible."
  },
  {
    "es": "Finalmente se rindió y pidió ayuda.",
    "en": "He finally gave up and asked for help."
  },
  {
    "es": "Si no estuviera lloviendo, saldríamos a pasear.",
    "en": "If it weren't raining, we would go for a walk."
  },
  {
    "es": "Llevo tres años estudiando chino.",
    "en": "I have been studying Chinese for three years."
  },
  {
    "es": "Ojalá no hubiera comido tanto en la cena.",
    "en": "I wish I hadn't eaten so much for dinner."
  },
  {
    "es": "El puente fue construido hace más de cien años.",
    "en": "The bridge was built over a hundred years ago."
  },
  {
    "es": "Ella parecía sorprendida por la noticia.",
    "en": "She seemed to be surprised by the news."
  },
  {
    "es": "Él debe de estar bromeando; eso no puede ser cierto.",
    "en": "He must be joking; that can't be true."
  },
  {
    "es": "Voy a tener que recortar mis gastos.",
    "en": "I'm going to have to cut down on my expenses."
  },
  {
    "es": "Nunca te acostumbrarás si no lo intentas.",
    "en": "You'll never get used to it if you don't try."
  },
  {
    "es": "Si lo hubiera sabido, te habría llamado.",
    "en": "If I had known, I would have called you."
  },
  {
    "es": "Se dice que esta casa está encantada.",
    "en": "This house is said to be haunted."
  },
  {
    "es": "Mi coche se averió en medio de la autopista.",
    "en": "My car broke down in the middle of the motorway."
  },
  {
    "es": "A pesar de estudiar mucho, suspendió el examen.",
    "en": "Despite studying hard, he failed the exam."
  },
  {
    "es": "El informe destaca la necesidad de más financiación.",
    "en": "The report highlights the need for more funding."
  },
  {
    "es": "Ella es responsable de organizar el evento.",
    "en": "She is responsible for organizing the event."
  },
  {
    "es": "No veo la hora de verte de nuevo.",
    "en": "I'm looking forward to seeing you again."
  },
  {
    "es": "Recordó haber cerrado la puerta antes de irse.",
    "en": "He remembered locking the door before leaving."
  },
  {
    "es": "Este libro es tan interesante que no puedo dejar de leerlo.",
    "en": "This book is so interesting that I can't put it down."
  },
  {
    "es": "El vuelo se retrasó debido a problemas técnicos.",
    "en": "The flight was delayed due to technical issues."
  },
  {
    "es": "Si no te importa, prefiero quedarme en casa.",
    "en": "If you don't mind, I'd rather stay at home."
  },
  {
    "es": "Tengo que ponerme al día con mucho trabajo.",
    "en": "I have to catch up on a lot of work."
  },
  {
    "es": "Él se disculpó por haber llegado tarde.",
    "en": "He apologized for being late."
  },
  {
    "es": "Se están tomando medidas para resolver el problema.",
    "en": "Steps are being taken to solve the problem."
  },
  {
    "es": "Cuanto antes empecemos, antes terminaremos.",
    "en": "The sooner we start, the sooner we'll finish."
  },
  {
    "es": "Ella me convenció para que fuera a la fiesta con ella.",
    "en": "She persuaded me to go to the party with her."
  },
  {
    "es": "No tenía ni idea de que estabas en la ciudad.",
    "en": "I had no idea that you were in town."
  },
  {
    "es": "Me pregunto si estará libre este fin de semana.",
    "en": "I wonder if she will be free this weekend."
  },
  {
    "es": "A él no se le da bien hablar en público.",
    "en": "He isn't good at speaking in public."
  },
  {
    "es": "Se espera que los precios de la vivienda sigan subiendo.",
    "en": "House prices are expected to continue rising."
  },
  {
    "es": "No pudimos evitar reírnos de su chiste.",
    "en": "We couldn't help laughing at his joke."
  },
  {
    "es": "Me costó un poco entender lo que quería decir.",
    "en": "It took me a while to figure out what he meant."
  },
  {
    "es": "Se ha hecho un gran progreso en los últimos años.",
    "en": "A great deal of progress has been made in recent years."
  },
  {
    "es": "Ella sugirió que fuéramos al cine.",
    "en": "She suggested going to the cinema."
  },
  {
    "es": "Él lleva trabajando en la misma empresa desde que se graduó.",
    "en": "He has been working for the same company since he graduated."
  },
  {
    "es": "Si no hubieras estado allí, no sé qué habría hecho.",
    "en": "If you hadn't been there, I don't know what I would have done."
  },
  {
    "es": "Me he quedado sin ideas para la cena.",
    "en": "I've run out of ideas for dinner."
  },
  {
    "es": "Es importante seguir las normas de seguridad.",
    "en": "It's important to stick to the safety regulations."
  },
  {
    "es": "Ella me recordó que tenía una cita con el dentista.",
    "en": "She reminded me that I had a dentist appointment."
  },
  {
    "es": "A pesar del aumento de los costes, mantendremos nuestros precios.",
    "en": "In spite of the rising costs, we will maintain our prices."
  },
  {
    "es": "El ladrón fue sorprendido robando el coche.",
    "en": "The thief was caught stealing the car."
  },
  {
    "es": "No estoy acostumbrado a un clima tan frío.",
    "en": "I'm not used to such cold weather."
  },
  {
    "es": "Te haré saber mi decisión para mañana.",
    "en": "I will let you know my decision by tomorrow."
  },
  {
    "es": "Se arrepiente de haber gastado tanto dinero en ropa.",
    "en": "She regrets spending so much money on clothes."
  },
  {
    "es": "Él estaba a punto de rendirse cuando encontró la solución.",
    "en": "He was about to give up when he found the solution."
  },
  {
    "es": "Se rumorea que el actor se va a retirar.",
    "en": "The actor is rumored to be retiring."
  },
  {
    "es": "El equipo logró remontar y ganar el partido.",
    "en": "The team managed to come back and win the match."
  },
  {
    "es": "Si sigues así, vas a tener problemas.",
    "en": "If you carry on like this, you're going to be in trouble."
  },
  {
    "es": "Las nuevas regulaciones entrarán en vigor el próximo mes.",
    "en": "The new regulations will come into effect next month."
  },
  {
    "es": "No tenía intención de ofenderte.",
    "en": "I didn't mean to offend you."
  },
  {
    "es": "Es esencial que todos entiendan los riesgos.",
    "en": "It's essential for everyone to understand the risks."
  },
  {
    "es": "El libro, que fue escrito por un autor desconocido, se convirtió en un bestseller.",
    "en": "The book, which was written by an unknown author, became a bestseller."
  },
  {
    "es": "Él está considerando aceptar el trabajo en el extranjero.",
    "en": "He is considering taking the job abroad."
  },
  {
    "es": "A menos que haya tráfico, deberíamos llegar a tiempo.",
    "en": "Unless there's traffic, we should arrive on time."
  },
  {
    "es": "Ella se encargó del proyecto mientras su jefe estaba fuera.",
    "en": "She took over the project while her boss was away."
  },
  {
    "es": "Me temo que tendremos que posponer nuestra cita.",
    "en": "I'm afraid we'll have to put off our appointment."
  },
  {
    "es": "No me había dado cuenta de lo tarde que era.",
    "en": "I hadn't realized how late it was."
  },
  {
    "es": "El gobierno ha sido criticado por su gestión de la crisis.",
    "en": "The government has been criticized for its handling of the crisis."
  },
  {
    "es": "Si hubiera sabido de la fiesta, habría ido.",
    "en": "If I had known about the party, I would have gone."
  },
  {
    "es": "Él estaba decepcionado con los resultados del examen.",
    "en": "He was disappointed with the exam results."
  },
  {
    "es": "No sirve de nada llorar sobre la leche derramada.",
    "en": "There's no use crying over spilt milk."
  },
  {
    "es": "Ella siempre ha soñado con ser actriz.",
    "en": "She has always dreamed of becoming an actress."
  },
  {
    "es": "Es probable que el proyecto se complete antes de lo previsto.",
    "en": "The project is likely to be completed ahead of schedule."
  },
  {
    "es": "Tengo que admitir que estoy un poco nervioso.",
    "en": "I have to admit that I'm a bit nervous."
  },
  {
    "es": "La empresa está planeando lanzar un nuevo producto.",
    "en": "The company is planning to launch a new product."
  },
  {
    "es": "Me pregunto por qué no ha llamado todavía.",
    "en": "I wonder why he hasn't called yet."
  },
  {
    "es": "Él fue acusado de mentir bajo juramento.",
    "en": "He was accused of lying under oath."
  },
  {
    "es": "Si yo fuera el jefe, haría algunos cambios.",
    "en": "If I were the boss, I would make some changes."
  },
  {
    "es": "No estaba al tanto de los cambios recientes.",
    "en": "I wasn't aware of the recent changes."
  },
  {
    "es": "Tendrás que esforzarte más si quieres tener éxito.",
    "en": "You'll have to make more of an effort if you want to succeed."
  },
  {
    "es": "El concierto tuvo que ser cancelado en el último minuto.",
    "en": "The concert had to be called off at the last minute."
  },
  {
    "es": "Para cuando llegamos al cine, ya no quedaban entradas.",
    "en": "By the time we got to the cinema, the tickets had sold out."
  },
  {
    "es": "Él insistió en que yo probara el postre.",
    "en": "He insisted on me trying the dessert."
  },
  {
    "es": "No estoy seguro de cómo lidiar con este problema.",
    "en": "I'm not sure how to deal with this problem."
  },
  {
    "es": "Ella se negó a participar en la discusión.",
    "en": "She refused to take part in the discussion."
  },
  {
    "es": "Ha habido un aumento significativo en el coste de la vida.",
    "en": "There has been a significant increase in the cost of living."
  },
  {
    "es": "Si apruebas el examen, te compraré un regalo.",
    "en": "If you pass the exam, I'll buy you a present."
  },
  {
    "es": "Le advirtieron que no nadara en ese río.",
    "en": "He was warned not to swim in that river."
  },
  {
    "es": "Estoy pensando en tomarme un año sabático.",
    "en": "I'm thinking of taking a year off."
  },
  {
    "es": "La reunión fue mucho más larga de lo que esperaba.",
    "en": "The meeting was much longer than I had expected."
  },
  {
    "es": "Se encontró una solución al problema después de muchas discusiones.",
    "en": "A solution to the problem was found after much discussion."
  },
  {
    "es": "Ojalá viviera más cerca de la playa.",
    "en": "I wish I lived closer to the beach."
  },
  {
    "es": "Él no pudo evitar sonreír ante el comentario.",
    "en": "He couldn't help but smile at the comment."
  },
  {
    "es": "La empresa tiene como objetivo expandirse a los mercados asiáticos.",
    "en": "The company aims to expand into Asian markets."
  },
  {
    "es": "Si hubiera prestado atención, no habría cometido el error.",
    "en": "If he had paid attention, he wouldn't have made the mistake."
  },
  {
    "es": "Me enteré de que se habían comprometido.",
    "en": "I found out that they had gotten engaged."
  },
  {
    "es": "Ella está muy interesada en la fotografía.",
    "en": "She is very keen on photography."
  },
  {
    "es": "No tiene sentido intentar cambiar su opinión.",
    "en": "It's pointless trying to change his mind."
  },
  {
    "es": "El perro ha estado ladrando sin parar toda la mañana.",
    "en": "The dog has been barking non-stop all morning."
  },
  {
    "es": "A pesar de sus esfuerzos, no logró su objetivo.",
    "en": "In spite of his efforts, he didn't achieve his goal."
  },
  {
    "es": "Me pregunto si sería posible cambiar mi cita.",
    "en": "I was wondering if it would be possible to change my appointment."
  },
  {
    "es": "Se espera que el tiempo mejore durante el fin de semana.",
    "en": "The weather is expected to improve over the weekend."
  },
  {
    "es": "Él siempre se las arregla para salirse con la suya.",
    "en": "He always manages to get his own way."
  },
  {
    "es": "La nueva política fue implementada para mejorar la eficiencia.",
    "en": "The new policy was implemented to improve efficiency."
  },
  {
    "es": "Ella está considerando sus opciones cuidadosamente.",
    "en": "She is weighing up her options carefully."
  },
  {
    "es": "Si llueve, tendremos que cancelar el picnic.",
    "en": "If it rains, we will have to call off the picnic."
  },
  {
    "es": "Llevábamos conduciendo horas cuando finalmente llegamos.",
    "en": "We had been driving for hours when we finally arrived."
  },
  {
    "es": "No deberías haber gastado tanto dinero en eso.",
    "en": "You shouldn't have spent so much money on that."
  },
  {
    "es": "Se cree que el ejercicio regular es beneficioso para la salud.",
    "en": "It is widely believed that regular exercise is good for your health."
  },
  {
    "es": "No veo la hora de que termine este proyecto.",
    "en": "I can't wait for this project to be over."
  },
  {
    "es": "Él rechazó la oportunidad de trabajar en el extranjero.",
    "en": "He turned down the opportunity to work abroad."
  },
  {
    "es": "Cuanto más ejercicio haces, más en forma te pones.",
    "en": "The more you exercise, the fitter you get."
  },
  {
    "es": "No me gusta que me digan qué hacer.",
    "en": "I don't like being told what to do."
  },
  {
    "es": "Si hubiera sabido que venías, habría horneado un pastel.",
    "en": "If I'd known you were coming, I would have baked a cake."
  },
  {
    "es": "Él se disculpó por no haber podido asistir a la reunión.",
    "en": "He apologized for not being able to attend the meeting."
  },
  {
    "es": "La empresa está buscando formas de reducir costes.",
    "en": "The company is looking for ways to cut back on costs."
  },
  {
    "es": "Es una pena que no puedas unirte a nosotros.",
    "en": "It's a pity you can't join us."
  },
  {
    "es": "El informe debe entregarse antes del final del día.",
    "en": "The report must be handed in by the end of the day."
  },
  {
    "es": "Ella es la artista cuyo trabajo admiro mucho.",
    "en": "She's the artist whose work I greatly admire."
  },
  {
    "es": "Aunque el libro es largo, vale la pena leerlo.",
    "en": "Although the book is long, it is well worth reading."
  },
  {
    "es": "No me había dado cuenta de que me había dejado el paraguas.",
    "en": "I didn't realize I had left my umbrella behind."
  },
  {
    "es": "Se están haciendo esfuerzos para preservar el edificio histórico.",
    "en": "Efforts are being made to preserve the historic building."
  },
  {
    "es": "Si no fuera por su ayuda, estaría en serios problemas.",
    "en": "If it weren't for his help, I'd be in serious trouble."
  },
  {
    "es": "Él ha estado trabajando día y noche para cumplir el plazo.",
    "en": "He's been working around the clock to meet the deadline."
  },
  {
    "es": "Tengo la intención de solicitar esa beca.",
    "en": "I have every intention of applying for that scholarship."
  },
  {
    "es": "La decisión final recae en el comité.",
    "en": "The final decision rests with the committee."
  },
  {
    "es": "Por lo general, evito conducir durante la hora punta.",
    "en": "I generally avoid driving during the rush hour."
  },
  {
    "es": "Se nos acabaron las provisiones más rápido de lo esperado.",
    "en": "We ran out of supplies faster than we had expected."
  },
  {
    "es": "Ojalá pudiera hablar francés con fluidez.",
    "en": "I wish I could speak French fluently."
  },
  {
    "es": "Los resultados de la encuesta se darán a conocer la próxima semana.",
    "en": "The results of the survey will be released next week."
  },
  {
    "es": "Me temo que esa información es incorrecta.",
    "en": "I'm afraid that information is inaccurate."
  },
  {
    "es": "Ella se las arregló para armar los muebles por su cuenta.",
    "en": "She managed to put the furniture together on her own."
  },
  {
    "es": "Si yo fuera tú, aceptaría la oferta de trabajo.",
    "en": "If I were in your shoes, I would accept the job offer."
  },
  {
    "es": "El evento ha sido pospuesto indefinidamente.",
    "en": "The event has been postponed indefinitely."
  },
  {
    "es": "Nunca había experimentado algo así antes.",
    "en": "I had never experienced anything like it before."
  },
  {
    "es": "El debate se centró en cuestiones económicas.",
    "en": "The discussion was centered on economic issues."
  },
  {
    "es": "Él está decidido a tener éxito, sin importar los obstáculos.",
    "en": "He's determined to succeed, regardless of the obstacles."
  },
  {
    "es": "La obra fue elogiada por la crítica.",
    "en": "The play was highly praised by the critics."
  },
  {
    "es": "No me apetece cocinar esta noche, pidamos comida para llevar.",
    "en": "I don't feel like cooking tonight, let's get a takeaway."
  },
  {
    "es": "Si hubieras escuchado mi consejo, no estarías en este lío.",
    "en": "If you had listened to my advice, you wouldn't be in this mess."
  },
  {
    "es": "Llevan casados más de veinte años.",
    "en": "They have been married for over twenty years."
  },
  {
    "es": "El sospechoso fue puesto en libertad por falta de pruebas.",
    "en": "The suspect was released due to lack of evidence."
  },
  {
    "es": "Me pregunto cuál sería la mejor manera de abordar esto.",
    "en": "I'm wondering what the best approach to this would be."
  },
  {
    "es": "El éxito del proyecto depende de un trabajo en equipo eficaz.",
    "en": "The project's success depends on effective teamwork."
  },
  {
    "es": "No veo la razón de tanto alboroto.",
    "en": "I fail to see the reason for all the fuss."
  },
  {
    "es": "El plan tendrá que ser modificado para cumplir con las nuevas regulaciones.",
    "en": "The plan will have to be modified to comply with new regulations."
  },
  {
    "es": "No he decidido qué voy a hacer después de graduarme.",
    "en": "I haven't made up my mind about what I'm doing after graduation."
  },
  {
    "es": "A pesar de la fuerte competencia, ganaron el contrato.",
    "en": "Despite stiff competition, they won the contract."
  },
  {
    "es": "Ella podría haber olvidado nuestra cita.",
    "en": "She might have forgotten about our appointment."
  },
  {
    "es": "No se permite fumar en ninguna parte del edificio.",
    "en": "Smoking is not permitted anywhere in the building."
  },
  {
    "es": "Si me encuentro con él, le daré tu mensaje.",
    "en": "If I run into him, I'll give him your message."
  },
  {
    "es": "Él está acostumbrado a trabajar bajo presión.",
    "en": "He is used to working under pressure."
  },
  {
    "es": "Se rumorea que la pareja se va a divorciar.",
    "en": "The couple is rumored to be getting a divorce."
  },
  {
    "es": "Prefiero trabajar de forma independiente que en equipo.",
    "en": "I'd rather work independently than as part of a team."
  },
  {
    "es": "La conferencia cubrió una amplia gama de temas.",
    "en": "The conference covered a wide range of topics."
  },
  {
    "es": "Si no fuera tan caro, lo compraría.",
    "en": "If it weren't so expensive, I would buy it."
  },
  {
    "es": "Para el próximo mes, habré terminado este curso.",
    "en": "By next month, I will have finished this course."
  },
  {
    "es": "Él lamenta no haber pasado más tiempo con su familia.",
    "en": "He regrets not spending more time with his family."
  },
  {
    "es": "No hay pruebas que respalden sus afirmaciones.",
    "en": "There is no evidence to back up his claims."
  },
  {
    "es": "Se está llevando a cabo una investigación sobre la causa del accidente.",
    "en": "An investigation is being carried out into the cause of the accident."
  },
  {
    "es": "Tardé años en dominar el arte de la negociación.",
    "en": "It took me years to master the art of negotiation."
  },
  {
    "es": "Si hubieras invertido en esa empresa, ahora serías rico.",
    "en": "If you had invested in that company, you would be rich now."
  },
  {
    "es": "Ella tiene un talento natural para aprender idiomas.",
    "en": "She has a natural flair for learning languages."
  },
  {
    "es": "No podemos dar por sentado el acceso a agua limpia.",
    "en": "We cannot take access to clean water for granted."
  },
  {
    "es": "Se ha puesto mucho énfasis en la satisfacción del cliente.",
    "en": "A lot of emphasis has been placed on customer satisfaction."
  },
  {
    "es": "Dudo que aparezca después de lo que pasó.",
    "en": "I doubt he will show up after what happened."
  },
  {
    "es": "La empresa tuvo que despedir a la mitad de su plantilla.",
    "en": "The company had to lay off half of its workforce."
  },
  {
    "es": "Él es el tipo de persona que siempre cumple su palabra.",
    "en": "He's the sort of person who always keeps his word."
  },
  {
    "es": "Me resulta difícil concentrarme con tanto ruido.",
    "en": "I find it difficult to concentrate with so much noise."
  },
  {
    "es": "El paquete debería haber llegado ya.",
    "en": "The package ought to have arrived by now."
  },
  {
    "es": "Ella lo felicitó por su excelente actuación.",
    "en": "She complimented him on his excellent performance."
  },
  {
    "es": "Si el tren se retrasa, perderé mi conexión.",
    "en": "If the train is delayed, I will miss my connection."
  },
  {
    "es": "La sala estaba llena de gente deseosa de escuchar al orador.",
    "en": "The room was filled with people eager to hear the speaker."
  },
  {
    "es": "Se espera que el nuevo gerente traiga nuevas ideas.",
    "en": "The new manager is expected to bring in fresh ideas."
  },
  {
    "es": "Necesitamos elaborar un plan más detallado.",
    "en": "We need to draw up a more detailed plan."
  },
  {
    "es": "Si no hubiera sido por el tráfico, habría llegado a tiempo.",
    "en": "Had it not been for the traffic, I would have been on time."
  },
  {
    "es": "Él ha estado evitando hablar conmigo toda la semana.",
    "en": "He has been avoiding talking to me all week."
  },
  {
    "es": "No hay muchas posibilidades de que el tiempo mejore.",
    "en": "There is little likelihood of the weather improving."
  },
  {
    "es": "Estoy agotado; he estado trabajando en este informe todo el día.",
    "en": "I'm worn out; I've been working on this report all day."
  },
  {
    "es": "El problema es mucho más grave de lo que pensábamos inicialmente.",
    "en": "The problem is far more serious than we initially thought."
  },
  {
    "es": "Ella se negó a hacer comentarios sobre las acusaciones.",
    "en": "She declined to comment on the allegations."
  },
  {
    "es": "Parece que nos hemos quedado sin café.",
    "en": "It seems we have run out of coffee."
  },
  {
    "es": "Si tuviera que adivinar, diría que tiene unos treinta años.",
    "en": "If I had to guess, I'd say he's in his early thirties."
  },
  {
    "es": "El castillo, que data del siglo XV, está abierto al público.",
    "en": "The castle, which dates back to the 15th century, is open to the public."
  },
  {
    "es": "No estoy familiarizado con este software en particular.",
    "en": "I'm not familiar with this particular piece of software."
  },
  {
    "es": "Las reparaciones en la carretera están causando grandes retrasos.",
    "en": "The road repairs are causing major delays."
  },
  {
    "es": "Ojalá no tuviera que trabajar mañana.",
    "en": "I wish I didn't have to work tomorrow."
  },
  {
    "es": "La policía está investigando el misterioso caso.",
    "en": "The police are looking into the mysterious case."
  },
  {
    "es": "Se requiere que todos los empleados asistan a la capacitación.",
    "en": "All employees are required to attend the training."
  },
  {
    "es": "Ella se ofendió por su comentario grosero.",
    "en": "She took offence at his rude remark."
  },
  {
    "es": "Si no te das prisa, te quedaremos atrás.",
    "en": "If you don't hurry, you'll be left behind."
  },
  {
    "es": "A pesar de ser rico, lleva una vida muy sencilla.",
    "en": "Despite being wealthy, he leads a very simple life."
  },
  {
    "es": "Se ha propuesto una nueva ley para abordar el problema.",
    "en": "A new law has been proposed to tackle the issue."
  },
  {
    "es": "Él estaba profundamente absorto en su libro.",
    "en": "He was deeply engrossed in his book."
  },
  {
    "es": "No he tenido noticias de ella en mucho tiempo.",
    "en": "I haven't heard from her in ages."
  },
  {
    "es": "Si hubieras seguido el mapa, no nos habríamos perdido.",
    "en": "If you had followed the map, we wouldn't have gotten lost."
  },
  {
    "es": "Se le desaconsejó firmar el contrato sin leerlo.",
    "en": "He was advised against signing the contract without reading it."
  },
  {
    "es": "Lograron apagar el fuego antes de que se extendiera.",
    "en": "They succeeded in putting out the fire before it spread."
  },
  {
    "es": "No vale la pena comprar algo que no vas a usar.",
    "en": "It's not worth buying something you're not going to use."
  },
  {
    "es": "Ella ha estado lidiando con muchos problemas personales últimamente.",
    "en": "She has been coping with a lot of personal issues lately."
  },
  {
    "es": "Cuanto más aprendo, más me doy cuenta de lo poco que sé.",
    "en": "The more I learn, the more I realize how little I know."
  },
  {
    "es": "El edificio fue diseñado por un arquitecto de renombre.",
    "en": "The building was designed by a renowned architect."
  },
  {
    "es": "Me gustaría señalar que no todos estamos de acuerdo.",
    "en": "I'd like to point out that not all of us agree."
  },
  {
    "es": "Si no te sientes bien, deberías tomarte el día libre.",
    "en": "If you're not feeling well, you should take the day off."
  },
  {
    "es": "El proyecto fue abandonado por falta de fondos.",
    "en": "The project was abandoned due to a lack of funding."
  },
  {
    "es": "Él está considerando seriamente renunciar a su trabajo.",
    "en": "He is seriously contemplating resigning from his job."
  },
  {
    "es": "No me gusta que me interrumpan cuando estoy hablando.",
    "en": "I dislike being interrupted when I'm speaking."
  },
  {
    "es": "Para el 2030, los coches eléctricos habrán reemplazado a la mayoría de los coches de gasolina.",
    "en": "By 2030, electric cars will have replaced most gasoline cars."
  },
  {
    "es": "Si yo fuera un poco más alto, podría alcanzar ese estante.",
    "en": "If I were a bit taller, I could reach that shelf."
  },
  {
    "es": "No he podido contactar con él todavía.",
    "en": "I haven't been able to get through to him yet."
  },
  {
    "es": "Es un tema que ha sido ampliamente discutido en los medios.",
    "en": "It's a topic that has been widely discussed in the media."
  },
  {
    "es": "Él tiene una tendencia a posponer las cosas.",
    "en": "He has a tendency to put things off."
  },
  {
    "es": "Ojalá hubiera aprendido a tocar un instrumento cuando era más joven.",
    "en": "I wish I had learned to play an instrument when I was younger."
  },
  {
    "es": "La empresa se especializa en software a medida.",
    "en": "The company specializes in custom-made software."
  },
  {
    "es": "Ella se sintió aliviada al saber que todos estaban a salvo.",
    "en": "She was relieved to hear that everyone was safe."
  },
  {
    "es": "Si no hubiera llovido ayer, habríamos hecho una barbacoa.",
    "en": "If it hadn't rained yesterday, we would have had a barbecue."
  },
  {
    "es": "Se está presionando al gobierno para que actúe.",
    "en": "Pressure is being put on the government to take action."
  },
  {
    "es": "No tiene sentido preocuparse por el futuro.",
    "en": "There is no point in worrying about the future."
  },
  {
    "es": "Él me convenció de que no renunciara a mi trabajo.",
    "en": "He talked me out of quitting my job."
  },
  {
    "es": "Ella ha logrado un gran éxito en su carrera.",
    "en": "She has achieved a great deal of success in her career."
  },
  {
    "es": "El paquete fue entregado en la dirección equivocada.",
    "en": "The package was delivered to the wrong address."
  },
  {
    "es": "A menos que estudies, no aprobarás.",
    "en": "Unless you study, you won't pass."
  },
  {
    "es": "Me he estado sintiendo un poco mal últimamente.",
    "en": "I've been feeling a bit under the weather lately."
  },
  {
    "es": "El libro explora el impacto de la tecnología en la sociedad.",
    "en": "The book explores the impact of technology on society."
  },
  {
    "es": "Si te decides, avísame.",
    "en": "If you make up your mind, let me know."
  },
  {
    "es": "Se espera que el coste de la construcción supere el presupuesto.",
    "en": "The cost of construction is expected to exceed the budget."
  },
  {
    "es": "Él está muy orgulloso de los logros de su hija.",
    "en": "He is very proud of his daughter's achievements."
  },
  {
    "es": "La reunión se prolongó más de lo previsto.",
    "en": "The meeting went on for longer than expected."
  },
  {
    "es": "Si no fuera por tu consejo, habría cometido un gran error.",
    "en": "If it hadn't been for your advice, I would have made a huge mistake."
  },
  {
    "es": "La galería exhibe obras de artistas emergentes.",
    "en": "The gallery showcases works by up-and-coming artists."
  },
  {
    "es": "Me llevó un tiempo acostumbrarme a vivir en una gran ciudad.",
    "en": "It took me a while to get used to living in a big city."
  },
  {
    "es": "No se sabe mucho sobre sus primeros años de vida.",
    "en": "Not much is known about his early life."
  },
  {
    "es": "Él siempre encuentra una excusa para no hacer sus tareas.",
    "en": "He always comes up with an excuse for not doing his chores."
  },
  {
    "es": "Estoy seguro de que entenderá tu situación.",
    "en": "I'm sure he will be sympathetic to your situation."
  },
  {
    "es": "Ella ha estado trabajando como voluntaria en el hospital local.",
    "en": "She has been volunteering at the local hospital."
  },
  {
    "es": "Si tuviera la oportunidad, me encantaría vivir en el extranjero.",
    "en": "If I had the chance, I would love to live abroad."
  },
  {
    "es": "El informe fue encargado por el Ministerio de Salud.",
    "en": "The report was commissioned by the Ministry of Health."
  },
  {
    "es": "No puedo soportar el calor del verano.",
    "en": "I can't bear the summer heat."
  },
  {
    "es": "El gobierno está tratando de abordar el problema del desempleo.",
    "en": "The government is trying to tackle the problem of unemployment."
  },
  {
    "es": "Él estaba profundamente decepcionado por no conseguir el trabajo.",
    "en": "He was bitterly disappointed at not getting the job."
  },
  {
    "es": "Si hubieras estado prestando atención, habrías escuchado las instrucciones.",
    "en": "If you had been paying attention, you would have heard the instructions."
  },
  {
    "es": "Se están considerando varias opciones.",
    "en": "A number of options are being considered."
  },
  {
    "es": "No sirve de nada intentar razonar con él cuando está enfadado.",
    "en": "It's no good trying to reason with him when he's angry."
  },
  {
    "es": "Ella se vio obligada a elegir entre su carrera y su familia.",
    "en": "She was forced to choose between her career and her family."
  },
  {
    "es": "Ojalá hubiera sabido entonces lo que sé ahora.",
    "en": "I wish I had known then what I know now."
  },
  {
    "es": "Los niños estaban entusiasmados con la idea de ir al parque de atracciones.",
    "en": "The children were thrilled about going to the amusement park."
  },
  {
    "es": "Él ha estado luchando contra una enfermedad durante varios meses.",
    "en": "He has been battling an illness for several months."
  },
  {
    "es": "Si el tiempo empeora, cancelaremos el viaje.",
    "en": "If the weather takes a turn for the worse, we'll cancel the trip."
  },
  {
    "es": "La casa está actualmente en proceso de renovación.",
    "en": "The house is currently undergoing renovation."
  },
  {
    "es": "Ella se ofendió, aunque no era mi intención.",
    "en": "She took offense, although none was intended."
  },
  {
    "es": "No me arrepiento de las decisiones que he tomado.",
    "en": "I have no regrets about the decisions I've made."
  },
  {
    "es": "Se prevé que la población mundial siga creciendo.",
    "en": "The world's population is projected to continue to grow."
  },
  {
    "es": "Si no entiendes, no dudes en preguntar.",
    "en": "If you don't understand, don't hesitate to ask."
  },
  {
    "es": "He estado pensando mucho en tu propuesta.",
    "en": "I've been giving your proposal a lot of thought."
  },
  {
    "es": "El nuevo software es mucho más fácil de usar que el anterior.",
    "en": "The new software is far more user-friendly than the old one."
  },
  {
    "es": "Si hubiera salido antes, no habría perdido el autobús.",
    "en": "If I had left earlier, I wouldn't have missed the bus."
  },
  {
    "es": "Se ha hecho todo lo posible para garantizar su seguridad.",
    "en": "Every effort has been made to ensure their safety."
  },
  {
    "es": "Él no pudo dar una explicación razonable de su comportamiento.",
    "en": "He couldn't account for his strange behavior."
  },
  {
    "es": "El tema está fuera del alcance de esta discusión.",
    "en": "The topic is beyond the scope of this discussion."
  },
  {
    "es": "Ella ha contribuido significativamente al éxito del equipo.",
    "en": "She has contributed significantly to the team's success."
  },
  {
    "es": "No veo la hora de tomarme un merecido descanso.",
    "en": "I'm looking forward to taking a well-deserved break."
  },
  {
    "es": "Si tuvieras tres deseos, ¿qué pedirías?",
    "en": "If you had three wishes, what would you wish for?"
  },
  {
    "es": "El coche necesita ser revisado por un mecánico.",
    "en": "The car needs to be looked at by a mechanic."
  },
  {
    "es": "Él superó muchas dificultades para alcanzar sus metas.",
    "en": "He overcame many difficulties to achieve his goals."
  },
  {
    "es": "Es probable que la empresa se enfrente a una fuerte competencia.",
    "en": "The company is likely to face stiff competition."
  },
  {
    "es": "Nunca se me ocurrió que él podría estar mintiendo.",
    "en": "It never occurred to me that he might be lying."
  },
  {
    "es": "El festival de música fue un gran éxito.",
    "en": "The music festival was a resounding success."
  },
  {
    "es": "Ojalá pudiéramos volver atrás en el tiempo.",
    "en": "I wish we could turn back time."
  },
  {
    "es": "Si hubieras estado en mi lugar, ¿qué habrías hecho?",
    "en": "If you had been in my position, what would you have done?"
  },
  {
    "es": "La policía está pidiendo testigos del incidente.",
    "en": "The police are appealing for witnesses to the incident."
  },
  {
    "es": "Ella se ha forjado una reputación de ser honesta y trabajadora.",
    "en": "She has built a reputation for being honest and hard-working."
  },
  {
    "es": "El coste de la vida ha aumentado drásticamente en los últimos años.",
    "en": "The cost of living has risen dramatically in recent years."
  },
  {
    "es": "Él se negó rotundamente a responder a la pregunta.",
    "en": "He flatly refused to answer the question."
  },
  {
    "es": "Si la oferta sigue en pie, me gustaría aceptarla.",
    "en": "If the offer still stands, I'd like to accept it."
  },
  {
    "es": "Se ha planteado la preocupación por la seguridad del nuevo sistema.",
    "en": "Concerns have been raised about the safety of the new system."
  },
  {
    "es": "Me resulta increíble que haya aprobado el examen.",
    "en": "I find it incredible that he passed the exam."
  },
  {
    "es": "No tiene caso intentar convencerla.",
    "en": "It's no use trying to convince her."
  },
  {
    "es": "Para cuando ella llegue, la cena estará fría.",
    "en": "By the time she arrives, the dinner will be cold."
  },
  {
    "es": "Si yo fuera tú, buscaría asesoramiento legal.",
    "en": "If I were you, I would seek legal advice."
  },
  {
    "es": "La empresa está al borde del colapso financiero.",
    "en": "The company is on the verge of financial collapse."
  },
  {
    "es": "Él admitió haber cometido un grave error de juicio.",
    "en": "He admitted to making a serious error of judgment."
  },
  {
    "es": "Se deben seguir estrictamente las directrices.",
    "en": "The guidelines must be strictly followed."
  },
  {
    "es": "Ojalá hubiera prestado más atención en clase.",
    "en": "I wish I had paid more attention in class."
  },
  {
    "es": "Ella tiene un profundo conocimiento de la historia del arte.",
    "en": "She has a thorough understanding of art history."
  },
  {
    "es": "Si no hubiera sido por el rápido accionar de los bomberos, el edificio se habría quemado.",
    "en": "If it hadn't been for the fire brigade's quick action, the building would have burned down."
  },
  {
    "es": "El gobierno ha prometido tomar medidas enérgicas contra el crimen.",
    "en": "The government has pledged to crack down on crime."
  },
  {
    "es": "No estoy del todo convencido de que sea una buena idea.",
    "en": "I'm not entirely convinced that it's a good idea."
  },
  {
    "es": "Él está decidido a demostrar que sus críticos están equivocados.",
    "en": "He is determined to prove his critics wrong."
  },
  {
    "es": "A pesar de las críticas, ella se mantuvo firme en su decisión.",
    "en": "Despite the criticism, she stuck to her decision."
  },
  {
    "es": "El lanzamiento del producto ha sido pospuesto hasta el próximo trimestre.",
    "en": "The product launch has been put back until the next quarter."
  },
  {
    "es": "Si se presenta la oportunidad, deberías aprovecharla.",
    "en": "If the opportunity arises, you should take it."
  },
  {
    "es": "Se aconseja a los pasajeros que lleguen al aeropuerto con dos horas de antelación.",
    "en": "Passengers are advised to arrive at the airport two hours in advance."
  },
  {
    "es": "Él me convenció para que invirtiera en su nuevo negocio.",
    "en": "He talked me into investing in his new business."
  },
  {
    "es": "La calidad del aire en la ciudad ha mejorado notablemente.",
    "en": "The air quality in the city has improved remarkably."
  },
  {
    "es": "Ojalá el tiempo fuera un poco más cálido.",
    "en": "I wish the weather were a bit warmer."
  },
  {
    "es": "Si no fuera por Internet, la vida sería muy diferente.",
    "en": "If it weren't for the internet, life would be very different."
  },
  {
    "es": "La película no cumplió con las altas expectativas.",
    "en": "The movie failed to live up to the high expectations."
  },
  {
    "es": "Él ha estado luchando para llegar a fin de mes.",
    "en": "He has been struggling to make ends meet."
  },
  {
    "es": "Se ha logrado un progreso considerable en la búsqueda de una cura.",
    "en": "Considerable progress has been made in the search for a cure."
  },
  {
    "es": "Si te hubiera visto, te habría saludado.",
    "en": "If I had seen you, I would have said hello."
  },
  {
    "es": "Ella se enorgullece de su trabajo.",
    "en": "She takes great pride in her work."
  },
  {
    "es": "No sirve de nada culpar a los demás de tus propios errores.",
    "en": "It's no use blaming others for your own mistakes."
  },
  {
    "es": "Para el final de esta década, habremos establecido una base en Marte.",
    "en": "By the end of this decade, we will have established a base on Mars."
  },
  {
    "es": "Si no fuera por su interferencia, ya habríamos terminado.",
    "en": "But for his interference, we would have finished by now."
  },
  {
    "es": "Él está buscando un nuevo desafío en su carrera.",
    "en": "He is looking for a new challenge in his career."
  },
  {
    "es": "Se rumorea que la empresa está a punto de anunciar despidos.",
    "en": "The company is rumored to be on the verge of announcing layoffs."
  },
  {
    "es": "No estoy acostumbrado a que me traten de esa manera.",
    "en": "I'm not used to being treated like that."
  },
  {
    "es": "Si estudias mucho, es probable que te vaya bien en el examen.",
    "en": "If you study hard, you are likely to do well on the exam."
  },
  {
    "es": "El debate sobre la inmigración es un tema muy delicado.",
    "en": "The debate on immigration is a very sensitive issue."
  },
  {
    "es": "Él ha sido acusado de aceptar sobornos.",
    "en": "He has been accused of accepting bribes."
  },
  {
    "es": "Se necesita más investigación para confirmar estos hallazgos.",
    "en": "Further research is needed to confirm these findings."
  },
  {
    "es": "Si yo fuera tú, no me preocuparía por eso.",
    "en": "If I were in your position, I wouldn't worry about it."
  },
  {
    "es": "Ella tiene un gran dominio del idioma inglés.",
    "en": "She has an excellent command of the English language."
  },
  {
    "es": "A pesar de la recesión económica, la empresa logró obtener beneficios.",
    "en": "In spite of the economic downturn, the company managed to make a profit."
  },
  {
    "es": "Ojalá no hubiera dicho lo que dije.",
    "en": "I wish I hadn't said what I said."
  },
  {
    "es": "El nuevo sistema está diseñado para evitar que ocurran tales errores.",
    "en": "The new system is designed to prevent such errors from occurring."
  },
  {
    "es": "Él tiene una notable capacidad para recordar nombres y caras.",
    "en": "He has a remarkable ability to remember names and faces."
  },
  {
    "es": "Si no hubiéramos tomado un atajo, habríamos llegado tarde.",
    "en": "If we hadn't taken a shortcut, we would have been late."
  },
  {
    "es": "No se puede negar que ella es una música talentosa.",
    "en": "There is no denying that she is a talented musician."
  },
  {
    "es": "La empresa está buscando activamente nuevos mercados para expandirse.",
    "en": "The company is actively seeking new markets to expand into."
  },
  {
    "es": "Él lamenta profundamente sus acciones.",
    "en": "He is deeply regretful of his actions."
  },
  {
    "es": "Si sigues las recomendaciones, tu salud mejorará.",
    "en": "Provided you follow the recommendations, your health will improve."
  },
  {
    "es": "La reunión se ha aplazado a una fecha posterior.",
    "en": "The meeting has been adjourned to a later date."
  },
  {
    "es": "No tenía la menor intención de causarte problemas.",
    "en": "I hadn't the slightest intention of causing you trouble."
  },
  {
    "es": "Él está bajo una inmensa presión para tener éxito.",
    "en": "He is under immense pressure to succeed."
  },
  {
    "es": "Se está construyendo un nuevo hospital en las afueras de la ciudad.",
    "en": "A new hospital is being built on the outskirts of the town."
  },
  {
    "es": "Si tuviera que elegir, preferiría vivir en el campo.",
    "en": "If I had the choice, I would rather live in the countryside."
  },
  {
    "es": "El proyecto está progresando según lo previsto.",
    "en": "The project is progressing according to schedule."
  },
  {
    "es": "Ella se recuperó completamente de su enfermedad.",
    "en": "She made a full recovery from her illness."
  },
  {
    "es": "Ojalá tuviera más tiempo libre para dedicar a mis aficiones.",
    "en": "I wish I had more free time to devote to my hobbies."
  },
  {
    "es": "Si no hubiera sido por el mal tiempo, el evento habría sido un éxito.",
    "en": "Had it not been for the bad weather, the event would have been a success."
  },
  {
    "es": "Él es ampliamente considerado como uno de los mejores actores de su generación.",
    "en": "He is widely regarded as one of the best actors of his generation."
  },
  {
    "es": "No tiene sentido comprar la última tecnología si no sabes cómo usarla.",
    "en": "There is little point in buying the latest technology if you don't know how to use it."
  },
  {
    "es": "La empresa se vio obligada a reducir su fuerza laboral.",
    "en": "The company was forced to downsize its workforce."
  },
  {
    "es": "Si no sales ahora, perderás el comienzo de la película.",
    "en": "If you don't leave now, you'll miss the beginning of the movie."
  },
  {
    "es": "A ella le resulta fácil hacer nuevos amigos.",
    "en": "She finds it easy to make new friends."
  },
  {
    "es": "Los resultados del estudio fueron bastante sorprendentes.",
    "en": "The findings of the study were quite surprising."
  },
  {
    "es": "Él estaba tan cansado que se quedó dormido en el sofá.",
    "en": "He was so tired that he fell asleep on the sofa."
  },
  {
    "es": "Si hubiera sabido la respuesta, te la habría dicho.",
    "en": "If I had known the answer, I would have told you."
  },
  {
    "es": "Se han tomado medidas para mejorar la seguridad en el lugar de trabajo.",
    "en": "Measures have been taken to improve workplace safety."
  },
  {
    "es": "Él no estaba dispuesto a comprometer sus principios.",
    "en": "He was unwilling to compromise his principles."
  },
  {
    "es": "Estoy deseando ponerme al día contigo.",
    "en": "I'm looking forward to catching up with you."
  },
  {
    "es": "Ella ha estado trabajando incansablemente para alcanzar sus metas.",
    "en": "She has been working tirelessly to achieve her goals."
  },
  {
    "es": "Si ganara la lotería, dejaría mi trabajo inmediatamente.",
    "en": "If I won the lottery, I would quit my job immediately."
  },
  {
    "es": "El plan fue recibido con considerable escepticismo.",
    "en": "The plan was met with considerable skepticism."
  },
  {
    "es": "Ojalá pudiera recordar dónde puse mis llaves.",
    "en": "I wish I could remember where I put my keys."
  },
  {
    "es": "Él ha hecho una contribución invaluable al equipo.",
    "en": "He has made an invaluable contribution to the team."
  },
  {
    "es": "Si no hubiera recibido esa beca, no habría podido ir a la universidad.",
    "en": "If I hadn't received that scholarship, I wouldn't have been able to go to college."
  },
  {
    "es": "La empresa está obligada por ley a proporcionar un entorno de trabajo seguro.",
    "en": "The company is legally bound to provide a safe working environment."
  },
  {
    "es": "Él está decidido a marcar la diferencia en el mundo.",
    "en": "He is determined to make a difference in the world."
  },
  {
    "es": "No veo la lógica detrás de su argumento.",
    "en": "I fail to see the logic behind his argument."
  },
  {
    "es": "Para el próximo año, habrán estado viviendo en el extranjero durante una década.",
    "en": "By next year, they will have been living abroad for a decade."
  },
  {
    "es": "Si vas a llegar tarde, por favor avísame.",
    "en": "If you are going to be late, please let me know."
  },
  {
    "es": "Él no estaba al tanto del peligro en el que se encontraba.",
    "en": "He was oblivious to the danger he was in."
  },
  {
    "es": "La nueva política ha sido objeto de intensas críticas.",
    "en": "The new policy has come under intense criticism."
  },
  {
    "es": "Si yo fuera tú, no lo daría por sentado.",
    "en": "If I were you, I wouldn't take it for granted."
  },
  {
    "es": "Ella se sintió halagada por los elogios.",
    "en": "She was flattered by the compliments."
  },
  {
    "es": "Él se negó a dejarse intimidar por las amenazas.",
    "en": "He refused to be intimidated by the threats."
  },
  {
    "es": "Ojalá no hubiera comido ese último trozo de pastel.",
    "en": "I wish I hadn't eaten that last piece of cake."
  },
  {
    "es": "Se espera que el acuerdo beneficie a ambas partes.",
    "en": "The agreement is expected to be mutually beneficial."
  },
  {
    "es": "Si no hubiera sido por su rápido pensamiento, habría habido un accidente grave.",
    "en": "If it hadn't been for his quick thinking, there would have been a serious accident."
  },
  {
    "es": "Él tiene una merecida reputación de ser justo.",
    "en": "He has a well-deserved reputation for being fair."
  },
  {
    "es": "La empresa está buscando reducir su impacto ambiental.",
    "en": "The company is looking to reduce its environmental footprint."
  },
  {
    "es": "No me hagas promesas que no puedes cumplir.",
    "en": "Don't make me promises you can't keep."
  },
  {
    "es": "Si hubiéramos sabido de sus dificultades, habríamos ofrecido ayuda.",
    "en": "Had we known of their difficulties, we would have offered to help."
  },
  {
    "es": "El éxito del evento superó todas nuestras expectativas.",
    "en": "The success of the event exceeded all our expectations."
  },
  {
    "es": "Él es el único responsable de la decisión.",
    "en": "He is solely responsible for the decision."
  },
  {
    "es": "Se está investigando la causa exacta del incendio.",
    "en": "The exact cause of the fire is under investigation."
  },
  {
    "es": "Si tuviera la oportunidad de empezar de nuevo, haría las cosas de otra manera.",
    "en": "If I had the chance to start over, I would do things differently."
  },
  {
    "es": "Ojalá supiera qué hacer en esta situación.",
    "en": "I wish I knew what to do in this situation."
  },
  {
    "es": "El proyecto fue un esfuerzo de colaboración entre varios departamentos.",
    "en": "The project was a collaborative effort between several departments."
  },
  {
    "es": "Él no se da cuenta del problema que ha causado.",
    "en": "He is unaware of the trouble he has caused."
  },
  {
    "es": "Si no sales inmediatamente, llamaré a la policía.",
    "en": "Unless you leave immediately, I will call the police."
  },
  {
    "es": "Ella no está acostumbrada a un trabajo tan exigente físicamente.",
    "en": "She is not accustomed to such physically demanding work."
  },
  {
    "es": "Se ha puesto mucho esfuerzo en hacer de este evento un éxito.",
    "en": "A great deal of effort has gone into making this event a success."
  },
  {
    "es": "Él finalmente cedió a la presión y renunció.",
    "en": "He eventually gave in to the pressure and resigned."
  },
  {
    "es": "Si hubiera seguido tus instrucciones, esto no habría pasado.",
    "en": "If I had followed your instructions, this would not have happened."
  },
  {
    "es": "La empresa ha experimentado un período de rápido crecimiento.",
    "en": "The company has undergone a period of rapid growth."
  },
  {
    "es": "Ojalá no tuviera que levantarme tan temprano todos los días.",
    "en": "I wish I didn't have to get up so early every day."
  },
  {
    "es": "Él fue elogiado por su valentía y liderazgo.",
    "en": "He was praised for his courage and leadership."
  },
  {
    "es": "Se ha llegado a un acuerdo entre las dos partes.",
    "en": "An agreement has been reached between the two parties."
  },
  {
    "es": "Si hubieras estado allí, habrías entendido.",
    "en": "If you had been there, you would have understood."
  },
  {
    "es": "Ella tiene un conocimiento práctico de varios idiomas.",
    "en": "She has a working knowledge of several languages."
  },
  {
    "es": "Él siempre está dispuesto a echar una mano.",
    "en": "He is always willing to lend a helping hand."
  },
  {
    "es": "Si no fuera por los avances médicos, muchas enfermedades seguirían siendo incurables.",
    "en": "Were it not for medical advances, many diseases would still be incurable."
  },
  {
    "es": "La reunión fue cancelada con muy poca antelación.",
    "en": "The meeting was cancelled at very short notice."
  },
  {
    "es": "Él lamentó no haber aprovechado la oportunidad.",
    "en": "He regretted not taking advantage of the opportunity."
  },
  {
    "es": "Para el año que viene, ya me habré graduado de la universidad.",
    "en": "By this time next year, I will have graduated from university."
  },
  {
    "es": "Si no fuera por su apoyo, no lo habría logrado.",
    "en": "Without his support, I wouldn't have made it."
  },
  {
    "es": "Ella está bien cualificada para el trabajo.",
    "en": "She is well-qualified for the job."
  },
  {
    "es": "Él estaba completamente perplejo por la pregunta.",
    "en": "He was completely baffled by the question."
  },
  {
    "es": "Se ha hecho todo lo humanamente posible.",
    "en": "Everything humanly possible has been done."
  },
  {
    "es": "Si yo fuera tú, no me arriesgaría.",
    "en": "If I were you, I wouldn't take the risk."
  },
  {
    "es": "Él tiene un historial probado de éxito.",
    "en": "He has a proven track record of success."
  },
  {
    "es": "Ojalá hubiera traído una chaqueta; hace frío.",
    "en": "I wish I had brought a jacket; it's cold."
  },
  {
    "es": "El plan está sujeto a la aprobación de la dirección.",
    "en": "The plan is subject to approval from the management."
  },
  {
    "es": "Si hubiera sabido que estabas enfermo, te habría visitado.",
    "en": "If I had known you were ill, I would have visited you."
  },
  {
    "es": "Ella superó sus expectativas en el examen.",
    "en": "She exceeded expectations in the exam."
  },
  {
    "es": "Él está bajo investigación por presunta mala conducta.",
    "en": "He is under investigation for alleged misconduct."
  },
  {
    "es": "Se ha alcanzado un consenso sobre los puntos clave.",
    "en": "A consensus has been reached on the key points."
  },
  {
    "es": "Si no fuera por su terquedad, podríamos llegar a un acuerdo.",
    "en": "If it weren't for his stubbornness, we could reach an agreement."
  },
  {
    "es": "Ella está considerando seriamente una oferta de trabajo de un competidor.",
    "en": "She is seriously considering a job offer from a competitor."
  },
  {
    "es": "Él fue absuelto de todos los cargos.",
    "en": "He was acquitted of all charges."
  },
  {
    "es": "Se deben tomar precauciones para evitar accidentes.",
    "en": "Precautions should be taken to prevent accidents."
  },
  {
    "es": "Si no me lo hubieras recordado, se me habría olvidado por completo.",
    "en": "If you hadn't reminded me, I would have completely forgotten."
  },
  {
    "es": "Ella tiene un talento para hacer que la gente se sienta a gusto.",
    "en": "She has a knack for making people feel at ease."
  },
  {
    "es": "Él está decidido a no cometer el mismo error dos veces.",
    "en": "He is determined not to make the same mistake twice."
  },
  {
    "es": "La empresa ha anunciado planes para expandirse internacionalmente.",
    "en": "The company has unveiled plans to expand internationally."
  },
  {
    "es": "Si tuviera más confianza, me presentaría al puesto.",
    "en": "If I were more confident, I would apply for the position."
  },
  {
    "es": "Ojalá las vacaciones pudieran durar para siempre.",
    "en": "I wish the holidays could last forever."
  },
  {
    "es": "Él fue criticado por su falta de iniciativa.",
    "en": "He was criticized for his lack of initiative."
  },
  {
    "es": "Las nuevas medidas están destinadas a mejorar la seguridad pública.",
    "en": "The new measures are aimed at improving public safety."
  },
  {
    "es": "Si hubiera sabido el resultado, no me habría preocupado tanto.",
    "en": "If I had known the outcome, I wouldn't have worried so much."
  },
  {
    "es": "Ella está muy involucrada en actividades comunitarias.",
    "en": "She is heavily involved in community activities."
  },
  {
    "es": "Él está luchando por equilibrar el trabajo y la vida familiar.",
    "en": "He is struggling to balance work and family life."
  },
  {
    "es": "Se ha llegado a un punto muerto en las negociaciones.",
    "en": "A deadlock has been reached in the negotiations."
  },
  {
    "es": "Si no estuviera tan ocupado, me uniría a vosotros.",
    "en": "If I weren't so busy, I would join you."
  },
  {
    "es": "Ella no estaba al tanto de las consecuencias de sus acciones.",
    "en": "She was unaware of the consequences of her actions."
  },
  {
    "es": "Él está bajo una enorme presión para cumplir con los plazos.",
    "en": "He is under enormous pressure to meet deadlines."
  },
  {
    "es": "Se está llevando a cabo una revisión exhaustiva de las políticas de la empresa.",
    "en": "A thorough review of the company's policies is being conducted."
  },
  {
    "es": "Si no hubiera sido por la intervención del árbitro, la pelea habría continuado.",
    "en": "But for the referee's intervention, the fight would have continued."
  },
  {
    "es": "Ella tiene una memoria fotográfica para los detalles.",
    "en": "She has a photographic memory for details."
  },
  {
    "es": "Él ha sido fundamental en el éxito del proyecto.",
    "en": "He has been instrumental in the project's success."
  },
  {
    "es": "Se espera que el nuevo fármaco revolucione el tratamiento de la enfermedad.",
    "en": "The new drug is expected to revolutionize the treatment of the disease."
  },
  {
    "es": "Si hubiera sabido de tus problemas, habría intentado ayudar.",
    "en": "Had I known about your problems, I would have tried to help."
  },
  {
    "es": "Ella está considerando la posibilidad de iniciar su propio negocio.",
    "en": "She is contemplating the possibility of starting her own business."
  },
  {
    "es": "Él es reacio a admitir su error.",
    "en": "He is reluctant to admit his mistake."
  },
  {
    "es": "La empresa ha sido elogiada por su compromiso con la sostenibilidad.",
    "en": "The company has been praised for its commitment to sustainability."
  },
  {
    "es": "Si no fuera por los voluntarios, el evento no sería posible.",
    "en": "If it weren't for the volunteers, the event wouldn't be possible."
  },
  {
    "es": "Ojalá hubiera una manera más fácil de hacer esto.",
    "en": "I wish there were an easier way to do this."
  },
  {
    "es": "Él fue falsamente acusado de un crimen que no cometió.",
    "en": "He was falsely accused of a crime he did not commit."
  },
  {
    "es": "Se están haciendo preparativos para la visita real.",
    "en": "Arrangements are being made for the royal visit."
  },
  {
    "es": "Si hubiera seguido mi instinto, no estaría en esta situación.",
    "en": "If I had followed my gut feeling, I wouldn't be in this situation."
  },
  {
    "es": "Ella tiene un profundo aprecio por la música clásica.",
    "en": "She has a deep appreciation for classical music."
  },
  {
    "es": "Él está bajo un contrato que le impide trabajar para competidores.",
    "en": "He is under a contract that prevents him from working for competitors."
  },
  {
    "es": "Se ha alcanzado un compromiso entre las partes en conflicto.",
    "en": "A compromise has been reached between the conflicting parties."
  },
  {
    "es": "Si no fuera por las redes sociales, no me habría enterado.",
    "en": "If it wasn't for social media, I wouldn't have found out."
  },
  {
    "es": "Ella tiene una comprensión integral de los problemas.",
    "en": "She has a comprehensive understanding of the issues."
  },
  {
    "es": "Él estaba visiblemente conmovido por la cálida bienvenida.",
    "en": "He was visibly moved by the warm welcome."
  },
  {
    "es": "Se está haciendo un esfuerzo concertado para mejorar el transporte público.",
    "en": "A concerted effort is being made to improve public transport."
  },
  {
    "es": "Si no hubieras interferido, todo habría ido bien.",
    "en": "If you hadn't interfered, everything would have been fine."
  },
  {
    "es": "Ella tiene una capacidad asombrosa para recuperarse de los contratiempos.",
    "en": "She has an amazing capacity to bounce back from setbacks."
  },
  {
    "es": "Él es un firme creyente en el poder del pensamiento positivo.",
    "en": "He is a firm believer in the power of positive thinking."
  },
  {
    "es": "La decisión fue tomada en el mejor interés de la empresa.",
    "en": "The decision was made in the best interests of the company."
  },
  {
    "es": "Si supiera su número, lo llamaría ahora mismo.",
    "en": "If I knew his number, I would call him right now."
  },
  {
    "es": "Ojalá hubiera alguien aquí que pudiera ayudar.",
    "en": "I wish there were someone here who could help."
  },
  {
    "es": "Él fue criticado por su manejo de la situación.",
    "en": "He came under fire for his handling of the situation."
  },
  {
    "es": "Se está considerando legislación para prohibir la práctica.",
    "en": "Legislation is being considered to outlaw the practice."
  },
  {
    "es": "Si hubiera sabido que era tan importante, habría sido más cuidadoso.",
    "en": "If I had known it was so important, I would have been more careful."
  },
  {
    "es": "Ella tiene una merecida reputación de integridad.",
    "en": "She has a well-earned reputation for integrity."
  },
  {
    "es": "Él está bajo la impresión errónea de que todos están de acuerdo con él.",
    "en": "He is under the mistaken impression that everyone agrees with him."
  },
  {
    "es": "Se están explorando todas las vías para encontrar una solución.",
    "en": "All avenues are being explored to find a solution."
  },
  {
    "es": "Si no fuera por la tecnología moderna, esta tarea sería imposible.",
    "en": "Were it not for modern technology, this task would be impossible."
  },
  {
    "es": "Ella no tiene la intención de disculparse.",
    "en": "She has no intention of apologizing."
  },
  {
    "es": "Él estaba muy decepcionado con el resultado.",
    "en": "He was sorely disappointed with the outcome."
  },
  {
    "es": "Se está llevando a cabo una investigación completa sobre las acusaciones.",
    "en": "A full-scale investigation into the allegations is underway."
  },
  {
    "es": "Si hubiera sabido que te gustaba el jazz, habría comprado entradas.",
    "en": "If I had known you liked jazz, I would have bought tickets."
  },
  {
    "es": "Ella tiene un profundo afecto por sus abuelos.",
    "en": "She has a deep affection for her grandparents."
  },
  {
    "es": "Él está bajo juramento de no revelar ninguna información.",
    "en": "He is under oath not to disclose any information."
  },
  {
    "es": "Se ha logrado un gran avance en la comprensión de la enfermedad.",
    "en": "A major breakthrough has been made in understanding the disease."
  },
  {
    "es": "Si no estuviera lloviendo a cántaros, podríamos salir.",
    "en": "If it weren't pouring with rain, we could go out."
  },
  {
    "es": "Ojalá pudiera ser de más ayuda.",
    "en": "I wish I could be of more help."
  },
  {
    "es": "Él fue abrumado por la generosidad de sus amigos.",
    "en": "He was overwhelmed by the generosity of his friends."
  },
  {
    "es": "Se están tomando medidas para garantizar la igualdad de oportunidades para todos.",
    "en": "Steps are being taken to ensure equal opportunities for all."
  },
  {
    "es": "Si hubiera tenido más tiempo, habría revisado mi trabajo.",
    "en": "If I had had more time, I would have double-checked my work."
  },
  {
    "es": "Ella tiene una comprensión matizada de la política internacional.",
    "en": "She has a nuanced understanding of international politics."
  },
  {
    "es": "Él está bajo constante escrutinio de los medios.",
    "en": "He is under constant scrutiny from the media."
  },
  {
    "es": "Se ha formado una comisión para investigar el asunto.",
    "en": "A committee has been set up to investigate the matter."
  },
  {
    "es": "Si no fuera por su terquedad, sería mucho más fácil trabajar con él.",
    "en": "If it weren't for his stubborn streak, he'd be much easier to work with."
  },
  {
    "es": "Ella tiene una perspectiva única sobre el tema.",
    "en": "She has a unique perspective on the issue."
  },
  {
    "es": "Él estaba completamente ajeno a lo que estaba sucediendo a su alrededor.",
    "en": "He was completely oblivious to what was happening around him."
  },
  {
    "es": "Se está desarrollando una nueva estrategia para combatir la pobreza.",
    "en": "A new strategy is being developed to combat poverty."
  },
  {
    "es": "Si hubiera sabido que ibas a estar aquí, habría venido antes.",
    "en": "If I had known you were going to be here, I would have come earlier."
  },
  {
    "es": "Ella tiene un profundo respeto por sus mayores.",
    "en": "She has a profound respect for her elders."
  },
  {
    "es": "Él está bajo la obligación contractual de terminar el proyecto.",
    "en": "He is under a contractual obligation to finish the project."
  },
  {
    "es": "Se ha llegado a un acuerdo provisional, pendiente de aprobación.",
    "en": "A provisional agreement has been reached, pending approval."
  },
  {
    "es": "Si no fuera por la evidencia de ADN, podría haber sido condenado.",
    "en": "But for the DNA evidence, he might have been convicted."
  },
  {
    "es": "Ella tiene un conocimiento enciclopédico sobre el tema.",
    "en": "She has an encyclopedic knowledge of the subject."
  },
  {
    "es": "Él estaba visiblemente sacudido por la experiencia.",
    "en": "He was visibly shaken by the experience."
  },
  {
    "es": "Se está haciendo un esfuerzo continuo para reducir los residuos.",
    "en": "A continuous effort is being made to reduce waste."
  },
  {
    "es": "Si no hubieras estado allí para atraparme, me habría caído.",
    "en": "If you hadn't been there to catch me, I would have fallen."
  },
  {
    "es": "Ella tiene una capacidad innata para liderar.",
    "en": "She has an innate ability to lead."
  },
  {
    "es": "Él es un defensor acérrimo de los derechos de los animales.",
    "en": "He is a staunch advocate for animal rights."
  },
  {
    "es": "La decisión final fue tomada por unanimidad.",
    "en": "The final decision was made unanimously."
  },
  {
    "es": "Si tuviera que hacerlo todo de nuevo, no cambiaría nada.",
    "en": "If I had to do it all over again, I wouldn't change a thing."
  },
  {
    "es": "Ojalá pudiera teletransportarme a una playa ahora mismo.",
    "en": "I wish I could teleport to a beach right now."
  },
  {
    "es": "Él fue exonerado de toda culpa en el accidente.",
    "en": "He was exonerated from all blame for the accident."
  },
  {
    "es": "Se están implementando nuevas medidas de seguridad en el aeropuerto.",
    "en": "New security measures are being implemented at the airport."
  },
  {
    "es": "Si hubiera sabido de la reunión, habría preparado una presentación.",
    "en": "If I had known about the meeting, I would have prepared a presentation."
  },
  {
    "es": "Ella tiene una profunda comprensión de la naturaleza humana.",
    "en": "She has a profound understanding of human nature."
  },
  {
    "es": "Él está bajo una tremenda cantidad de estrés.",
    "en": "He is under a tremendous amount of stress."
  },
  {
    "es": "Se está estableciendo un fondo para ayudar a las víctimas del desastre.",
    "en": "A fund is being established to help the victims of the disaster."
  },
  {
    "es": "Si no fuera por su persistencia, el proyecto nunca se habría completado.",
    "en": "Were it not for her persistence, the project would never have been completed."
  },
  {
    "es": "Ella tiene una perspectiva optimista de la vida.",
    "en": "She has a rosy outlook on life."
  },
  {
    "es": "Él estaba completamente absorto en su trabajo.",
    "en": "He was utterly engrossed in his work."
  },
  {
    "es": "Se está llevando a cabo una campaña nacional para promover la concienciación sobre la salud mental.",
    "en": "A nationwide campaign is being run to promote mental health awareness."
  },
  {
    "es": "Si no hubieras señalado el error, no me habría dado cuenta.",
    "en": "If you hadn't pointed out the mistake, I wouldn't have noticed it."
  },
  {
    "es": "Ella tiene un compromiso inquebrantable con sus principios.",
    "en": "She has an unwavering commitment to her principles."
  },
  {
    "es": "Él es un firme partidario de la energía renovable.",
    "en": "He is a strong proponent of renewable energy."
  },
  {
    "es": "Las negociaciones llegaron a un punto muerto sobre la cuestión del salario.",
    "en": "The negotiations reached an impasse over the issue of salary."
  },
  {
    "es": "Si yo fuera el encargado, las cosas se harían de manera diferente.",
    "en": "If I were in charge, things would be done differently."
  },
  {
    "es": "Ojalá tuviera el coraje de decir lo que realmente pienso.",
    "en": "I wish I had the courage to say what I really think."
  },
  {
    "es": "Él fue elogiado por su excepcional servicio al cliente.",
    "en": "He was commended for his exceptional customer service."
  },
  {
    "es": "Se están redactando nuevas leyes para proteger el medio ambiente.",
    "en": "New laws are being drafted to protect the environment."
  },
  {
    "es": "Si hubiera sabido que la carretera estaba cerrada, habría tomado otra ruta.",
    "en": "If I had known the road was closed, I would have taken another route."
  },
  {
    "es": "Ella tiene una comprensión intuitiva de las necesidades de las personas.",
    "en": "She has an intuitive grasp of people's needs."
  },
  {
    "es": "Él está bajo la falsa creencia de que es invencible.",
    "en": "He is under the deluded belief that he is invincible."
  },
  {
    "es": "Se está llevando a cabo una evaluación exhaustiva del impacto del proyecto.",
    "en": "A comprehensive assessment of the project's impact is being carried out."
  },
  {
    "es": "Si no fuera por su generosa donación, el hospital no podría haberse construido.",
    "en": "But for his generous donation, the hospital could not have been built."
  },
  {
    "es": "Ella tiene una visión muy clara de lo que quiere lograr.",
    "en": "She has a crystal-clear vision of what she wants to achieve."
  },
  {
    "es": "Él estaba visiblemente aliviado por la noticia.",
    "en": "He was visibly relieved at the news."
  },
  {
    "es": "Se está haciendo un esfuerzo global para combatir el cambio climático.",
    "en": "A global effort is being made to combat climate change."
  },
  {
    "es": "Si no hubieras estado allí para guiarme, me habría perdido.",
    "en": "If you hadn't been there to guide me, I would have been lost."
  },
  {
    "es": "Ella tiene una habilidad asombrosa para simplificar problemas complejos.",
    "en": "She has an uncanny ability to simplify complex problems."
  },
  {
    "es": "Él es un crítico abierto de las políticas del gobierno.",
    "en": "He is an outspoken critic of the government's policies."
  },
  {
    "es": "Se ha llegado a un acuerdo unánime para proceder.",
    "en": "A unanimous agreement has been reached to move forward."
  },
  {
    "es": "Si tuviera la oportunidad de conocer a alguien, vivo o muerto, sería a Einstein.",
    "en": "If I had the chance to meet anyone, living or dead, it would be Einstein."
  },
  {
    "es": "Ojalá la gente fuera más considerada con los sentimientos de los demás.",
    "en": "I wish people were more considerate of each other's feelings."
  },
  {
    "es": "Él fue absuelto por un jurado de sus pares.",
    "en": "He was acquitted by a jury of his peers."
  },
  {
    "es": "Se están estableciendo directrices para garantizar la coherencia.",
    "en": "Guidelines are being established to ensure consistency."
  },
  {
    "es": "Si hubiera sabido que iba a llover, habría traído un paraguas.",
    "en": "If I had known it was going to rain, I would have brought an umbrella."
  },
  {
    "es": "Ella tiene una fe inquebrantable en la bondad de la humanidad.",
    "en": "She has an unshakeable faith in the goodness of humanity."
  },
  {
    "es": "Él está bajo la obligación moral de decir la verdad.",
    "en": "He is under a moral obligation to tell the truth."
  },
  {
    "es": "Se está realizando un estudio de viabilidad para el nuevo proyecto.",
    "en": "A feasibility study is being conducted for the new project."
  },
  {
    "es": "Si no fuera por su intervención, la situación podría haber empeorado.",
    "en": "Were it not for his intervention, the situation could have escalated."
  },
  {
    "es": "Ella tiene una perspectiva refrescante sobre los viejos problemas.",
    "en": "She has a refreshing perspective on old problems."
  },
  {
    "es": "Él estaba completamente ajeno a las tensiones en la sala.",
    "en": "He was blissfully unaware of the tensions in the room."
  },
  {
    "es": "Se está librando una batalla legal sobre la propiedad de la tierra.",
    "en": "A legal battle is being fought over the ownership of the land."
  },
  {
    "es": "Si no hubieras sido tan descuidado, no habrías perdido tu teléfono.",
    "en": "If you hadn't been so careless, you wouldn't have lost your phone."
  },
  {
    "es": "Ella tiene una dedicación inigualable a su trabajo.",
    "en": "She has an unparalleled dedication to her craft."
  },
  {
    "es": "Él es un firme defensor de la libertad de expresión.",
    "en": "He is a staunch defender of free speech."
  },
  {
    "es": "La decisión fue recibida con una mezcla de sorpresa y decepción.",
    "en": "The decision was met with a mixture of surprise and disappointment."
  },
  {
    "es": "Si pudiera tener un superpoder, sería la capacidad de volar.",
    "en": "If I could have one superpower, it would be the ability to fly."
  },
  {
    "es": "Ojalá el fin de semana tuviera un día extra.",
    "en": "I wish the weekend had an extra day."
  },
  {
    "es": "Él fue exonerado después de que surgieran nuevas pruebas.",
    "en": "He was exonerated after new evidence came to light."
  },
  {
    "es": "Se están desarrollando nuevos métodos para detectar la enfermedad en una etapa temprana.",
    "en": "New methods are being developed to detect the disease at an early stage."
  },
  {
    "es": "Si hubiera sabido que el vuelo se cancelaría, no habría ido al aeropuerto.",
    "en": "If I had known the flight would be cancelled, I wouldn't have gone to the airport."
  },
  {
    "es": "Ella tiene una comprensión profunda de los principios científicos.",
    "en": "She has a profound grasp of scientific principles."
  },
  {
    "es": "Él está bajo la ilusión de que puede salirse con la suya en todo.",
    "en": "He is under the illusion that he can get away with anything."
  },
  {
    "es": "Se está llevando a cabo una investigación sobre las causas del colapso financiero.",
    "en": "An inquiry into the causes of the financial crash is underway."
  },
  {
    "es": "Si no fuera por el apoyo de mi familia, no estaría donde estoy hoy.",
    "en": "If it weren't for my family's support, I wouldn't be where I am today."
  },
  {
    "es": "Ella tiene una visión pragmática para la resolución de problemas.",
    "en": "She has a pragmatic approach to problem-solving."
  },
  {
    "es": "Él estaba visiblemente afectado por la crítica.",
    "en": "He was visibly affected by the criticism."
  },
  {
    "es": "Se está haciendo un esfuerzo coordinado entre varias agencias.",
    "en": "A coordinated effort is being made between various agencies."
  },
  {
    "es": "Si no hubieras llegado justo a tiempo, habríamos perdido el tren.",
    "en": "If you hadn't arrived in the nick of time, we would have missed the train."
  },
  {
    "es": "Ella tiene una capacidad notable para la multitarea.",
    "en": "She has a remarkable capacity for multitasking."
  },
  {
    "es": "Él es un partidario de toda la vida del equipo local.",
    "en": "He is a lifelong supporter of the local team."
  },
  {
    "es": "Las negociaciones se rompieron sin que se llegara a un acuerdo.",
    "en": "The negotiations broke down without an agreement being reached."
  },
  {
    "es": "Si pudiera volver a mi adolescencia, me preocuparía menos por lo que piensan los demás.",
    "en": "If I could go back to my teenage years, I would worry less about what others think."
  },
  {
    "es": "Ojalá el mundo fuera un lugar más pacífico.",
    "en": "I wish the world were a more peaceful place."
  },
  {
    "es": "Él fue aclamado como un héroe por sus acciones.",
    "en": "He was hailed as a hero for his actions."
  },
  {
    "es": "Se está construyendo una nueva red de transporte para conectar la región.",
    "en": "A new transport network is being constructed to connect the region."
  },
  {
    "es": "Si hubiera sabido que eras alérgico a los frutos secos, no los habría usado.",
    "en": "If I had known you were allergic to nuts, I wouldn't have used them."
  },
  {
    "es": "Ella tiene un conocimiento exhaustivo de la legislación fiscal.",
    "en": "She has a comprehensive knowledge of tax law."
  },
  {
    "es": "Él está bajo una presión considerable para mejorar su rendimiento.",
    "en": "He is under considerable pressure to improve his performance."
  },
  {
    "es": "Se está llevando a cabo una campaña para concienciar sobre el problema.",
    "en": "A campaign is being launched to raise awareness of the issue."
  },
  {
    "es": "Si no fuera por el GPS, me perdería todo el tiempo.",
    "en": "Were it not for GPS, I would get lost all the time."
  },
  {
    "es": "Ella tiene una perspectiva filosófica sobre los altibajos de la vida.",
    "en": "She has a philosophical outlook on life's ups and downs."
  },
  {
    "es": "Él estaba completamente desconcertado por su extraño comportamiento.",
    "en": "He was completely bewildered by her strange behavior."
  },
  {
    "es": "Se está haciendo un esfuerzo sostenido para mejorar la educación.",
    "en": "A sustained effort is being made to improve education."
  },
  {
    "es": "Si no hubieras sido tan paciente, me habría rendido.",
    "en": "If you hadn't been so patient, I would have given up."
  },
  {
    "es": "Ella tiene una pasión contagiosa por su trabajo.",
    "en": "She has an infectious passion for her work."
  },
  {
    "es": "Él es un oponente vocal de la pena de muerte.",
    "en": "He is a vocal opponent of the death penalty."
  },
  {
    "es": "Se ha llegado a un punto de inflexión en la crisis.",
    "en": "A turning point has been reached in the crisis."
  },
  {
    "es": "Si pudiera vivir en cualquier época, elegiría los locos años veinte.",
    "en": "If I could live in any era, I would choose the Roaring Twenties."
  },
  {
    "es": "Ojalá los políticos fueran más honestos.",
    "en": "I wish politicians were more honest."
  },
  {
    "es": "Él fue elogiado por su integridad y profesionalismo.",
    "en": "He was praised for his integrity and professionalism."
  },
  {
    "es": "Se están diseñando nuevos programas de software para satisfacer la creciente demanda.",
    "en": "New software programs are being designed to meet the growing demand."
  },
  {
    "es": "Si hubiera sabido que el restaurante era tan popular, habría reservado una mesa.",
    "en": "If I had known the restaurant was so popular, I would have booked a table."
  },
  {
    "es": "Ella tiene una comprensión sólida de los principios económicos.",
    "en": "She has a firm grasp of economic principles."
  },
  {
    "es": "Él está bajo la impresión de que su contribución no fue valorada.",
    "en": "He is under the impression that his contribution was not valued."
  },
  {
    "es": "Se está realizando una encuesta para medir la opinión pública.",
    "en": "A survey is being conducted to gauge public opinion."
  },
  {
    "es": "Si no fuera por su sentido del humor, la situación habría sido insoportable.",
    "en": "But for his sense of humor, the situation would have been unbearable."
  },
  {
    "es": "Ella tiene una actitud sensata hacia el dinero.",
    "en": "She has a no-nonsense attitude towards money."
  },
  {
    "es": "Él estaba visiblemente decepcionado por no ser seleccionado.",
    "en": "He was visibly disappointed at not being selected."
  },
  {
    "es": "Se está haciendo un esfuerzo conjunto para limpiar el río.",
    "en": "A joint effort is being made to clean up the river."
  },
  {
    "es": "Si no hubieras olvidado el mapa, no estaríamos perdidos ahora.",
    "en": "If you hadn't forgotten the map, we wouldn't be lost now."
  },
  {
    "es": "Ella tiene una capacidad asombrosa para mantenerse calmada bajo presión.",
    "en": "She has an uncanny knack for staying calm under pressure."
  },
  {
    "es": "Él es un defensor de los métodos de enseñanza tradicionales.",
    "en": "He is a proponent of traditional teaching methods."
  },
  {
    "es": "El acuerdo fue el resultado de meses de negociaciones.",
    "en": "The agreement was the culmination of months of negotiations."
  },
  {
    "es": "Si pudiera elegir cualquier trabajo en el mundo, sería astronauta.",
    "en": "If I could choose any job in the world, I would be an astronaut."
  },
  {
    "es": "Ojalá pudiera pasar más tiempo leyendo.",
    "en": "I wish I could spend more time reading."
  },
  {
    "es": "Él fue absuelto de los cargos debido a pruebas insuficientes.",
    "en": "He was cleared of the charges due to insufficient evidence."
  },
  {
    "es": "Se están construyendo nuevas viviendas para hacer frente a la escasez.",
    "en": "New homes are being built to address the housing shortage."
  },
  {
    "es": "Si hubiera sabido que estabas buscando trabajo, te habría avisado.",
    "en": "If I had known you were looking for a job, I would have let you know."
  },
  {
    "es": "Ella tiene una comprensión excepcional de las matemáticas complejas.",
    "en": "She has an exceptional grasp of complex mathematics."
  },
  {
    "es": "Él está bajo la impresión de que todo el mundo admira.",
    "en": "He is under the impression that he is admired by everyone."
  },
  {
    "es": "Se está llevando a cabo una investigación sobre la seguridad de los alimentos.",
    "en": "A probe into food safety is being carried out."
  },
  {
    "es": "Si no fuera por tu aliento, me habría rendido hace mucho tiempo.",
    "en": "If it weren't for your encouragement, I would have given up long ago."
  },
  {
    "es": "Ella tiene un enfoque metódico para su trabajo.",
    "en": "She has a methodical approach to her work."
  },
  {
    "es": "Él estaba completamente inconsciente del efecto que sus palabras estaban teniendo.",
    "en": "He was completely oblivious to the effect his words were having."
  },
  {
    "es": "Se está llevando a cabo una campaña publicitaria masiva para el nuevo producto.",
    "en": "A massive advertising campaign is being rolled out for the new product."
  },
  {
    "es": "Si no hubieras dejado la puerta abierta, el gato no se habría escapado.",
    "en": "If you hadn't left the door open, the cat wouldn't have escaped."
  },
  {
    "es": "Ella tiene un celo contagioso por la vida.",
    "en": "She has an infectious zeal for life."
  },
  {
    "es": "Él es un firme creyente en la segunda oportunidad.",
    "en": "He is a firm believer in second chances."
  },
  {
    "es": "El proyecto fue archivado debido a restricciones presupuestarias.",
    "en": "The project was shelved due to budget constraints."
  },
  {
    "es": "Si pudiera cambiar una cosa de mí mismo, sería mi tendencia a procrastinar.",
    "en": "If I could change one thing about myself, it would be my tendency to procrastinate."
  },
  {
    "es": "Ojalá todos pudieran llevarse bien.",
    "en": "I wish everyone could just get along."
  },
  {
    "es": "Él fue exonerado de toda responsabilidad en el asunto.",
    "en": "He was exonerated from all responsibility in the matter."
  },
  {
    "es": "Se están desarrollando nuevas vacunas para combatir enfermedades emergentes.",
    "en": "New vaccines are being developed to fight emerging diseases."
  },
  {
    "es": "Si hubiera sabido que la película era tan larga, habría ido al baño antes.",
    "en": "If I had known the movie was so long, I would have gone to the restroom beforehand."
  },
  {
    "es": "Ella tiene una apreciación genuina por las bellas artes.",
    "en": "She has a genuine appreciation for the fine arts."
  },
  {
    "es": "Él está bajo la impresión de que es el único que trabaja duro.",
    "en": "He is under the impression that he is the only one who works hard."
  },
  {
    "es": "Se está realizando una auditoría completa de las finanzas de la empresa.",
    "en": "A full audit of the company's finances is being undertaken."
  },
  {
    "es": "Si no fuera por la invención de la imprenta, el conocimiento no se habría extendido tan rápidamente.",
    "en": "Were it not for the invention of the printing press, knowledge would not have spread so quickly."
  },
  {
    "es": "Ella tiene una actitud positiva que es verdaderamente inspiradora.",
    "en": "She has a positive attitude that is truly inspiring."
  },
  {
    "es": "Él estaba visiblemente molesto por la decisión.",
    "en": "He was visibly annoyed by the decision."
  },
  {
    "es": "Se está haciendo un esfuerzo mundial para erradicar la enfermedad.",
    "en": "A worldwide effort is being made to eradicate the disease."
  },
  {
    "es": "Si no hubieras estado allí para apoyarme, no sé cómo lo habría superado.",
    "en": "If you hadn't been there to support me, I don't know how I would have gotten through it."
  },
  {
    "es": "Ella tiene una habilidad increíble para recordar datos.",
    "en": "She has an uncanny ability to recall facts."
  },
  {
    "es": "Él es un oponente acérrimo de cualquier forma de censura.",
    "en": "He is a staunch opponent of any form of censorship."
  },
  {
    "es": "Se llegó a un consenso después de horas de debate.",
    "en": "A consensus was reached after hours of debate."
  },
  {
    "es": "Si pudiera tener una cena con tres personas, elegiría a mis abuelos y a mi mejor amigo.",
    "en": "If I could have a dinner party with three people, I would choose my grandparents and my best friend."
  },
  {
    "es": "Ojalá el transporte público fuera más fiable.",
    "en": "I wish public transport were more reliable."
  },
  {
    "es": "Él fue aclamado por la crítica por su interpretación debut.",
    "en": "He was critically acclaimed for his debut performance."
  },
  {
    "es": "Se están construyendo nuevas infraestructuras para apoyar el crecimiento económico.",
    "en": "New infrastructure is being built to support economic growth."
  },
  {
    "es": "Si hubiera sabido que te ibas, te habría preparado un regalo de despedida.",
    "en": "If I had known you were leaving, I would have prepared a farewell gift."
  }
]