{
  "phrases":[
  {
    "es": "Apenas había llegado cuando sonó el teléfono.",
    "en": "Scarcely had I arrived when the phone rang."
  },
  {
    "es": "Bajo ninguna circunstancia debes tocar ese botón.",
    "en": "Under no circumstances should you touch that button."
  },
  {
    "es": "Si no hubiera perdido mi trabajo, ahora viviría en Londres.",
    "en": "If I hadn't lost my job, I would be living in London now."
  },
  {
    "es": "Habiendo terminado su trabajo, se fue a casa temprano.",
    "en": "Having finished his work, he went home early."
  },
  {
    "es": "Fue la falta de preparación lo que causó el fracaso del proyecto.",
    "en": "It was the lack of preparation that caused the project to fail."
  },
  {
    "es": "No solo es inteligente, sino que también es increíblemente trabajador.",
    "en": "Not only is he intelligent, but he is also incredibly hard-working."
  },
  {
    "es": "Me vi obligado a hacer de tripas corazón y continuar.",
    "en": "I had to bite the bullet and carry on."
  },
  {
    "es": "Se dice que el antiguo propietario ronda la mansión.",
    "en": "The former owner is said to haunt the mansion."
  },
  {
    "es": "Necesito reflexionar sobre tu propuesta antes de dar una respuesta.",
    "en": "I need to mull over your proposal before giving an answer."
  },
  {
    "es": "La seguridad de los empleados es de suma importancia.",
    "en": "The safety of the employees is of paramount importance."
  },
  {
    "es": "Por muy difícil que parezca, no debemos rendirnos.",
    "en": "However difficult it may seem, we must not give up."
  },
  {
    "es": "Lo que realmente me molesta es su total falta de respeto.",
    "en": "What really bothers me is his utter lack of respect."
  },
  {
    "es": "Insisto en que se tomen medidas de inmediato.",
    "en": "I insist that measures be taken immediately."
  },
  {
    "es": "Si hubieras de cambiar algo, ¿qué sería?",
    "en": "Were you to change anything, what would it be?"
  },
  {
    "es": "El informe arrojó algo de luz sobre la compleja situación.",
    "en": "The report shed some light on the complex situation."
  },
  {
    "es": "Sus comentarios fueron totalmente irrelevantes para la discusión.",
    "en": "His comments were completely irrelevant to the discussion."
  },
  {
    "es": "Estaba a punto de irme cuando llegaste.",
    "en": "I was on the verge of leaving when you arrived."
  },
  {
    "es": "Necesitamos resolver los detalles antes de la reunión.",
    "en": "We need to iron out the details before the meeting."
  },
  {
    "es": "A pesar de las adversidades, ella perseveró.",
    "en": "Notwithstanding the setbacks, she persevered."
  },
  {
    "es": "Tómate sus promesas con pinzas; tiende a exagerar.",
    "en": "Take his promises with a pinch of salt; he tends to exaggerate."
  },
  {
    "es": "La película fue buena, aunque no estuvo a la altura de las expectativas.",
    "en": "The film was good, albeit it didn't live up to the hype."
  },
  {
    "es": "Pocas veces he visto una actuación tan impresionante.",
    "en": "Seldom have I seen such a breathtaking performance."
  },
  {
    "es": "Le resultó difícil asimilar la repentina noticia.",
    "en": "He found it hard to come to terms with the sudden news."
  },
  {
    "es": "La nueva política tendrá consecuencias de gran alcance.",
    "en": "The new policy will have far-reaching consequences."
  },
  {
    "es": "Al parecer, la empresa está al borde de la quiebra.",
    "en": "The company is allegedly on the brink of bankruptcy."
  },
  {
    "es": "De no ser por tu ayuda, no habría terminado a tiempo.",
    "en": "Had it not been for your help, I wouldn't have finished on time."
  },
  {
    "es": "Es un experto en la materia, así que valoro su opinión.",
    "en": "He's a subject-matter expert, so I value his input."
  },
  {
    "es": "El quid de la cuestión es si podemos permitírnoslo.",
    "en": "The crux of the matter is whether we can afford it."
  },
  {
    "es": "Si vas a llegar tarde, por lo menos házmelo saber.",
    "en": "Should you be running late, at least let me know."
  },
  {
    "es": "Debido a circunstancias atenuantes, se le dio una segunda oportunidad.",
    "en": "Due to extenuating circumstances, he was given a second chance."
  },
  {
    "es": "El acuerdo fue, a todos los efectos, un fracaso.",
    "en": "The agreement was, for all intents and purposes, a failure."
  },
  {
    "es": "Hay una delgada línea entre la genialidad y la locura.",
    "en": "There's a fine line between genius and madness."
  },
  {
    "es": "La decisión de mudarse al extranjero no debe tomarse a la ligera.",
    "en": "The decision to move abroad is not one to be taken lightly."
  },
  {
    "es": "Ella se desvive por ayudar a los demás.",
    "en": "She goes out of her way to help others."
  },
  {
    "es": "En retrospectiva, debería haber aceptado la oferta.",
    "en": "In hindsight, I should have accepted the offer."
  },
  {
    "es": "La contaminación del aire tiene un efecto perjudicial para nuestra salud.",
    "en": "Air pollution has a detrimental effect on our health."
  },
  {
    "es": "Logró el éxito contra todo pronóstico.",
    "en": "He achieved success against all odds."
  },
  {
    "es": "En cuanto oí las noticias, te llamé.",
    "en": "No sooner had I heard the news than I called you."
  },
  {
    "es": "Necesito repasar mi francés antes de mi viaje a París.",
    "en": "I need to brush up on my French before my trip to Paris."
  },
  {
    "es": "Sus esfuerzos culminaron en un descubrimiento innovador.",
    "en": "Their efforts culminated in a groundbreaking discovery."
  },
  {
    "es": "La evidencia circunstancial apunta a su culpabilidad.",
    "en": "The circumstantial evidence points towards his guilt."
  },
  {
    "es": "Él está increíblemente bien versado en historia antigua.",
    "en": "He is incredibly well-versed in ancient history."
  },
  {
    "es": "Esa idea es, en el mejor de los casos, optimista y, en el peor, ingenua.",
    "en": "That idea is optimistic at best, and naive at worst."
  },
  {
    "es": "Se pensaba que la tarea era imposible, pero la completaron.",
    "en": "The task was thought to be impossible, yet they completed it."
  },
  {
    "es": "Me opongo rotundamente a cualquier cambio en el plan.",
    "en": "I am adamantly opposed to any changes to the plan."
  },
  {
    "es": "Independientemente de lo que decidas, te apoyaré.",
    "en": "Regardless of what you decide, I will support you."
  },
  {
    "es": "La empresa está tratando de sacar provecho de la nueva tendencia.",
    "en": "The company is trying to cash in on the new trend."
  },
  {
    "es": "Los dos países están al borde de la guerra.",
    "en": "The two countries are teetering on the brink of war."
  },
  {
    "es": "A falta de pruebas, el caso fue desestimado.",
    "en": "In the absence of evidence, the case was dismissed."
  },
  {
    "es": "Su comportamiento errático dio lugar a especulaciones.",
    "en": "His erratic behavior gave rise to speculation."
  },
  {
    "es": "Su futuro profesional pende de un hilo.",
    "en": "His career prospects are hanging by a thread."
  },
  {
    "es": "Lejos de ser un problema, es en realidad una oportunidad.",
    "en": "Far from being a problem, it's actually an opportunity."
  },
  {
    "es": "El nuevo sistema está diseñado para agilizar el flujo de trabajo.",
    "en": "The new system is designed to streamline the workflow."
  },
  {
    "es": "Tengo sentimientos encontrados sobre mudarme a una nueva ciudad.",
    "en": "I have mixed feelings about moving to a new city."
  },
  {
    "es": "El director hizo la vista gorda ante el comportamiento del empleado.",
    "en": "The manager turned a blind eye to the employee's behavior."
  },
  {
    "es": "La investigación exhaustiva no arrojó nuevas pistas.",
    "en": "The exhaustive investigation yielded no new clues."
  },
  {
    "es": "La posibilidad de que eso suceda es muy remota.",
    "en": "The likelihood of that happening is very remote."
  },
  {
    "es": "Tendremos que improvisar y ver qué pasa.",
    "en": "We'll have to play it by ear and see what happens."
  },
  {
    "es": "El problema se reduce a una simple falta de comunicación.",
    "en": "The problem boils down to a simple lack of communication."
  },
  {
    "es": "Es imperativo que sigamos los protocolos de seguridad.",
    "en": "It is imperative that we follow the safety protocols."
  },
  {
    "es": "A primera vista, la solución parece sencilla.",
    "en": "On the face of it, the solution seems straightforward."
  },
  {
    "es": "Él es propenso a cometer errores por descuido.",
    "en": "He is prone to making careless mistakes."
  },
  {
    "es": "Habiendo sido advertido, procedió con cautela.",
    "en": "Having been warned, he proceeded with caution."
  },
  {
    "es": "La situación requiere una acción inmediata.",
    "en": "The situation calls for immediate action."
  },
  {
    "es": "Estoy en un dilema sobre si aceptar o no el trabajo.",
    "en": "I'm in a quandary about whether to accept the job or not."
  },
  {
    "es": "A juzgar por las nubes oscuras, parece que va a llover.",
    "en": "Judging by the dark clouds, it looks set to rain."
  },
  {
    "es": "La implementación de la estrategia resultó ser problemática.",
    "en": "The implementation of the strategy proved to be problematic."
  },
  {
    "es": "El éxito de la empresa es un testimonio de su liderazgo.",
    "en": "The company's success is a testament to his leadership."
  },
  {
    "es": "Me temo que tus planes son un poco demasiado ambiciosos.",
    "en": "I'm afraid your plans are somewhat overly ambitious."
  },
  {
    "es": "El artista se inspira en el mundo natural.",
    "en": "The artist draws inspiration from the natural world."
  },
  {
    "es": "Él eludió la pregunta con una respuesta vaga.",
    "en": "He sidestepped the question with a vague answer."
  },
  {
    "es": "El repentino aumento de los precios tomó a todos por sorpresa.",
    "en": "The sudden surge in prices caught everyone off guard."
  },
  {
    "es": "Estaban encantados con el resultado de las negociaciones.",
    "en": "They were overjoyed at the outcome of the negotiations."
  },
  {
    "es": "El proyecto se encuentra actualmente en un punto muerto.",
    "en": "The project is currently at a standstill."
  },
  {
    "es": "La empresa no escatimó en gastos para la fiesta de Navidad.",
    "en": "The company pulled out all the stops for the Christmas party."
  },
  {
    "es": "La comida era mediocre, por no decir otra cosa.",
    "en": "The food was mediocre, to say the least."
  },
  {
    "es": "Apenas podía contener mi emoción.",
    "en": "I could barely contain my excitement."
  },
  {
    "es": "Sus acciones son incompatibles con sus palabras.",
    "en": "His actions are inconsistent with his words."
  },
  {
    "es": "La junta directiva dio luz verde al proyecto.",
    "en": "The board of directors gave the green light to the project."
  },
  {
    "es": "La economía está mostrando signos incipientes de recuperación.",
    "en": "The economy is showing tentative signs of recovery."
  },
  {
    "es": "Por la misma razón, decidí no asistir.",
    "en": "By the same token, I decided not to attend."
  },
  {
    "es": "Su falta de tacto a menudo le mete en problemas.",
    "en": "His lack of tact often gets him into hot water."
  },
  {
    "es": "Vamos a tener que aceptar la derrota y seguir adelante.",
    "en": "We're going to have to bite the dust and move on."
  },
  {
    "es": "El discurso del político no fue más que palabrería.",
    "en": "The politician's speech was nothing but hot air."
  },
  {
    "es": "La propuesta fue rechazada de plano.",
    "en": "The proposal was rejected outright."
  },
  {
    "es": "En pocas palabras, estamos afrontando una crisis.",
    "en": "To put it in a nutshell, we are facing a crisis."
  },
  {
    "es": "Dada la situación, no teníamos otra opción.",
    "en": "Given the circumstances, we had no other option."
  },
  {
    "es": "Su coartada simplemente no cuadra.",
    "en": "His alibi simply doesn't add up."
  },
  {
    "es": "No hay que subestimar la magnitud del desafío.",
    "en": "The scale of the challenge is not to be underestimated."
  },
  {
    "es": "El debate sobre el cambio climático continúa sin cesar.",
    "en": "The debate over climate change rages on unabated."
  },
  {
    "es": "Es hora de que afrontemos la realidad.",
    "en": "It's time we faced up to reality."
  },
  {
    "es": "El nuevo software es muy superior a su predecesor.",
    "en": "The new software is vastly superior to its predecessor."
  },
  {
    "es": "Ella se sintió obligada a intervenir en la discusión.",
    "en": "She felt compelled to intervene in the argument."
  },
  {
    "es": "El futuro de la empresa parece, cuanto menos, incierto.",
    "en": "The company's future looks uncertain, to say the least."
  },
  {
    "es": "A pesar de su edad, tiene una memoria prodigiosa.",
    "en": "Despite his age, he has a prodigious memory."
  },
  {
    "es": "La cuestión sigue siendo un tema de intenso debate.",
    "en": "The issue remains a matter of intense debate."
  },
  {
    "es": "Sus logros son nada menos que extraordinarios.",
    "en": "His achievements are nothing short of remarkable."
  },
  {
    "es": "Se espera que el tratado fomente la cooperación internacional.",
    "en": "The treaty is expected to foster international cooperation."
  },
  {
    "es": "Las repercusiones de la decisión se sentirán durante años.",
    "en": "The repercussions of the decision will be felt for years."
  },
  {
    "es": "Si yo fuera más paciente, no habría cometido ese error.",
    "en": "If I were more patient, I wouldn't have made that mistake."
  },
  {
    "es": "Que yo sepa, la reunión ha sido cancelada.",
    "en": "To the best of my knowledge, the meeting has been called off."
  },
  {
    "es": "Construido para resistir terremotos, el edificio permaneció intacto.",
    "en": "Built to withstand earthquakes, the building remained intact."
  },
  {
    "es": "La empresa tiene la intención de eliminar gradualmente los plásticos de un solo uso.",
    "en": "The company intends to phase out single-use plastics."
  },
  {
    "es": "Pocas personas cuestionarían la veracidad de su declaración.",
    "en": "Few people would question the veracity of his statement."
  },
  {
    "es": "La victoria del equipo fue una conclusión previsible.",
    "en": "The team's victory was a foregone conclusion."
  },
  {
    "es": "Él pasó por alto varios detalles cruciales en el informe.",
    "en": "He glossed over several crucial details in the report."
  },
  {
    "es": "En ninguna parte del documento se menciona la compensación.",
    "en": "Nowhere in the document does it mention compensation."
  },
  {
    "es": "El asunto está actualmente bajo escrutinio.",
    "en": "The matter is currently under scrutiny."
  },
  {
    "es": "Es vital que todos los miembros del personal sean informados de los cambios.",
    "en": "It is vital that all staff members be informed of the changes."
  },
  {
    "es": "El argumento, aunque bien articulado, carecía de pruebas sustanciales.",
    "en": "The argument, while well-articulated, lacked substantial evidence."
  },
  {
    "es": "De no ser por su rápida intervención, la situación se habría descontrolado.",
    "en": "Had it not been for his swift intervention, the situation would have spiraled out of control."
  },
  {
    "es": "Se mostró reacio a divulgar los detalles de la negociación.",
    "en": "He was reluctant to divulge the specifics of the negotiation."
  },
  {
    "es": "Es una creencia errónea común que los rayos nunca caen dos veces en el mismo lugar.",
    "en": "It's a common misconception that lightning never strikes twice."
  },
  {
    "es": "Confundido por las instrucciones, pidió una aclaración.",
    "en": "Baffled by the instructions, he asked for clarification."
  },
  {
    "es": "Su negativa a cooperar solo sirvió para exacerbar el problema.",
    "en": "His refusal to cooperate only served to exacerbate the problem."
  },
  {
    "es": "Se nos acabó el tiempo, así que tuvimos que terminar la discusión.",
    "en": "We ran out of time, so we had to wrap up the discussion."
  },
  {
    "es": "La empresa se está diversificando hacia nuevos mercados.",
    "en": "The company is branching out into new markets."
  },
  {
    "es": "El orador eludió hábilmente las preguntas controvertidas.",
    "en": "The speaker deftly sidestepped the controversial questions."
  },
  {
    "es": "Es probable que las consecuencias de esta decisión sean significativas.",
    "en": "The fallout from this decision is likely to be significant."
  },
  {
    "es": "Su capacidad para soportar las dificultades es admirable.",
    "en": "His resilience in the face of adversity is admirable."
  },
  {
    "es": "Abordemos los problemas subyacentes en lugar de solo los síntomas.",
    "en": "Let's address the underlying issues rather than just the symptoms."
  },
  {
    "es": "Los hallazgos son preliminares y están sujetos a cambios.",
    "en": "The findings are preliminary and subject to change."
  },
  {
    "es": "El nuevo software es compatible con los sistemas existentes.",
    "en": "The new software is compatible with existing systems."
  },
  {
    "es": "Ella se sintió totalmente justificada al presentar una queja.",
    "en": "She felt fully justified in making a complaint."
  },
  {
    "es": "Rara vez la empresa se había enfrentado a un desafío de esta magnitud.",
    "en": "Rarely had the company faced a challenge of this magnitude."
  },
  {
    "es": "Lo que necesitamos es un enfoque nuevo, no las mismas viejas ideas.",
    "en": "What we need is a fresh approach, not the same old ideas."
  },
  {
    "es": "Si él fuera más diplomático, no ofendería a tanta gente.",
    "en": "If he were more diplomatic, he wouldn't offend so many people."
  },
  {
    "es": "Se supone que la nueva ley disuadirá a los posibles delincuentes.",
    "en": "The new law is supposed to deter potential offenders."
  },
  {
    "es": "Abatido por el fracaso, consideró abandonar.",
    "en": "Crestfallen by the failure, he considered giving up."
  },
  {
    "es": "El éxito de la campaña dependerá de una planificación meticulosa.",
    "en": "The success of the campaign will hinge on meticulous planning."
  },
  {
    "es": "Necesitamos idear una estrategia para superar a nuestros competidores.",
    "en": "We need to devise a strategy to outperform our competitors."
  },
  {
    "es": "El proyecto se completó a tiempo y dentro del presupuesto, a pesar de los contratiempos iniciales.",
    "en": "The project was completed on time and within budget, notwithstanding the initial setbacks."
  },
  {
    "es": "A la luz de la nueva evidencia, el caso fue reabierto.",
    "en": "In light of the new evidence, the case was reopened."
  },
  {
    "es": "Se cree que las ruinas datan del Imperio Romano.",
    "en": "The ruins are believed to date back to the Roman Empire."
  },
  {
    "es": "No tuvo más remedio que aceptar las condiciones.",
    "en": "He had no alternative but to acquiesce to the conditions."
  },
  {
    "es": "Si vas a criticar, al menos ofrece una solución constructiva.",
    "en": "Should you choose to criticize, at least offer a constructive solution."
  },
  {
    "es": "Habiendo sopesado los pros y los contras, decidió declinar la oferta.",
    "en": "Having weighed up the pros and cons, she decided to decline the offer."
  },
  {
    "es": "El repentino cambio de política tomó a todos con la guardia baja.",
    "en": "The sudden policy shift caught everyone off guard."
  },
  {
    "es": "No hasta que terminó el discurso se dio cuenta de su error.",
    "en": "Not until the speech was over did he realize his mistake."
  },
  {
    "es": "La empresa atribuye su éxito a su fuerza laboral dedicada.",
    "en": "The company attributes its success to its dedicated workforce."
  },
  {
    "es": "Su falta de entusiasmo por el proyecto era palpable.",
    "en": "His lack of enthusiasm for the project was palpable."
  },
  {
    "es": "Estaba en ascuas esperando los resultados.",
    "en": "I was on tenterhooks waiting for the results."
  },
  {
    "es": "El gobierno implementó medidas de austeridad para reducir la deuda.",
    "en": "The government implemented austerity measures to curtail the debt."
  },
  {
    "es": "Su ascenso en la empresa fue nada menos que meteórico.",
    "en": "His rise through the company was nothing short of meteoric."
  },
  {
    "es": "Si hubiera anticipado las consecuencias, habría actuado de manera diferente.",
    "en": "If I had anticipated the consequences, I would have acted differently."
  },
  {
    "es": "Las dos teorías no son mutuamente excluyentes.",
    "en": "The two theories are not mutually exclusive."
  },
  {
    "es": "El tema en cuestión es complejo y polifacético.",
    "en": "The issue at hand is both complex and multifaceted."
  },
  {
    "es": "No hay una solución única para este problema.",
    "en": "There is no one-size-fits-all solution to this problem."
  },
  {
    "es": "Ella se distanció de las controvertidas declaraciones.",
    "en": "She distanced herself from the controversial remarks."
  },
  {
    "es": "Sometido a una intensa presión, finalmente confesó.",
    "en": "Subjected to intense pressure, he eventually confessed."
  },
  {
    "es": "Por muy elocuente que sea, sus argumentos carecen de profundidad.",
    "en": "Eloquent though he may be, his arguments lack depth."
  },
  {
    "es": "A partir de ahora, todos los informes deben ser presentados en formato digital.",
    "en": "Henceforth, all reports must be submitted in digital format."
  },
  {
    "es": "Deberíamos tratar de emular sus mejores cualidades.",
    "en": "We should try to emulate his best qualities."
  },
  {
    "es": "La tarea, aunque aparentemente sencilla, resultó ser engañosamente difícil.",
    "en": "The task, while seemingly straightforward, proved to be deceptively difficult."
  },
  {
    "es": "De no ser por la crisis financiera, la empresa ahora estaría prosperando.",
    "en": "Had it not been for the financial crisis, the company would be thriving now."
  },
  {
    "es": "Es imperativo que actuemos antes de que la situación se deteriore aún más.",
    "en": "It is imperative that we act before the situation deteriorates further."
  },
  {
    "es": "El nuevo gerente está ansioso por dejar su huella en el departamento.",
    "en": "The new manager is eager to make his mark on the department."
  },
  {
    "es": "Se informó que las negociaciones habían llegado a un punto muerto.",
    "en": "The negotiations were reported to have reached a stalemate."
  },
  {
    "es": "El libro ofrece una visión fascinante de una cultura olvidada.",
    "en": "The book provides a fascinating insight into a forgotten culture."
  },
  {
    "es": "No fue tanto lo que dijo como la forma en que lo dijo.",
    "en": "It wasn't so much what he said as the way he said it."
  },
  {
    "es": "Abrumado por la emoción, se quedó sin palabras.",
    "en": "Overcome with emotion, he was rendered speechless."
  },
  {
    "es": "La posibilidad de que tal evento ocurra es infinitesimal.",
    "en": "The probability of such an event occurring is infinitesimal."
  },
  {
    "es": "El equipo tuvo que improvisar después de que su equipo principal fallara.",
    "en": "The team had to improvise after their primary equipment failed."
  },
  {
    "es": "Sus intentos de apaciguar a los críticos fueron inútiles.",
    "en": "His attempts to appease the critics were futile."
  },
  {
    "es": "En retrospectiva, la decisión fue claramente un error.",
    "en": "With the benefit of hindsight, the decision was clearly a mistake."
  },
  {
    "es": "Los dos hermanos no podrían ser más diferentes; son como el día y la noche.",
    "en": "The two brothers couldn't be more different; they are like chalk and cheese."
  },
  {
    "es": "Poco sabía él que su vida estaba a punto de cambiar para siempre.",
    "en": "Little did he know that his life was about to change forever."
  },
  {
    "es": "La investigación estaba plagada de inconsistencias.",
    "en": "The investigation was fraught with inconsistencies."
  },
  {
    "es": "Si fueras a empezar de nuevo, ¿harías algo diferente?",
    "en": "Were you to start over, would you do anything differently?"
  },
  {
    "es": "La empresa está tratando de recuperar su reputación empañada.",
    "en": "The company is trying to salvage its tarnished reputation."
  },
  {
    "es": "Es esencial que el equipo reciba el entrenamiento adecuado.",
    "en": "It is essential that the team be given the proper training."
  },
  {
    "es": "A pesar de la abrumadora evidencia, él mantuvo su inocencia.",
    "en": "Despite the overwhelming evidence, he maintained his innocence."
  },
  {
    "es": "Habiendo agotado todas las demás posibilidades, recurrieron a una medida desesperada.",
    "en": "Having exhausted all other possibilities, they resorted to a desperate measure."
  },
  {
    "es": "No es de extrañar que el negocio fracasara, dada su mala gestión.",
    "en": "It's no wonder the business failed, given its poor management."
  },
  {
    "es": "Si ella no fuera tan testaruda, podría admitir que está equivocada.",
    "en": "If she weren't so headstrong, she might admit she's wrong."
  },
  {
    "es": "Lo que encuentro más desconcertante es su total falta de remordimiento.",
    "en": "What I find most baffling is his complete lack of remorse."
  },
  {
    "es": "Rara vez un solo evento ha tenido un impacto tan profundo.",
    "en": "Seldom has a single event had such a profound impact."
  },
  {
    "es": "Sus logros son un testimonio de su arduo trabajo y dedicación.",
    "en": "Her achievements are a testament to her hard work and dedication."
  },
  {
    "es": "La nueva política está destinada a frenar la evasión fiscal.",
    "en": "The new policy is intended to curb tax evasion."
  },
  {
    "es": "La empresa se vio obligada a reducir su personal para seguir siendo solvente.",
    "en": "The company was forced to downsize its workforce to remain solvent."
  },
  {
    "es": "Si no fuera por su pensamiento rápido, el accidente podría haber sido mucho peor.",
    "en": "If it weren't for his quick thinking, the accident could have been much worse."
  },
  {
    "es": "Dotado de una voz poderosa, cautivó a la audiencia.",
    "en": "Endowed with a powerful voice, he captivated the audience."
  },
  {
    "es": "La decisión del comité fue unánime.",
    "en": "The committee's decision was unanimous."
  },
  {
    "es": "En ningún otro momento de la historia ha habido un cambio tan rápido.",
    "en": "At no other time in history has there been such rapid change."
  },
  {
    "es": "El futuro de la especie pende de un hilo.",
    "en": "The future of the species hangs in the balance."
  },
  {
    "es": "Deberías aprovechar al máximo esta oportunidad única en la vida.",
    "en": "You should make the most of this once-in-a-lifetime opportunity."
  },
  {
    "es": "Si hubieras seguido mi consejo, ahora no estarías en esta situación.",
    "en": "If you had followed my advice, you wouldn't be in this predicament now."
  },
  {
    "es": "Él tiene una asombrosa habilidad para anticipar las tendencias del mercado.",
    "en": "He has an uncanny ability to anticipate market trends."
  },
  {
    "es": "Sea como sea, debemos cumplir con el plazo.",
    "en": "Be that as it may, we must adhere to the deadline."
  },
  {
    "es": "La repentina dimisión del director ejecutivo dejó a la empresa en desorden.",
    "en": "The CEO's abrupt resignation left the company in disarray."
  },
  {
    "es": "Preocupado por la seguridad de su familia, instaló un sistema de alarma.",
    "en": "Concerned for his family's safety, he installed an alarm system."
  },
  {
    "es": "Bajo ninguna circunstancia se debe permitir que esto vuelva a suceder.",
    "en": "On no account should this be allowed to happen again."
  },
  {
    "es": "La nueva legislación tiene como objetivo rectificar las injusticias pasadas.",
    "en": "The new legislation aims to rectify past injustices."
  },
  {
    "es": "Por mucho que lo intente, parece que no puedo entender este concepto.",
    "en": "However hard I try, I can't seem to grasp this concept."
  },
  {
    "es": "Fue su negativa a comprometerse lo que llevó al punto muerto.",
    "en": "It was his refusal to compromise that led to the deadlock."
  },
  {
    "es": "Si hubiera sabido la gravedad de la situación, habría actuado antes.",
    "en": "Had I known the gravity of the situation, I would have acted sooner."
  },
  {
    "es": "Las implicaciones de este descubrimiento son de gran alcance.",
    "en": "The implications of this discovery are far-reaching."
  },
  {
    "es": "Se rumorea que el acuerdo es inminente.",
    "en": "The deal is rumored to be imminent."
  },
  {
    "es": "El autor entrelaza hábilmente múltiples tramas.",
    "en": "The author skillfully interweaves multiple plotlines."
  },
  {
    "es": "Armado solo con su ingenio, sobrevivió en la naturaleza durante semanas.",
    "en": "Armed with only his wits, he survived in the wilderness for weeks."
  },
  {
    "es": "No solo llegó tarde, sino que también olvidó su presentación.",
    "en": "Not only did she arrive late, but she also forgot her presentation."
  },
  {
    "es": "Las acciones de la compañía se desplomaron tras el anuncio.",
    "en": "The company's shares plummeted following the announcement."
  },
  {
    "es": "Le sugiero que reconsidere su decisión.",
    "en": "I suggest that you should reconsider your decision."
  },
  {
    "es": "La película no estuvo a la altura de su aclamada campaña publicitaria.",
    "en": "The movie fell short of its critically-acclaimed hype."
  },
  {
    "es": "Si no fuera por los avances tecnológicos, esta hazaña sería inconcebible.",
    "en": "Were it not for technological advancements, this feat would be inconceivable."
  },
  {
    "es": "La empresa está al borde de un importante avance.",
    "en": "The company is on the cusp of a major breakthrough."
  },
  {
    "es": "El orador cautivó a la audiencia con su retórica apasionada.",
    "en": "The speaker held the audience spellbound with his impassioned rhetoric."
  },
  {
    "es": "Habiendo sido traicionado antes, es comprensiblemente cauteloso.",
    "en": "Having been betrayed before, he is understandably wary."
  },
  {
    "es": "En retrospectiva, fue una decisión equivocada.",
    "en": "In retrospect, it was an ill-conceived decision."
  },
  {
    "es": "El asunto se ha convertido en un tema de considerable controversia.",
    "en": "The issue has become a subject of considerable controversy."
  },
  {
    "es": "Si hubiera previsto la tormenta, habría asegurado los muebles del exterior.",
    "en": "If I had foreseen the storm, I would have secured the outdoor furniture."
  },
  {
    "es": "Poco se imaginaban la aventura que les esperaba.",
    "en": "Little did they anticipate the adventure that lay ahead."
  },
  {
    "es": "Es un hecho lamentable que la desigualdad siga existiendo.",
    "en": "It is a lamentable fact that inequality still persists."
  },
  {
    "es": "A pesar de la aparente simplicidad, el problema es intrincado.",
    "en": "Notwithstanding the apparent simplicity, the problem is intricate."
  },
  {
    "es": "Es crucial que mantengamos un sentido de la perspectiva.",
    "en": "It's crucial that we maintain a sense of perspective."
  },
  {
    "es": "Frente a una elección imposible, eligió el mal menor.",
    "en": "Faced with an impossible choice, he chose the lesser of two evils."
  },
  {
    "es": "Solo después de irse me di cuenta de mi error.",
    "en": "Only after she had left did I realize my mistake."
  },
  {
    "es": "Sus esfuerzos, aunque bien intencionados, fueron en última instancia contraproducentes.",
    "en": "His efforts, though well-intentioned, were ultimately counterproductive."
  },
  {
    "es": "Si él aplicara su inteligencia, podría lograr grandes cosas.",
    "en": "If he were to apply his intelligence, he could achieve great things."
  },
  {
    "es": "La empresa se esfuerza por mantenerse a la vanguardia de la tecnología.",
    "en": "The company strives to stay at the cutting edge of technology."
  },
  {
    "es": "Es precisamente este tipo de pensamiento el que debemos evitar.",
    "en": "It is precisely this kind of thinking that we must avoid."
  },
  {
    "es": "De no haber sido por una casualidad, nunca se habrían conocido.",
    "en": "Had it not been for a chance encounter, they would never have met."
  },
  {
    "es": "El consenso general es que se necesita un cambio.",
    "en": "The general consensus is that a change is needed."
  },
  {
    "es": "Las negociaciones se prolongaron durante días, sin un final a la vista.",
    "en": "The negotiations dragged on for days, with no end in sight."
  },
  {
    "es": "Convencida de su inocencia, su familia luchó incansablemente por su liberación.",
    "en": "Convinced of his innocence, his family fought tirelessly for his release."
  },
  {
    "es": "La propuesta fue rechazada por ser económicamente inviable.",
    "en": "The proposal was dismissed on the grounds of being financially unfeasible."
  },
  {
    "es": "El nuevo descubrimiento podría anunciar una nueva era en la medicina.",
    "en": "The new discovery could herald a new era in medicine."
  },
  {
    "es": "Si el gobierno no hubiera intervenido, la economía se habría colapsado.",
    "en": "If the government hadn't intervened, the economy would have collapsed."
  },
  {
    "es": "Su explicación apenas era plausible, por no decir inventada.",
    "en": "His explanation was barely plausible, let alone fabricated."
  },
  {
    "es": "La reunión fue pospuesta, para gran disgusto de todos.",
    "en": "The meeting was postponed, much to everyone's annoyance."
  },
  {
    "es": "Es recomendable que busques asesoramiento profesional.",
    "en": "It is advisable that you seek professional advice."
  },
  {
    "es": "Perplejo por el enigma, el detective buscó nuevas pistas.",
    "en": "Stumped by the riddle, the detective sought fresh clues."
  },
  {
    "es": "Tan pronto como se enteró de la noticia, partió.",
    "en": "No sooner had he heard the news than he set off."
  },
  {
    "es": "Si fuera una persona menos indulgente, no habría aceptado tus disculpas.",
    "en": "If I were a less forgiving person, I wouldn't have accepted your apology."
  },
  {
    "es": "La evidencia sugiere una conclusión completamente diferente.",
    "en": "The evidence points to an altogether different conclusion."
  },
  {
    "es": "El artista es conocido por su meticulosa atención al detalle.",
    "en": "The artist is renowned for his meticulous attention to detail."
  },
  {
    "es": "En caso de emergencia, rompa el cristal.",
    "en": "Should an emergency arise, break the glass."
  },
  {
    "es": "Su silencio fue interpretado como un reconocimiento de culpabilidad.",
    "en": "His silence was construed as an admission of guilt."
  },
  {
    "es": "La tregua fue precaria y se rompió en cuestión de días.",
    "en": "The truce was a precarious one, and it broke down within days."
  },
  {
    "es": "Exhausto por el largo viaje, se fue directamente a la cama.",
    "en": "Worn out by the long journey, he went straight to bed."
  },
  {
    "es": "Las consecuencias de sus acciones son ahora dolorosamente evidentes.",
    "en": "The ramifications of his actions are now painfully apparent."
  },
  {
    "es": "Bajo ninguna circunstancia se debe comprometer la seguridad.",
    "en": "On no account is safety to be compromised."
  },
  {
    "es": "Si no fuera por su terquedad, sería un líder eficaz.",
    "en": "If it were not for his obstinacy, he would be an effective leader."
  },
  {
    "es": "La empresa tuvo que pagar una multa considerable por incumplimiento.",
    "en": "The company had to pay a hefty fine for non-compliance."
  },
  {
    "es": "Lo que necesitamos es una acción decisiva, no más deliberaciones.",
    "en": "What is needed is decisive action, not further deliberation."
  },
  {
    "es": "Ella se vio obligada a reconsiderar su posición a la luz de los hechos.",
    "en": "She was compelled to reconsider her position in light of the facts."
  },
  {
    "es": "No fue hasta que leí el segundo capítulo que el libro comenzó a tener sentido.",
    "en": "Not until I read the second chapter did the book begin to make sense."
  },
  {
    "es": "De no ser por el chivatazo anónimo, el crimen podría haber quedado sin resolver.",
    "en": "Had it not been for the anonymous tip-off, the crime might have gone unsolved."
  },
  {
    "es": "La introducción de la nueva tecnología ha revolucionado la industria.",
    "en": "The advent of new technology has revolutionized the industry."
  },
  {
    "es": "Si hubiera evaluado los riesgos adecuadamente, el desastre podría haberse evitado.",
    "en": "If he had assessed the risks properly, the disaster could have been averted."
  },
  {
    "es": "La situación es fluida y podría cambiar en cualquier momento.",
    "en": "The situation is fluid and could change at any moment."
  },
  {
    "es": "Él está en una posición precaria, con su trabajo en juego.",
    "en": "He's in a precarious position, with his job on the line."
  },
  {
    "es": "Habiendo fracasado en su primer intento, estaba decidido a tener éxito en el segundo.",
    "en": "Having failed in his first attempt, he was determined to succeed on the second."
  },
  {
    "es": "Rara vez la opinión pública ha estado tan dividida.",
    "en": "Rarely has public opinion been so starkly divided."
  },
  {
    "es": "Las tensiones latentes finalmente salieron a la superficie.",
    "en": "The simmering tensions finally boiled over."
  },
  {
    "es": "Insisto en que se le dé una oportunidad justa para explicarse.",
    "en": "I insist that he be given a fair chance to explain himself."
  },
  {
    "es": "Por muy convincente que fuera su argumento, no logró persuadir al jurado.",
    "en": "Compelling though his argument was, it failed to persuade the jury."
  },
  {
    "es": "El gobierno está bajo una presión cada vez mayor para actuar.",
    "en": "The government is under mounting pressure to act."
  },
  {
    "es": "Si fuera menos impulsivo, tomaría mejores decisiones.",
    "en": "If he were less impulsive, he would make better decisions."
  },
  {
    "es": "Fue su liderazgo lo que guió al equipo hacia la victoria.",
    "en": "It was her leadership that steered the team to victory."
  },
  {
    "es": "El edificio, diseñado por un arquitecto de renombre, es un hito moderno.",
    "en": "The building, designed by a renowned architect, is a modern landmark."
  },
  {
    "es": "Si hubiera habido más tiempo, habríamos explorado otras vías.",
    "en": "Given more time, we would have explored other avenues."
  },
  {
    "es": "Las conversaciones se estancaron por desacuerdos sobre los términos clave.",
    "en": "The talks foundered on disagreements over key terms."
  },
  {
    "es": "Su interpretación de la ley fue, como mínimo, controvertida.",
    "en": "His interpretation of the law was contentious, to say the least."
  },
  {
    "es": "A falta de un candidato mejor, le ofrecieron el puesto.",
    "en": "In the absence of a better candidate, he was offered the position."
  },
  {
    "es": "Se rumorea que el director ejecutivo renunciará inminentemente.",
    "en": "The CEO is rumored to be stepping down imminently."
  },
  {
    "es": "Si yo estuviera en tu lugar, sopesaría mis opciones con mucho cuidado.",
    "en": "Were I in your shoes, I would weigh my options very carefully."
  },
  {
    "es": "Los dos enfoques son fundamentalmente incompatibles.",
    "en": "The two approaches are fundamentally incompatible."
  },
  {
    "es": "Solo con gran dificultad logró terminar la carrera.",
    "en": "Only with great difficulty did he manage to finish the race."
  },
  {
    "es": "El proyecto fue abandonado, citando falta de fondos.",
    "en": "The project was abandoned, citing a lack of funds."
  },
  {
    "es": "El cambio de política tuvo un efecto dominó en toda la economía.",
    "en": "The policy change had a ripple effect throughout the economy."
  },
  {
    "es": "No tengo ninguna duda de que él es el hombre adecuado para el trabajo.",
    "en": "I am in no doubt whatsoever that he is the right man for the job."
  },
  {
    "es": "Si no hubiera sido por el valiente acto de un transeúnte, el niño se habría ahogado.",
    "en": "Had it not been for the brave act of a bystander, the child would have drowned."
  },
  {
    "es": "Él estaba desconcertado por su repentino cambio de humor.",
    "en": "He was bewildered by her sudden change of mood."
  },
  {
    "es": "Su discurso resonó en personas de todos los ámbitos de la vida.",
    "en": "His speech resonated with people from all walks of life."
  },
  {
    "es": "Por muy noble que sea el objetivo, los medios no justifican el fin.",
    "en": "However noble the aim, the means do not justify the end."
  },
  {
    "es": "El equipo se recuperó de una derrota temprana para ganar el campeonato.",
    "en": "The team bounced back from an early defeat to win the championship."
  },
  {
    "es": "Lo que es de suma importancia es la seguridad de los pasajeros.",
    "en": "What is of the utmost importance is the safety of the passengers."
  },
  {
    "es": "Si hubiera sabido del alcance total del problema, no me habría involucrado.",
    "en": "If I had known the full extent of the problem, I wouldn't have gotten involved."
  },
  {
    "es": "Sus palabras, aunque duras, contenían una pizca de verdad.",
    "en": "His words, though harsh, contained a kernel of truth."
  },
  {
    "es": "El informe fue condenatorio en su evaluación de la empresa.",
    "en": "The report was damning in its assessment of the company."
  },
  {
    "es": "Desilusionado con la política, se retiró de la vida pública.",
    "en": "Disillusioned with politics, he retreated from public life."
  },
  {
    "es": "Bajo ninguna circunstancia se puede tolerar tal comportamiento.",
    "en": "Under no circumstances can such behavior be tolerated."
  },
  {
    "es": "La economía está al borde de la recesión.",
    "en": "The economy is teetering on the edge of a recession."
  },
  {
    "es": "Es un punto discutible si la nueva ley será efectiva.",
    "en": "It is a moot point whether the new law will be effective."
  },
  {
    "es": "Habiendo perdido todo, no tenía nada más que perder.",
    "en": "Having lost everything, he had nothing left to lose."
  },
  {
    "es": "Apenas había comenzado el juego cuando empezó a llover a cántaros.",
    "en": "Hardly had the game begun when it started to pour with rain."
  },
  {
    "es": "Si ella no hubiera sido tan diligente, el error podría haber pasado desapercibido.",
    "en": "If she hadn't been so diligent, the mistake might have gone unnoticed."
  },
  {
    "es": "El problema se ve agravado por la falta de recursos.",
    "en": "The problem is compounded by a lack of resources."
  },
  {
    "es": "Es aconsejable que reserves tus vuelos con mucha antelación.",
    "en": "It is advisable that you book your flights well in advance."
  },
  {
    "es": "Impertérrito ante el peligro, el bombero entró en el edificio en llamas.",
    "en": "Undeterred by the danger, the firefighter entered the burning building."
  },
  {
    "es": "Si hubieras de elegir una sola palabra para describirte, ¿cuál sería?",
    "en": "Were you to choose a single word to describe yourself, what would it be?"
  },
  {
    "es": "El descubrimiento fue puramente fortuito; no lo estaban buscando.",
    "en": "The discovery was purely fortuitous; they weren't looking for it."
  },
  {
    "es": "No solo perdió las llaves, sino que también dejó la puerta sin cerrar.",
    "en": "Not only did he lose the keys, but he also left the door unlocked."
  },
  {
    "es": "El plan, en retrospectiva, estaba condenado al fracaso desde el principio.",
    "en": "The plan, in hindsight, was doomed to failure from the outset."
  },
  {
    "es": "La empresa está obligada por contrato a cumplir con sus obligaciones.",
    "en": "The company is contractually bound to fulfill its obligations."
  },
  {
    "es": "Si yo fuera tan rico como él, no sabría qué hacer con el dinero.",
    "en": "If I were as affluent as he is, I wouldn't know what to do with the money."
  },
  {
    "es": "Las pruebas contra él son, en el mejor de los casos, circunstanciales.",
    "en": "The evidence against him is circumstantial at best."
  },
  {
    "es": "Atrapado entre la espada y la pared, tomó la decisión más difícil.",
    "en": "Caught between a rock and a hard place, he made the toughest call."
  },
  {
    "es": "De no ser por el oportuno rescate financiero, la empresa habría quebrado.",
    "en": "Had it not been for the timely bailout, the company would have gone bankrupt."
  },
  {
    "es": "El nuevo sistema, aunque eficiente, tiene una curva de aprendizaje pronunciada.",
    "en": "The new system, albeit efficient, has a steep learning curve."
  },
  {
    "es": "Lo que la empresa necesita urgentemente es un liderazgo fuerte.",
    "en": "What the company is in dire need of is strong leadership."
  },
  {
    "es": "Sometido a un interrogatorio implacable, el sospechoso finalmente se quebró.",
    "en": "Subjected to relentless questioning, the suspect finally broke."
  },
  {
    "es": "Pocas veces un libro me ha conmovido tan profundamente.",
    "en": "Seldom has a book moved me so profoundly."
  },
  {
    "es": "Es imperativo que abordemos las causas fundamentales del problema.",
    "en": "It is imperative that we address the root causes of the problem."
  },
  {
    "es": "Su negativa a ceder ha puesto en peligro todo el acuerdo.",
    "en": "His refusal to compromise has jeopardized the entire deal."
  },
  {
    "es": "Si hubiera sabido entonces lo que sé ahora, habría elegido un camino diferente.",
    "en": "If I had known then what I know now, I would have chosen a different path."
  },
  {
    "es": "La ciudad, que alguna vez fue un centro industrial próspero, ahora está en declive.",
    "en": "The city, once a thriving industrial hub, is now in decline."
  },
  {
    "es": "Se mostró inflexible en su decisión, a pesar de las súplicas de sus colegas.",
    "en": "He was adamant in his decision, despite the pleas from his colleagues."
  },
  {
    "es": "En caso de que necesites más ayuda, no dudes en contactarme.",
    "en": "Should you require further assistance, do not hesitate to contact me."
  },
  {
    "es": "El debate fue acalorado, con ambas partes defendiendo apasionadamente sus puntos de vista.",
    "en": "The debate was heated, with both sides passionately defending their views."
  },
  {
    "es": "Las consecuencias de la crisis ecológica se están volviendo cada vez más evidentes.",
    "en": "The fallout from the ecological crisis is becoming increasingly apparent."
  },
  {
    "es": "Solo mediante un esfuerzo concertado podremos superar este desafío.",
    "en": "Only through a concerted effort can we overcome this challenge."
  },
  {
    "es": "Abatida por la noticia, buscó consuelo en sus amigos.",
    "en": "Dejected by the news, she sought solace in her friends."
  },
  {
    "es": "Si yo estuviera a cargo, instituiría cambios radicales.",
    "en": "Were I in charge, I would institute sweeping changes."
  },
  {
    "es": "Sus logros son aún más notables dadas las difíciles circunstancias.",
    "en": "Her achievements are all the more remarkable given the difficult circumstances."
  },
  {
    "es": "No fue hasta que llegó a casa que se dio cuenta de que había perdido su billetera.",
    "en": "It wasn't until he got home that he realized he had lost his wallet."
  },
  {
    "es": "De no ser por la rápida respuesta de los servicios de emergencia, se habrían perdido más vidas.",
    "en": "Had it not been for the prompt response of the emergency services, more lives would have been lost."
  },
  {
    "es": "El nuevo hallazgo ha puesto en duda las teorías anteriores.",
    "en": "The new finding has cast doubt on previous theories."
  },
  {
    "es": "Si él no fuera tan arrogante, la gente podría tomarlo más en serio.",
    "en": "If he weren't so arrogant, people might take him more seriously."
  },
  {
    "es": "Habiendo vivido en el extranjero durante años, tiene una perspectiva cosmopolita.",
    "en": "Having lived abroad for years, she has a cosmopolitan outlook."
  },
  {
    "es": "No solo la comida era excelente, sino que el servicio también era impecable.",
    "en": "Not only was the food excellent, but the service was also impeccable."
  },
  {
    "es": "Su capacidad para mantener la calma bajo presión es digna de admiración.",
    "en": "His ability to remain composed under pressure is worthy of admiration."
  },
  {
    "es": "Se recomienda que se tomen precauciones para evitar la propagación del virus.",
    "en": "It is recommended that precautions be taken to prevent the spread of the virus."
  },
  {
    "es": "Por muy tentadora que sea la oferta, conlleva riesgos significativos.",
    "en": "However tempting the offer may be, it comes with significant risks."
  },
  {
    "es": "El problema se reduce a si estamos dispuestos a hacer los sacrificios necesarios.",
    "en": "The issue boils down to whether we are willing to make the necessary sacrifices."
  },
  {
    "es": "Si hubiera prestado atención a las señales de advertencia, podría haber evitado el desastre.",
    "en": "If he had heeded the warning signs, he might have avoided the disaster."
  },
  {
    "es": "El acuerdo es provisional y depende de la aprobación de la junta.",
    "en": "The agreement is tentative and contingent upon the board's approval."
  },
  {
    "es": "Impresionada por su profesionalismo, le ofreció el trabajo en el acto.",
    "en": "Impressed by his professionalism, she offered him the job on the spot."
  },
  {
    "es": "Lo que necesitamos es un cambio fundamental en nuestra forma de pensar.",
    "en": "What we're in need of is a fundamental shift in our thinking."
  },
  {
    "es": "En ninguna parte de su testimonio reconoció su participación.",
    "en": "Nowhere in his testimony did he acknowledge his involvement."
  },
  {
    "es": "La paz y la prosperidad son dos caras de la misma moneda.",
    "en": "Peace and prosperity are two sides of the same coin."
  },
  {
    "es": "Si no fuera por su constante interrupción, la reunión sería más productiva.",
    "en": "If it weren't for his constant interjections, the meeting would be more productive."
  },
  {
    "es": "La empresa está en proceso de reestructurar sus operaciones.",
    "en": "The company is in the process of restructuring its operations."
  },
  {
    "es": "Fue la perseverancia del equipo lo que finalmente les trajo el éxito.",
    "en": "It was the team's perseverance that ultimately brought them success."
  },
  {
    "es": "De no ser por la abrumadora evidencia, el caso habría sido desestimado.",
    "en": "Had there not been overwhelming evidence, the case would have been dismissed."
  },
  {
    "es": "La situación requiere un enfoque matizado, no una solución simplista.",
    "en": "The situation calls for a nuanced approach, not a simplistic solution."
  },
  {
    "es": "Habiendo sido testigo de la injusticia, se sintió obligada a hablar.",
    "en": "Having witnessed the injustice, she felt compelled to speak out."
  }
]
}
