{
  "phrases":[
  {
    "es": "Tal fue la indignación pública que la ley fue derogada de inmediato.",
    "en": "Such was the public outcry that the law was promptly repealed."
  },
  {
    "es": "Si no fuera por su incesante diligencia, el proyecto habría fracasado estrepitosamente.",
    "en": "But for her unceasing diligence, the project would have foundered spectacularly."
  },
  {
    "es": "Habiendo analizado minuciosamente los datos, llegó a una conclusión ineludible.",
    "en": "Having painstakingly analyzed the data, he reached an inescapable conclusion."
  },
  {
    "es": "El nuevo director ejecutivo se enfrenta a la nada envidiable tarea de reestructurar la empresa en quiebra.",
    "en": "The new CEO faces the unenviable task of restructuring the failing company."
  },
  {
    "es": "Sus intentos de ofuscar el asunto solo sirvieron para despertar más sospechas.",
    "en": "His attempts to obfuscate the issue only served to arouse further suspicion."
  },
  {
    "es": "Le corresponde al poder judicial interpretar las leyes de la nación.",
    "en": "It behoves the judiciary to interpret the laws of the land."
  },
  {
    "es": "Tan desconcertante era el problema que incluso los expertos se quedaron perplejos.",
    "en": "So perplexing was the problem that even the experts were left nonplussed."
  },
  {
    "es": "A pesar de sus pronunciamientos públicos, sus acciones privadas contaban una historia muy diferente.",
    "en": "Notwithstanding his public pronouncements, his private actions told a very different story."
  },
  {
    "es": "Baste decir que sus esfuerzos no fueron apreciados.",
    "en": "Suffice it to say, his efforts went unappreciated."
  },
  {
    "es": "Ganar la batalla fue una victoria pírrica, ya que las pérdidas superaron con creces las ganancias.",
    "en": "Winning the battle was a Pyrrhic victory, as the losses far outweighed the gains."
  },
  {
    "es": "El autor entrelaza hábilmente varios hilos narrativos en un todo coherente.",
    "en": "The author deftly interweaves various narrative threads into a cohesive whole."
  },
  {
    "es": "Sea como fuere, debemos proceder con el plan acordado.",
    "en": "Be that as it may, we must proceed with the agreed-upon plan."
  },
  {
    "es": "La corrupción endémica tuvo un efecto pernicioso en la economía del país.",
    "en": "Endemic corruption had a pernicious effect on the country's economy."
  },
  {
    "es": "Era la quintaesencia del caballero inglés, siempre impecablemente vestido y educado.",
    "en": "He was the quintessential English gentleman, always impeccably dressed and polite."
  },
  {
    "es": "Si el consejo hubiera prestado atención a las advertencias, la crisis podría haberse evitado.",
    "en": "Had the board heeded the warnings, the crisis might have been averted."
  },
  {
    "es": "La apatía generalizada del electorado es un presagio preocupante para la democracia.",
    "en": "The widespread apathy of the electorate is a worrying portent for democracy."
  },
  {
    "es": "Se mostró inflexible en su negativa a comprometer sus principios.",
    "en": "He was adamant in his refusal to compromise his principles."
  },
  {
    "es": "El tratado buscaba fomentar un espíritu de distensión entre las dos superpotencias.",
    "en": "The treaty sought to foster a spirit of détente between the two superpowers."
  },
  {
    "es": "Su discurso fue una diatriba incoherente contra el sistema.",
    "en": "His speech was a rambling diatribe against the establishment."
  },
  {
    "es": "Es un error creer que la tecnología es una panacea para todos nuestros problemas.",
    "en": "It is a fallacy to believe that technology is a panacea for all our problems."
  },
  {
    "es": "Al decidir despedir a su empleado más leal, cruzó el Rubicón.",
    "en": "In deciding to fire his most loyal employee, he crossed the Rubicon."
  },
  {
    "es": "La decisión de centralizar el poder demostró ser una espada de doble filo.",
    "en": "The decision to centralize power proved to be a double-edged sword."
  },
  {
    "es": "Poco se imaginaban que su plan aparentemente infalible se desmoronaría tan rápidamente.",
    "en": "Little did they know that their seemingly foolproof plan would unravel so quickly."
  },
  {
    "es": "El antiguo régimen fue denostado por su flagrante desprecio de los derechos humanos.",
    "en": "The old regime was reviled for its flagrant disregard for human rights."
  },
  {
    "es": "Acosado por el escándalo, el político se vio obligado a dimitir.",
    "en": "Beset by scandal, the politician was forced to resign."
  },
  {
    "es": "El acuerdo estaba supeditado a la aprobación final de los accionistas.",
    "en": "The deal was contingent upon final approval from the shareholders."
  },
  {
    "es": "Se propuso enmendar la constitución, una medida que resultó ser muy polémica.",
    "en": "It was proposed that the constitution be amended, a move that proved highly contentious."
  },
  {
    "es": "A pesar de sus esfuerzos por parecer tranquilo, su ansiedad era palpable.",
    "en": "Despite his efforts to appear calm, his anxiety was palpable."
  },
  {
    "es": "La empresa intentó eludir las regulaciones mediante lagunas legales.",
    "en": "The company sought to circumvent the regulations through legal loopholes."
  },
  {
    "es": "La nueva evidencia reivindicó por completo su afirmación de inocencia.",
    "en": "The new evidence completely vindicated his claim of innocence."
  },
  {
    "es": "Su mandato estuvo marcado por una serie de decisiones políticas desacertadas.",
    "en": "His tenure was marred by a series of ill-judged policy decisions."
  },
  {
    "es": "Las complejidades del caso estaban más allá del entendimiento del jurado promedio.",
    "en": "The intricacies of the case were beyond the ken of the average juror."
  },
  {
    "es": "En retrospectiva, sus advertencias proféticas deberían haber sido tomadas más en serio.",
    "en": "In hindsight, his prescient warnings should have been taken more seriously."
  },
  {
    "es": "La falta de financiación sigue siendo un obstáculo insuperable para la investigación.",
    "en": "A lack of funding remains an insuperable stumbling block to the research."
  },
  {
    "es": "Él pontificaba largamente sobre los méritos de un estilo de vida frugal.",
    "en": "He would pontificate at length on the merits of a frugal lifestyle."
  },
  {
    "es": "Se espera que el nuevo tratado anuncie una nueva era de cooperación.",
    "en": "The new treaty is expected to usher in a new era of cooperation."
  },
  {
    "es": "La repentina recesión económica cogió por sorpresa incluso a los analistas más astutos.",
    "en": "The sudden economic downturn caught even the most astute analysts by surprise."
  },
  {
    "es": "Impávido ante el aluvión de críticas, continuó con sus reformas.",
    "en": "Unfazed by the barrage of criticism, he pressed on with his reforms."
  },
  {
    "es": "La empresa se vio obligada a reconocer la magnitud de sus problemas financieros.",
    "en": "The company was forced to come to terms with the extent of its financial woes."
  },
  {
    "es": "El argumento del fiscal se basaba en una serie de inferencias en lugar de en pruebas contundentes.",
    "en": "The prosecutor's case rested on a series of inferences rather than hard evidence."
  },
  {
    "es": "Sus conocimientos esotéricos sobre artefactos antiguos no tenían parangón.",
    "en": "His esoteric knowledge of ancient artifacts was unparalleled."
  },
  {
    "es": "La verdad del asunto sigue envuelta en el misterio.",
    "en": "The truth of the matter remains shrouded in mystery."
  },
  {
    "es": "El salario ofrecido no era acorde con el nivel de responsabilidad requerido.",
    "en": "The salary on offer was not commensurate with the level of responsibility required."
  },
  {
    "es": "Sus primeras obras presagiaban la brillantez de su carrera posterior.",
    "en": "His early works foreshadowed the brilliance of his later career."
  },
  {
    "es": "Si yo estuviera en su precaria situación, exploraría todas las opciones posibles.",
    "en": "Were I in his precarious situation, I would explore every possible avenue."
  },
  {
    "es": "La tregua fue, en el mejor de los casos, tenue y se rompió en cuestión de semanas.",
    "en": "The truce was tenuous at best, and it broke down within weeks."
  },
  {
    "es": "Su elocuencia y carisma galvanizaron a la multitud para la acción.",
    "en": "His eloquence and charisma galvanized the crowd into action."
  },
  {
    "es": "El escándalo dejó una mancha indeleble en su reputación.",
    "en": "The scandal left an indelible stain on his reputation."
  },
  {
    "es": "El tejido mismo de la sociedad se vio amenazado por el conflicto civil.",
    "en": "The very fabric of society was threatened by the civil strife."
  },
  {
    "es": "Fue su negativa a aceptar un no por respuesta lo que finalmente aseguró el trato.",
    "en": "It was his refusal to take no for an answer that ultimately secured the deal."
  },
  {
    "es": "La nueva política fue criticada por ser un mero paliativo en lugar de una solución real.",
    "en": "The new policy was criticized for being a mere palliative rather than a real solution."
  },
  {
    "es": "No se puede exagerar la importancia de este descubrimiento.",
    "en": "The significance of this discovery cannot be overstated."
  },
  {
    "es": "Él negó vehementemente cualquier implicación en el escándalo.",
    "en": "He vehemently denied any involvement in the scandal."
  },
  {
    "es": "Los dos conceptos son antitéticos entre sí.",
    "en": "The two concepts are antithetical to one another."
  },
  {
    "es": "De no ser por una serie de acontecimientos fortuitos, nunca se habrían conocido.",
    "en": "But for a series of serendipitous events, they would never have met."
  },
  {
    "es": "El político intentó prevaricar cuando se le preguntó sobre sus vínculos con el lobby.",
    "en": "The politician tried to prevaricate when asked about his links to the lobby group."
  },
  {
    "es": "Abrumado por la culpa, confesó su participación en el encubrimiento.",
    "en": "Wracked with guilt, he confessed to his part in the cover-up."
  },
  {
    "es": "El auge del populismo es un fenómeno multifacético sin una causa única.",
    "en": "The rise of populism is a multifaceted phenomenon with no single cause."
  },
  {
    "es": "Su estilo de vida opulento contrastaba fuertemente con sus declaraciones de humildad.",
    "en": "His opulent lifestyle stood in stark contrast to his proclamations of humility."
  },
  {
    "es": "La investigación sacó a la luz una red de corrupción y engaño.",
    "en": "The investigation unearthed a web of corruption and deceit."
  },
  {
    "es": "En el meollo de su argumento yace una contradicción fundamental.",
    "en": "At the nub of his argument lies a fundamental contradiction."
  },
  {
    "es": "Era el epítome de la calma, incluso frente a una inmensa presión.",
    "en": "He was the epitome of composure, even in the face of immense pressure."
  },
  {
    "es": "La ubicuidad de los teléfonos inteligentes ha transformado la comunicación moderna.",
    "en": "The ubiquity of smartphones has transformed modern communication."
  },
  {
    "es": "La junta directiva se mostró reacia a aprobar una estrategia tan arriesgada.",
    "en": "The board of directors was loath to sanction such a risky strategy."
  },
  {
    "es": "Si hubiera previsto las repercusiones, podría haber actuado de manera diferente.",
    "en": "Had he foreseen the repercussions, he might have acted differently."
  },
  {
    "es": "El fracaso del proyecto fue un duro golpe para su ego.",
    "en": "The project's failure was a salutary blow to his ego."
  },
  {
    "es": "A pesar de sus diferencias ideológicas, encontraron un terreno común.",
    "en": "Notwithstanding their ideological differences, they found common ground."
  },
  {
    "es": "Fue su indefatigable búsqueda de la justicia lo que finalmente condujo a la verdad.",
    "en": "It was her indefatigable pursuit of justice that ultimately led to the truth."
  },
  {
    "es": "Su comportamiento en la reunión fue, por decir lo menos, poco profesional.",
    "en": "His conduct at the meeting was, to put it mildly, unprofessional."
  },
  {
    "es": "El tema del cambio climático sigue siendo un tema espinoso en la política internacional.",
    "en": "The issue of climate change remains a thorny topic in international politics."
  },
  {
    "es": "El gobierno implementó medidas draconianas para sofocar la disidencia.",
    "en": "The government implemented draconian measures to quell the dissent."
  },
  {
    "es": "La explicación que ofreció era tan inverosímil que rayaba en lo absurdo.",
    "en": "The explanation he offered was so implausible as to be bordering on the absurd."
  },
  {
    "es": "Ella se negó a aceptar el status quo y luchó incansablemente por el cambio.",
    "en": "She refused to acquiesce to the status quo and fought tirelessly for change."
  },
  {
    "es": "Rara vez la ciencia y el arte han estado tan elegantemente entrelazados.",
    "en": "Seldom have science and art been so elegantly intertwined."
  },
  {
    "es": "El descubrimiento de la penicilina fue un momento decisivo en la historia de la medicina.",
    "en": "The discovery of penicillin was a watershed moment in the history of medicine."
  },
  {
    "es": "Habiéndosele negado el ascenso, sintió una sensación de agravio.",
    "en": "Having been passed over for promotion, he felt a sense of grievance."
  },
  {
    "es": "No se puede eludir el hecho de que se deben hacer recortes presupuestarios.",
    "en": "There is no gainsaying the fact that budget cuts must be made."
  },
  {
    "es": "Su falta de previsión llevó a la empresa al borde del colapso.",
    "en": "His lack of foresight led the company to the brink of collapse."
  },
  {
    "es": "La decisión de vender los activos de la empresa fue un cáliz envenenado para el nuevo director.",
    "en": "The decision to sell the company's assets was a poisoned chalice for the new director."
  },
  {
    "es": "Axiomáticamente, una mayor demanda conduce a precios más altos.",
    "en": "Axiomatically, higher demand leads to higher prices."
  },
  {
    "es": "La situación requería tacto y diplomacia, cualidades de las que él carecía por completo.",
    "en": "The situation called for tact and diplomacy, qualities he was sorely lacking."
  },
  {
    "es": "Tal era la belleza del paisaje que lo dejó sin aliento.",
    "en": "Such was the beauty of the landscape that it left him breathless."
  },
  {
    "es": "El general fue elogiado por su brillantez táctica en el campo de batalla.",
    "en": "The general was lionized for his tactical brilliance on the battlefield."
  },
  {
    "es": "Si no fuera por su terquedad innata, podría haber admitido su error hace mucho tiempo.",
    "en": "Were it not for his innate stubbornness, he might have conceded his mistake long ago."
  },
  {
    "es": "La declaración oficial estaba llena de eufemismos para ocultar la dura realidad.",
    "en": "The official statement was riddled with euphemisms to conceal the harsh reality."
  },
  {
    "es": "Habiendo malgastado su herencia, se encontró sin un céntimo y sin amigos.",
    "en": "Having squandered his inheritance, he found himself penniless and friendless."
  },
  {
    "es": "El nadir de su carrera llegó cuando su empresa se declaró en quiebra.",
    "en": "The nadir of his career came when his company filed for bankruptcy."
  },
  {
    "es": "La retórica del político era incendiaria y buscaba polarizar al electorado.",
    "en": "The politician's rhetoric was incendiary and sought to polarize the electorate."
  },
  {
    "es": "Para elucidar su punto, utilizó una serie de analogías cuidadosamente elegidas.",
    "en": "To elucidate his point, he used a series of carefully chosen analogies."
  },
  {
    "es": "La proliferación de noticias falsas representa una grave amenaza para las sociedades democráticas.",
    "en": "The proliferation of fake news poses a grave threat to democratic societies."
  },
  {
    "es": "El error fue tan grave que fue necesaria una disculpa pública.",
    "en": "So egregious was the error that a public apology was required."
  },
  {
    "es": "Su discurso, aunque bien intencionado, descendió a un sentimentalismo empalagoso.",
    "en": "His speech, while well-intentioned, descended into mawkish sentimentality."
  },
  {
    "es": "Bajo ninguna circunstancia se debe comprometer la integridad de la investigación.",
    "en": "On no account must the integrity of the investigation be compromised."
  },
  {
    "es": "Ella evitaba la ostentación, prefiriendo una vida de tranquila sencillez.",
    "en": "She eschewed ostentation, preferring a life of quiet simplicity."
  },
  {
    "es": "De no ser por el colapso del mercado de valores, ahora sería un hombre muy rico.",
    "en": "But for the stock market crash, he would be a very wealthy man now."
  },
  {
    "es": "Los críticos desestimaron la película por ser derivada y carente de originalidad.",
    "en": "The film was panned by critics for being derivative and lacking in originality."
  },
  {
    "es": "Fue su inquebrantable optimismo lo que los sostuvo en los momentos más oscuros.",
    "en": "It was her unshakeable optimism that sustained them through the darkest of times."
  },
  {
    "es": "Las condiciones del armisticio fueron onerosas para la nación derrotada.",
    "en": "The terms of the armistice were onerous for the defeated nation."
  },
  {
    "es": "Sus conocimientos sobre el tema eran superficiales en el mejor de los casos.",
    "en": "His knowledge of the subject was perfunctory at best."
  },
  {
    "es": "El repentino cambio de política exacerbó las tensiones existentes.",
    "en": "The sudden policy shift exacerbated the existing tensions."
  },
  {
    "es": "La arquitectura del edificio es una amalgama ecléctica de estilos.",
    "en": "The building's architecture is an eclectic amalgamation of styles."
  },
  {
    "es": "Su intento de reconciliación fue recibido con un desdén apenas disimulado.",
    "en": "His attempt at reconciliation was met with thinly veiled disdain."
  },
  {
    "es": "Poco se daba cuenta de que sus acciones tendrían consecuencias de gran alcance.",
    "en": "Little did she realize that her actions would have far-reaching consequences."
  },
  {
    "es": "La recesión precipitó una fuerte caída en la confianza del consumidor.",
    "en": "The recession precipitated a sharp downturn in consumer confidence."
  },
  {
    "es": "El libro ofrece un examen incisivo de la sociedad contemporánea.",
    "en": "The book provides an incisive examination of contemporary society."
  },
  {
    "es": "Si los responsables políticos hubieran sido más previsores, la crisis podría haberse mitigado.",
    "en": "Had policymakers been more prescient, the crisis could have been mitigated."
  },
  {
    "es": "La situación se ha deteriorado hasta el punto de que la intervención militar parece inevitable.",
    "en": "The situation has deteriorated to the point where military intervention seems inevitable."
  },
  {
    "es": "El nuevo sistema está diseñado para ser impermeable a los ciberataques.",
    "en": "The new system is designed to be impervious to cyber-attacks."
  },
  {
    "es": "La respuesta del gobierno a la catástrofe fue lamentablemente inadecuada.",
    "en": "The government's response to the disaster was woefully inadequate."
  },
  {
    "es": "A pesar de la plétora de pruebas, el jurado no pudo llegar a un veredicto unánime.",
    "en": "Despite the plethora of evidence, the jury failed to reach a unanimous verdict."
  },
  {
    "es": "Atrapado en un dilema, sopesó los méritos relativos de cada opción.",
    "en": "Caught in a quandary, he weighed the relative merits of each option."
  },
  {
    "es": "La idea de la libertad de expresión es anatema para los regímenes autoritarios.",
    "en": "The very idea of free speech is anathema to authoritarian regimes."
  },
  {
    "es": "A falta de un plan B, no tenemos más remedio que seguir adelante.",
    "en": "In the absence of a Plan B, we have no recourse but to press on."
  },
  {
    "es": "El ascenso de la inteligencia artificial anuncia profundos cambios sociales.",
    "en": "The rise of artificial intelligence portends profound societal shifts."
  },
  {
    "es": "La empresa cultivaba una imagen de benevolencia corporativa.",
    "en": "The company cultivated an image of corporate benevolence."
  },
  {
    "es": "Su discurso fue un modelo de claridad y concisión.",
    "en": "His speech was a paragon of clarity and conciseness."
  },
  {
    "es": "Sus comentarios improvisados provocaron una tormenta mediática.",
    "en": "His off-the-cuff remarks sparked a media firestorm."
  },
  {
    "es": "Si se suprimiera esta información, las consecuencias serían nefastas.",
    "en": "Were this information to be suppressed, the consequences would be dire."
  },
  {
    "es": "Las pruebas presentadas eran, en el mejor de los casos, endebles y no concluyentes.",
    "en": "The evidence presented was flimsy and inconclusive at best."
  },
  {
    "es": "La narrativa histórica a menudo margina las voces de los oprimidos.",
    "en": "The historical narrative often marginalizes the voices of the oppressed."
  },
  {
    "es": "La fusión de las dos empresas fue anunciada como una unión de iguales.",
    "en": "The merger of the two companies was heralded as a joining of equals."
  },
  {
    "es": "Sus disculpas carecían de la contrición que la situación ameritaba.",
    "en": "His apology lacked the contrition that the situation warranted."
  },
  {
    "es": "El gobierno intentó acallar a la prensa con amenazas veladas.",
    "en": "The government attempted to cow the press into silence with veiled threats."
  },
  {
    "es": "La complejidad del lenguaje jurídico puede ser un obstáculo para los legos.",
    "en": "The Byzantine complexity of legal jargon can be a barrier for laypeople."
  },
  {
    "es": "Despojado de su título y rango, se exilió.",
    "en": "Divested of his title and rank, he went into exile."
  },
  {
    "es": "Las negociaciones llegaron a un punto muerto sobre la cuestión de las reparaciones.",
    "en": "The negotiations reached an impasse over the question of reparations."
  },
  {
    "es": "En ninguna otra disciplina es la precisión tan críticamente importante.",
    "en": "In no other discipline is precision so critically important."
  },
  {
    "es": "Su estilo de vida ascético contrastaba con la decadencia de sus pares.",
    "en": "His ascetic lifestyle was at odds with the decadence of his peers."
  },
  {
    "es": "La paz sigue siendo esquiva a pesar de los repetidos esfuerzos diplomáticos.",
    "en": "Peace remains elusive despite repeated diplomatic efforts."
  },
  {
    "es": "El escándalo ha dejado una mancha imborrable en el legado del presidente.",
    "en": "The scandal has left an ineradicable blot on the president's legacy."
  },
  {
    "es": "Si la empresa no se adapta, corre el riesgo de volverse obsoleta.",
    "en": "Unless the company adapts, it risks becoming obsolete."
  },
  {
    "es": "La decisión del tribunal sentó un precedente para casos futuros.",
    "en": "The court's ruling set a precedent for future cases."
  },
  {
    "es": "Él estaba en una posición envidiable, con múltiples ofertas de trabajo sobre la mesa.",
    "en": "He was in the enviable position of having multiple job offers on the table."
  },
  {
    "es": "La nueva política es, a todos los efectos, una repetición de la anterior.",
    "en": "The new policy is, to all intents and purposes, a rehash of the old one."
  },
  {
    "es": "Su argumento se basaba en la premisa errónea de que la correlación implica causalidad.",
    "en": "His argument was predicated on the flawed premise that correlation implies causation."
  },
  {
    "es": "La respuesta de la crítica a su última novela ha sido tibia.",
    "en": "The critical response to his latest novel has been lukewarm."
  },
  {
    "es": "El aumento de la automatización podría hacer superfluos muchos trabajos.",
    "en": "The rise of automation could render many jobs superfluous."
  },
  {
    "es": "Los dos países han estado enfrascados en una disputa fronteriza durante décadas.",
    "en": "The two countries have been embroiled in a border dispute for decades."
  },
  {
    "es": "Tan profundo fue su impacto que redefinió todo el campo.",
    "en": "So profound was his impact that he redefined the entire field."
  },
  {
    "es": "El testigo fue acusado de perjurio tras cambiar su testimonio.",
    "en": "The witness was accused of perjury after changing his testimony."
  },
  {
    "es": "El cinismo que impregna la política moderna es profundamente desalentador.",
    "en": "The cynicism that pervades modern politics is deeply disheartening."
  },
  {
    "es": "Ella se negó a ser encasillada como una simple actriz de comedia.",
    "en": "She refused to be pigeonholed as a mere comedic actress."
  },
  {
    "es": "Su apoyo fue fundamental para el éxito de la campaña.",
    "en": "His support was instrumental to the success of the campaign."
  },
  {
    "es": "La atmósfera en la reunión estaba cargada de una tensión no expresada.",
    "en": "The atmosphere in the meeting was fraught with unspoken tension."
  },
  {
    "es": "Habiendo sido advertido de los riesgos, procedió bajo su propio riesgo.",
    "en": "Having been apprised of the risks, he proceeded at his own peril."
  },
  {
    "es": "Sus puntos de vista sobre la educación son decididamente anticuados.",
    "en": "His views on education are decidedly antediluvian."
  },
  {
    "es": "Es un axioma que el poder corrompe.",
    "en": "It is an axiom that power corrupts."
  },
  {
    "es": "El declive de la industria fue un microcosmos de tendencias económicas más amplias.",
    "en": "The industry's decline was a microcosm of broader economic trends."
  },
  {
    "es": "El nuevo impuesto fue condenado como un ataque furtivo a los pobres.",
    "en": "The new tax was condemned as a stealthy attack on the poor."
  },
  {
    "es": "Si se hubiera implementado antes, la política podría haber tenido más éxito.",
    "en": "Had the policy been implemented sooner, it might have been more successful."
  },
  {
    "es": "Su dominio de varios idiomas era una ventaja formidable en la diplomacia.",
    "en": "Her command of several languages was a formidable asset in diplomacy."
  },
  {
    "es": "Los historiadores no se ponen de acuerdo sobre las causas exactas de la caída del imperio.",
    "en": "Historians are at variance over the exact causes of the empire's fall."
  },
  {
    "es": "El cambio hacia el trabajo remoto ha sido una bendición disfrazada para muchos.",
    "en": "The shift to remote work has been a blessing in disguise for many."
  },
  {
    "es": "La evidencia fue considerada inadmisible por motivos de procedimiento.",
    "en": "The evidence was deemed inadmissible on procedural grounds."
  },
  {
    "es": "El tono de su voz delataba una exasperación apenas contenida.",
    "en": "The timbre of his voice betrayed a barely-suppressed exasperation."
  },
  {
    "es": "La empresa intentó sacar provecho de la nostalgia por la década de 1990.",
    "en": "The company tried to cash in on the nostalgia for the 1990s."
  },
  {
    "es": "Su explicación nebulosa no hizo nada para aclarar el asunto.",
    "en": "His nebulous explanation did nothing to clarify the matter."
  },
  {
    "es": "La economía está mostrando signos provisionales de salir de la recesión.",
    "en": "The economy is showing tentative signs of emerging from the recession."
  },
  {
    "es": "Poco podía saber él que la fortuna estaba a punto de sonreírle.",
    "en": "Little could he have known that fortune was about to smile upon him."
  },
  {
    "es": "Las secuelas de la guerra civil dejaron cicatrices indelebles en la psique de la nación.",
    "en": "The aftermath of the civil war left indelible scars on the nation's psyche."
  },
  {
    "es": "El plan era audaz en su concepción, pero deficiente en su ejecución.",
    "en": "The plan was audacious in its conception, but flawed in its execution."
  },
  {
    "es": "Se mostró circunspecto a la hora de hacer promesas que no podría cumplir.",
    "en": "He was circumspect about making promises he might not be able to keep."
  },
  {
    "es": "A pesar de la fachada de unidad, existían profundas divisiones en el partido.",
    "en": "Despite the facade of unity, deep schisms existed within the party."
  },
  {
    "es": "La retórica del demagogo avivó las llamas del descontento popular.",
    "en": "The demagogue's rhetoric fanned the flames of popular discontent."
  },
  {
    "es": "Las súplicas de clemencia de la familia cayeron en oídos sordos.",
    "en": "The family's entreaties for clemency fell on deaf ears."
  },
  {
    "es": "De no ser por su intervención, el frágil acuerdo se habría desmoronado.",
    "en": "But for his intervention, the fragile agreement would have fallen apart."
  },
  {
    "es": "Sus logros han sido ensombrecidos por acusaciones de mala conducta.",
    "en": "His achievements have been overshadowed by allegations of misconduct."
  },
  {
    "es": "El artista se deleitaba en subvertir las convenciones artísticas tradicionales.",
    "en": "The artist reveled in subverting traditional artistic conventions."
  },
  {
    "es": "La propuesta fue rechazada de plano por ser totalmente impracticable.",
    "en": "The proposal was rejected out of hand as being utterly impracticable."
  },
  {
    "es": "En la era digital, la privacidad se ha convertido en una mercancía cada vez más escasa.",
    "en": "In the digital age, privacy has become an increasingly scarce commodity."
  },
  {
    "es": "Su estilo de gestión era más autocrático que colaborativo.",
    "en": "His management style was more autocratic than collaborative."
  },
  {
    "es": "El incidente sirvió como catalizador para un cambio muy necesario.",
    "en": "The incident served as a catalyst for much-needed change."
  },
  {
    "es": "El cese al fuego se mantuvo, aunque de manera precaria, durante varias semanas.",
    "en": "The ceasefire held, albeit precariously, for several weeks."
  },
  {
    "es": "Los beneficios de la nueva política son, en el mejor de los casos, discutibles.",
    "en": "The benefits of the new policy are debatable at best."
  },
  {
    "es": "Sus puntos de vista son la antítesis de todo lo que yo defiendo.",
    "en": "His views are the antithesis of everything I stand for."
  },
  {
    "es": "Acosado por las lesiones, la carrera del atleta terminó prematuramente.",
    "en": "Plagued by injuries, the athlete's career ended prematurely."
  },
  {
    "es": "Habiendo evaluado la situación, concluyó que la retirada era la única opción viable.",
    "en": "Having assessed the situation, he concluded that retreat was the only viable option."
  },
  {
    "es": "La victoria del equipo en el campeonato fue la culminación de años de arduo trabajo.",
    "en": "The team's championship victory was the culmination of years of hard work."
  },
  {
    "es": "Si yo fuera un cínico, diría que su generosidad está motivada por el interés propio.",
    "en": "Were I a cynic, I would say his generosity is motivated by self-interest."
  },
  {
    "es": "Los dos países acordaron poner fin a décadas de animosidad.",
    "en": "The two countries agreed to end decades of animosity."
  },
  {
    "es": "La declaración del testigo corroboró la coartada del acusado.",
    "en": "The witness's statement corroborated the defendant's alibi."
  },
  {
    "es": "La empresa estaba al borde de la insolvencia y necesitaba un rescate.",
    "en": "The company was on the precipice of insolvency and in need of a bailout."
  },
  {
    "es": "El argumento es falaz porque se basa en una falsa dicotomía.",
    "en": "The argument is fallacious because it rests on a false dichotomy."
  },
  {
    "es": "El nuevo impuesto resultó ser un anatema para los propietarios de pequeñas empresas.",
    "en": "The new tax proved to be anathema to small business owners."
  },
  {
    "es": "Sus contribuciones al campo de la física son inconmensurables.",
    "en": "His contributions to the field of physics are immeasurable."
  },
  {
    "es": "La película es una crítica mordaz de la superficialidad de la cultura de las celebridades.",
    "en": "The film is a trenchant critique of the superficiality of celebrity culture."
  },
  {
    "es": "Las tensiones latentes entre los dos grupos finalmente estallaron en violencia.",
    "en": "The latent tensions between the two groups finally erupted into violence."
  },
  {
    "es": "Rara vez un discurso ha provocado una respuesta tan visceral.",
    "en": "Rarely has a speech elicited such a visceral response."
  },
  {
    "es": "Su reputación de integridad era irreprochable.",
    "en": "His reputation for integrity was beyond reproach."
  },
  {
    "es": "Las reformas propuestas son más cosméticas que sustanciales.",
    "en": "The proposed reforms are more cosmetic than substantive."
  },
  {
    "es": "El informe expone la cruda realidad de la pobreza en las ciudades.",
    "en": "The report lays bare the stark reality of inner-city poverty."
  },
  {
    "es": "Si hubiera habido más transparencia, el escándalo podría haberse evitado.",
    "en": "Had there been greater transparency, the scandal might have been avoided."
  },
  {
    "es": "El candidato intentó ganarse el favor del electorado con promesas poco realistas.",
    "en": "The candidate tried to curry favor with the electorate through unrealistic promises."
  },
  {
    "es": "La decisión del gobierno de aumentar los impuestos provocó una condena generalizada.",
    "en": "The government's decision to raise taxes met with widespread condemnation."
  },
  {
    "es": "El descubrimiento fortuito del laboratorio condujo a un importante avance médico.",
    "en": "The lab's serendipitous discovery led to a major medical breakthrough."
  },
  {
    "es": "No tuvo más remedio que aceptar su destino con ecuanimidad.",
    "en": "He had no choice but to accept his fate with equanimity."
  },
  {
    "es": "El cénit de su carrera fue ganar la medalla de oro olímpica.",
    "en": "The zenith of her career was winning the Olympic gold medal."
  },
  {
    "es": "La tecnología de la empresa le da una ventaja competitiva decisiva.",
    "en": "The company's proprietary technology gives it a decisive competitive edge."
  },
  {
    "es": "Sus comentarios sentenciosos eran a la vez condescendientes e irritantes.",
    "en": "His sententious remarks were both patronizing and irritating."
  },
  {
    "es": "La evidencia fue concluyente, no dejando lugar a dudas.",
    "en": "The evidence was dispositive, leaving no room for doubt."
  },
  {
    "es": "Habiendo nacido en la riqueza, no podía comprender las dificultades de los pobres.",
    "en": "Having been born into affluence, he could not fathom the hardships of the poor."
  },
  {
    "es": "El libro es una refutación exhaustiva de las teorías de su rival.",
    "en": "The book is a comprehensive rebuttal of his rival's theories."
  },
  {
    "es": "Su comportamiento errático suscitó preocupaciones sobre su aptitud para el cargo.",
    "en": "His erratic behavior raised concerns about his fitness for office."
  },
  {
    "es": "Los dos estilos, aunque superficialmente diferentes, comparten un linaje común.",
    "en": "The two styles, while superficially different, share a common lineage."
  },
  {
    "es": "Tan pronto como se firmó el acuerdo, comenzaron los trabajos de construcción.",
    "en": "No sooner was the agreement signed than construction work began."
  },
  {
    "es": "El incidente diplomático amenazaba con deshacer años de progreso.",
    "en": "The diplomatic incident threatened to unravel years of progress."
  },
  {
    "es": "Sus argumentos se basaban en un razonamiento tortuoso y sofistería.",
    "en": "His arguments were based on tortuous reasoning and sophistry."
  },
  {
    "es": "El camino hacia la recuperación económica estará, sin duda, lleno de dificultades.",
    "en": "The road to economic recovery will undoubtedly be fraught with difficulty."
  },
  {
    "es": "Si yo fuera propenso a la hipérbole, lo llamaría el mayor descubrimiento del siglo.",
    "en": "Were I prone to hyperbole, I would call it the greatest discovery of the century."
  },
  {
    "es": "La empresa fue criticada por su descarado desprecio por las normas medioambientales.",
    "en": "The company was castigated for its brazen disregard for environmental regulations."
  },
  {
    "es": "El tema del nepotismo era el elefante en la habitación.",
    "en": "The issue of nepotism was the elephant in the room."
  },
  {
    "es": "Sus puntos de vista son un anatema para cualquiera que valore la libertad individual.",
    "en": "His views are anathema to anyone who values individual liberty."
  },
  {
    "es": "El equipo se recuperó de una desventaja de dos goles para asegurar un empate notable.",
    "en": "The team clawed their way back from a two-goal deficit to secure a remarkable draw."
  },
  {
    "es": "Su memoria prodigiosa le permitía recordar hasta los detalles más triviales.",
    "en": "His prodigious memory allowed him to recall even the most trivial of details."
  },
  {
    "es": "El político intentó disimular su falta de conocimiento con una retórica grandilocuente.",
    "en": "The politician tried to dissemble his lack of knowledge with bombastic rhetoric."
  },
  {
    "es": "En retrospectiva, la decisión de invadir fue un error de cálculo colosal.",
    "en": "In retrospect, the decision to invade was a colossal miscalculation."
  },
  {
    "es": "La prosa del autor es a menudo enrevesada e innecesariamente compleja.",
    "en": "The author's prose is often convoluted and needlessly complex."
  },
  {
    "es": "Solo después de un examen más detallado se hicieron evidentes los defectos.",
    "en": "Only upon closer inspection did the flaws become apparent."
  },
  {
    "es": "El nuevo sistema, aunque prometedor, está lejos de ser una panacea.",
    "en": "The new system, while promising, is far from a panacea."
  },
  {
    "es": "Su intento de reconciliación fue rechazado sin contemplaciones.",
    "en": "His conciliatory gesture was rebuffed unceremoniously."
  },
  {
    "es": "Los fundamentos de su teoría han sido completamente desacreditados.",
    "en": "The underpinnings of his theory have been thoroughly debunked."
  },
  {
    "es": "De no ser por los avances en la ciencia forense, el caso seguiría sin resolverse.",
    "en": "But for the advances in forensic science, the case would remain unsolved."
  },
  {
    "es": "El plan era quijotesco y estaba destinado al fracaso desde el principio.",
    "en": "The plan was quixotic and doomed to failure from the outset."
  },
  {
    "es": "Ella se negó a ser cómplice de sus actividades ilícitas.",
    "en": "She refused to be complicit in their illicit activities."
  },
  {
    "es": "La película fue un éxito de taquilla rotundo, superando todas las expectativas.",
    "en": "The film was a resounding box-office success, surpassing all expectations."
  },
  {
    "es": "El tiempo inclemente obligó a los organizadores a cancelar el evento al aire libre.",
    "en": "The inclement weather forced the organizers to cancel the outdoor event."
  },
  {
    "es": "El orador evitó la controversia y se ciñó a generalidades inofensivas.",
    "en": "The speaker eschewed controversy, sticking toodyne platitudes."
  },
  {
    "es": "Habiendo anticipado sus objeciones, preparó una refutación detallada.",
    "en": "Having anticipated their objections, he prepared a detailed rebuttal."
  },
  {
    "es": "La empresa se encontró en la posición insostenible de deber miles de millones.",
    "en": "The company found itself in the untenable position of owing billions."
  },
  {
    "es": "A pesar de su edad, mantiene un horario de trabajo agotador.",
    "en": "Notwithstanding his age, he maintains a grueling work schedule."
  },
  {
    "es": "La investigación no arrojó pruebas que corroboraran las acusaciones.",
    "en": "The inquiry yielded no evidence to substantiate the allegations."
  },
  {
    "es": "La supuesta objetividad del informe fue puesta en duda por varios expertos.",
    "en": "The report's purported objectivity was called into question by several experts."
  },
  {
    "es": "Sus divagaciones tangenciales hicieron difícil seguir el hilo de su argumento.",
    "en": "His tangential digressions made it difficult to follow the thread of his argument."
  },
  {
    "es": "El nuevo impuesto es regresivo y afectará de manera desproporcionada a los pobres.",
    "en": "The new tax is regressive and will disproportionately affect the poor."
  },
  {
    "es": "Si los líderes mundiales no actúan de manera concertada, las consecuencias serán catastróficas.",
    "en": "Unless world leaders act in concert, the consequences will be catastrophic."
  },
  {
    "es": "El veredicto fue una reivindicación para aquellos que habían luchado por la justicia durante mucho tiempo.",
    "en": "The verdict came as a vindication for those who had long campaigned for justice."
  },
  {
    "es": "Los dos países acordaron resolver sus diferencias de manera amistosa.",
    "en": "The two countries agreed to resolve their differences amicably."
  },
  {
    "es": "El proyecto fue un fracaso abyecto, costando a los contribuyentes millones.",
    "en": "The project was an abject failure, costing taxpayers millions."
  },
  {
    "es": "La burocracia bizantina de la organización sofoca la innovación.",
    "en": "The organization's Byzantine bureaucracy stifles innovation."
  },
  {
    "es": "El incidente puso de manifiesto las fallas sistémicas dentro de la institución.",
    "en": "The incident brought into sharp relief the systemic failings within the institution."
  },
  {
    "es": "Él tiene una tendencia a ser dogmático, desestimando cualquier punto de vista que difiera del suyo.",
    "en": "He has a tendency to be doctrinaire, dismissing any viewpoint that differs from his own."
  },
  {
    "es": "Las complejidades del sistema legal pueden ser desalentadoras para los no iniciados.",
    "en": "The intricacies of the legal system can be daunting for the uninitiated."
  },
  {
    "es": "Los efectos soporíferos de la conferencia hicieron difícil mantenerse despierto.",
    "en": "The soporific effects of the lecture made it difficult to stay awake."
  },
  {
    "es": "Las negociaciones se prolongaron, con ambas partes intransigentes en sus demandas.",
    "en": "The negotiations dragged on, with both sides intransigent in their demands."
  },
  {
    "es": "Habiendo asegurado la financiación, el proyecto pudo finalmente proceder.",
    "en": "The funding having been secured, the project was finally able to proceed."
  },
  {
    "es": "Su efusiva alabanza parecía un tanto falsa y poco sincera.",
    "en": "His effusive praise seemed somewhat disingenuous and insincere."
  },
  {
    "es": "La repentina afluencia de refugiados puso a prueba los recursos locales.",
    "en": "The sudden influx of refugees placed a strain on local resources."
  },
  {
    "es": "A pesar de su exterior jovial, albergaba un profundo resentimiento.",
    "en": "Despite his jovial exterior, he harbored a deep-seated resentment."
  },
  {
    "es": "Tan pronto como se corrió la voz, la propiedad fue inundada de ofertas.",
    "en": "No sooner had word got out than the property was inundated with offers."
  },
  {
    "es": "Las condiciones de vida en el campamento eran espantosas y antihigiénicas.",
    "en": "The living conditions in the camp were squalid and unsanitary."
  },
  {
    "es": "Su contribución a la literatura es, sin lugar a dudas, monumental.",
    "en": "His contribution to literature is, by any yardstick, monumental."
  },
  {
    "es": "Las reformas propuestas no son más que un retoque en los bordes.",
    "en": "The proposed reforms are nothing more than tinkering around the edges."
  },
  {
    "es": "Si se le hubiera dado la oportunidad, habría demostrado que sus críticos estaban equivocados.",
    "en": "Had he been given the opportunity, he would have proven his detractors wrong."
  },
  {
    "es": "Su comportamiento obsequioso hacia sus superiores era nauseabundo.",
    "en": "His obsequious behavior towards his superiors was nauseating."
  },
  {
    "es": "La película es una alegoría de la lucha entre el bien y el mal.",
    "en": "The film is an allegory of the struggle between good and evil."
  },
  {
    "es": "El juez reprendió al abogado por sus tácticas dilatorias.",
    "en": "The judge admonished the lawyer for his dilatory tactics."
  },
  {
    "es": "El acuerdo fue anulado porque se firmó bajo coacción.",
    "en": "The agreement was rendered null and void because it was signed under duress."
  },
  {
    "es": "Él estaba en una encrucijada en su carrera, sin saber qué camino tomar.",
    "en": "He was at a crossroads in his career, unsure which path to take."
  },
  {
    "es": "El informe del comité fue una acusación fulminante de la cultura de la empresa.",
    "en": "The committee's report was a damning indictment of the company's culture."
  },
  {
    "es": "Su intento de justificar sus acciones sonó hueco y poco convincente.",
    "en": "His attempt to rationalize his actions rang hollow and unconvincing."
  },
  {
    "es": "La verdad del asunto es que no podemos permitirnos posponer más la decisión.",
    "en": "The long and short of it is that we cannot afford to postpone the decision any longer."
  },
  {
    "es": "Habiendo presenciado de primera mano la devastación, se convirtió en un defensor de la paz.",
    "en": "Having witnessed the devastation firsthand, he became a proponent of peace."
  },
  {
    "es": "La decisión del gobierno de recortar la financiación de las artes fue recibida con incredulidad.",
    "en": "The government's decision to cut arts funding was met with incredulity."
  },
  {
    "es": "El candidato eludió la pregunta con una serie de generalidades sin sentido.",
    "en": "The candidate fobbed off the question with a series of meaningless platitudes."
  },
  {
    "es": "El problema de la desigualdad de ingresos es un acertijo que ha desconcertado a los economistas durante décadas.",
    "en": "The problem of income inequality is a conundrum that has perplexed economists for decades."
  },
  {
    "es": "Rara vez una sola pieza legislativa ha tenido consecuencias tan generalizadas.",
    "en": "Rarely has a single piece of legislation had such widespread ramifications."
  },
  {
    "es": "Las tensiones geopolíticas amenazan con sumir a la región en el caos.",
    "en": "Geopolitical tensions threaten to plunge the region into turmoil."
  },
  {
    "es": "El lenguaje florido del contrato oscurecía sus términos predatorios.",
    "en": "The contract's florid language obscured its predatory terms."
  },
  {
    "es": "Si la empresa quiere seguir siendo competitiva, debe innovar o perecer.",
    "en": "If the company is to remain competitive, it must innovate or perish."
  },
  {
    "es": "Su silencio sobre el asunto ha sido ensordecedor.",
    "en": "His silence on the matter has been deafening."
  },
  {
    "es": "El proyecto fue abandonado a mitad de camino, dejando un elefante blanco en el centro de la ciudad.",
    "en": "The project was abandoned halfway through, leaving a white elephant in the city center."
  },
  {
    "es": "La nueva tecnología ha hecho que las habilidades de muchos trabajadores sean redundantes.",
    "en": "The new technology has rendered the skills of many workers redundant."
  },
  {
    "es": "Él se negó a dejarse arrastrar a una discusión mezquina sobre detalles triviales.",
    "en": "He refused to be drawn into a petty squabble over trivial details."
  },
  {
    "es": "El declive de la ciudad es emblemático de un malestar industrial más amplio.",
    "en": "The city's decline is emblematic of a wider industrial malaise."
  },
  {
    "es": "Su discurso fue un ejercicio de circunloquio, evitando cualquier compromiso directo.",
    "en": "His speech was an exercise in circumlocution, avoiding any direct commitment."
  },
  {
    "es": "El nuevo sistema, aunque imperfecto, es una mejora ostensible con respecto al anterior.",
    "en": "The new system, while flawed, is an ostensible improvement on the old one."
  },
  {
    "es": "Su aparente falta de preocupación por las víctimas conmocionó a la nación.",
    "en": "His seeming lack of compunction for the victims shocked the nation."
  },
  {
    "es": "Tan pronto como se hizo el anuncio, el mercado de valores se disparó.",
    "en": "No sooner had the announcement been made than the stock market soared."
  },
  {
    "es": "El político fue criticado por su respuesta tibia a la crisis.",
    "en": "The politician was lambasted for his tepid response to the crisis."
  },
  {
    "es": "Las condiciones impuestas al país eran tan punitivas que hicieron inevitable un conflicto futuro.",
    "en": "The terms imposed on the country were so punitive as to make future conflict inevitable."
  },
  {
    "es": "La belleza etérea del amanecer sobre las montañas era sobrecogedora.",
    "en": "The ethereal beauty of the sunrise over the mountains was breathtaking."
  },
  {
    "es": "Habiendo sido eximido de toda culpa, fue reintegrado a su puesto.",
    "en": "Having been exonerated of all blame, he was reinstated to his post."
  },
  {
    "es": "La legislación propuesta es un mosaico de compromisos y concesiones.",
    "en": "The proposed legislation is a patchwork of compromises and concessions."
  },
  {
    "es": "De no ser por su patrocinio, la orquesta se habría disuelto hace años.",
    "en": "But for her patronage, the orchestra would have disbanded years ago."
  },
  {
    "es": "El libro ofrece una crítica mordaz de las hipocresías de la sociedad victoriana.",
    "en": "The book provides a scathing critique of the hypocrisies of Victorian society."
  },
  {
    "es": "La situación exige un replanteamiento fundamental de nuestras prioridades.",
    "en": "The situation calls for a fundamental reappraisal of our priorities."
  },
  {
    "es": "Él está en la vanguardia de la investigación sobre inteligencia artificial.",
    "en": "He is at the vanguard of research into artificial intelligence."
  },
  {
    "es": "Su negativa a negociar solo sirvió para afianzar las posiciones de la oposición.",
    "en": "His refusal to negotiate only served to entrench the opposition's positions."
  },
  {
    "es": "La respuesta de la comunidad internacional a la crisis ha sido lamentablemente fragmentaria.",
    "en": "The international community's response to the crisis has been regrettably piecemeal."
  },
  {
    "es": "Si se hubieran seguido los protocolos de seguridad, el accidente nunca habría ocurrido.",
    "en": "Had the safety protocols been followed, the accident would never have occurred."
  }
]
}
